[
{"programName": "Software Engineering Systems", "title": "Junior Data Engineer", "jobId": "3385235136", "companyName": "iland Cloud", "location": "Houston, TX", "datePosted": "2022-12-01", "link": "https://www.linkedin.com/jobs/view/junior-data-engineer-at-iland-cloud-3385235136?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=X20KFK%2F1IQqFmvWKZw%2BUKw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Description Our growing organization is looking for a  Junior Data Engineer  to join our growing team of software engineers. Does working with Python, Apache Spark, Apache Cassandra, Apache Pulsar, CockroachDB and other current Big Data technologies sound exciting to you? iland’s Junior Data Engineer will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross-functional teams. The ideal candidate is someone excited about building data pipelines, wrangling data, and optimizing data systems. This person will support our software developers, database architects, and data analysts on data initiatives and will ensure optimal delivery and consistent architecture throughout ongoing projects. The right candidate will be excited by the prospect of optimizing and influencing the direction of our company’s data architecture aimed at supporting our next generation of products and data initiatives. Join our global team of software developers as a Junior Data Engineer and contribute to development of the industry-leading 11:11 Cloud Console (https://1111systems.com/why-1111/cloud-console ), among other exciting projects. This is only the beginning of what will surely be your most challenging and rewarding role to date. Work with the latest technologies and push the barriers, all while helping build dynamic software that will have a lasting effect on the industry. Responsibilities Take an idea from design concept to working implementation that will be deployed for both internal and external use Build elegant, clean, bulletproof code that is driven by tests Work with Software Engineering to ensure architectural and implementation coherence Debug issues and develop quick, robust solutions to keep systems running smoothly Participate in code reviews to ensure alignment with the architectural approach and to maintain a clean code base Requirements   Bachelor’s Degree in Computer Science, Information Systems, or equivalent Strong interpersonal and communication skills is essential Flexibility, energy, and ability to work well with others in a team environment Must have skills include: 1+ years of Python experience 1+ year(s) of Data Engineering experience Strong Understanding of SQL and NoSQL databases Git CI/CD Linux Nice to have skills include: Experience with Apache Spark or other DataFrame-like frameworks Experience with Apache Cassandra Open-source project contributions GitHub or public-facing source code Developer forum (Stack Overflow, etc.) participation Benefits Competitive Salary 401k Plan with Company Match PPO Healthcare Insurance Plan Dental Insurance Vision Insurance Life Insurance Paid Vacation & Holidays About 11:11 Systems 11:11 Systems was created to deliver a fully integrated and unified network experience, providing our customers with visibility, control, and decision making to simplify their requirements through one experience: simplified, synchronized, and optimized. 11:11 is invested in creating a new model empowering its customers and partners to “RETHINK CONNECTED”. Fully integrated, fully automated. All services, all activities, all data, all performance, powered on a single platform.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Software Engineer I (Intern) United States", "jobId": "3385790099", "companyName": "Cisco", "location": "Seattle, WA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-engineer-i-intern-united-states-at-cisco-3385790099?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=r7CqaqEAZYyTx2a0bWGU7Q%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "What You’ll Do Our software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. Who You’ll Work With Our hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. You would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. Who You Are  Including but not limited to an upcoming graduate of a technical degree or certification program from a Technical Boot Camp, Apprenticeship, Community College or 4-Year University.   Up-to-date on programming and scripting languages: C/C++, Python, Java   Knowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML   Hands on QA, Testing, and/or Debugging skills   Experience with Databases, Web Application Development, and Web Services   Able to legally live and work in the country for which you’re applying, without visa support or sponsorship  Why Cisco #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. We embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! But “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. So, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Internship", "jobFunction": "Information Technology and Engineering", "industry": "Computer Hardware Manufacturing, Software Development, and Computer Networking Products"},
{"programName": "Software Engineering Systems", "title": "IT Systems Assistant/Helpdesk", "jobId": "3383545195", "companyName": "Ledgent Technology", "location": "Golden Valley, AZ", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/it-systems-assistant-helpdesk-at-ledgent-technology-3383545195?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=P3cB%2FnlhG8mC%2B%2FGBOawSpQ%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Our client is seeking an experienced Help Desk/IT Support professional to join their team! This individual will be responsible for supporting end users and maintaining the company's IT systems including troubleshooting, installation, setup, and management of hardware, software, networking, and peripherals, as well as some basic user training. This is a contract-to-hire position which will begin onsite in Golden Valley during a 3-month training and onboarding period and move to hybrid with 3 days per week onsite. Responsibilities Provide onsite and remote help desk support for internal end users Deploy, set up, and maintain desktops, software, phones, printers, etc. Manage IT inventory, providing tracking and organization Provide documentation for technology and processes Manage Active Directory alongside other members of IT team Preferred Experience 2+ years in prior IT experience required Office 365 programs Infrastructure including Windows servers, virtual machines, and SQL Server Network hardware, protocols, and services Windows OS and iOS for mobile devices Cloud-based software Shell scripting or other scripting languages Cyber security Pursuit or completion of a Bachelor's in Information Technology or related field We are an equal opportunity employer and make hiring decisions based on merit. Recruitment, hiring, training, and job assignments are made without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, or any other protected classification. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance. To apply please email your resume to mpieper@ledgent.com\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Staffing and Recruiting"},
{"programName": "Software Engineering Systems", "title": "Software Engineering Intern", "jobId": "3370186715", "companyName": "Yahoo", "location": "United States", "datePosted": "2022-11-22", "link": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-yahoo-3370186715?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=O93LQrdno%2F%2Fj%2FDzoZAXWCQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? About Us: As a global email provider, Yahoo Mail is the ultimate Consumer Inbox with over 220 million users. It is the best way to access your email and stay organized from a computer, phone or tablet. We develop technology that changes the internet while handling billions of inbound connections per day to manage trillions of messages requiring petabytes of efficient storage. The Yahoo Mail engineering team provides opportunities to work on challenges that are as exciting as the Yahoo Mail product itself at the scale that only a handful of companies can match. We are looking for innovative, entrepreneurial, and passionate developers to help us build the future of communications experiences and delight our users. We are engineers who strive to deliver our users only the absolute best and are willing to meticulously refine the details to achieve this goal. We believe that engineering is only a piece of the effort and that you must be as passionate about the user’s experience as you are about code quality and architecture. Our goal is to make communication simple, enjoyable and more productive to help our users run the business of life. About the team: Do you relish the opportunity to work on one of the largest distributed storage systems in the world, running on thousands of machines and handling petabytes of data? Developing this infrastructure requires solving many technical challenges in the areas of distributed computing frameworks, data structures and algorithms. The team is responsible to architect these platforms, build scalable and modular systems, measure and optimize system performance, and ensure that systems run reliably in a 24/7 production environment. Specifically, we work on a complete Java stack that serves hundreds of billions of transactions daily and will work on the complete redesign of the Mail Backend Storage System to make our system secure, highly available and durable. We also work on Next Gen solutions to reduce the hardware cost and Innovative algorithms to keep the user data in sync across multiple copies. Sounds Exciting? Then, come join us!! Responsibilities:  You will work on features or proof of concepts that are critical to the team. Collaborate with other engineers to write testable, reliable code, continuously deploying to production systems Responsible for writing excellent code and following best practices in software engineering. Deploy, monitor and operate large-scale production systems distributed across the globe.  Automate the provisioning, scaling, and management of our infrastructure A Lot About YOU You are passionate about growing your skills and value high quality engineering that can help modernize systems in the Cloud. You are interested in how best to drive tasks to completion, collaborate to achieve your goals, think through scenarios and edge cases, learn from your leadership (mentors), and understand the broader impact of your work. If you are interested in joining a world-class team of passionate people and industry veterans who like to work hard and play hard, we look forward to hearing from you soon! Qualifications: Strong Object Oriented programming languages such as Java, C++, or similar Strong understanding of computer science fundamentals including Data Structures, Algorithms, OS and Networking Understanding and experience with UNIX Knowledge of Perl, Python, or Shell scripting languages Ability to work well with diverse groups of people, geographically dispersed across the world Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Systems Engineer", "jobId": "3380821988", "companyName": "Qrypt", "location": "Germantown, MD", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/systems-engineer-at-qrypt-3380821988?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=NOY9bwgu3N4g2rcEjgBXoA%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Qrypt builds quantum-secure encryption software and hardware in partnership with world-class national laboratories and academic institutions. We value protecting individual privacy and being transparent about the technology we use to enable it. The foundation of Qrypt technology is published by our experts in peer-reviewed scientific journals and supported by a growing portfolio of international patents. Qrypt’s product portfolio builds on these technologies to ensure enduring data security in the quantum age. Qrypt is looking for a  Systems Engineer  to join our growing team. The Systems Engineer will own the deployment, configuration, management, and monitoring of Qrypt's hardware infrastructure (servers, networking, power, and support). They will work with the Qrypt hardware and software team to translate product requirements into deployed infrastructure. This position is in Germantown, MD. Responsibilities Installing, configuring, testing, and maintaining operating systems, application software and system management tools Monitor deployed hardware and perform first-line triage and troubleshooting Develop a deep understanding of the system to be able to identify and resolve issues Identify hardware (server, networking, firewall, etc.) needs based on product team requirements (number of users, random generation, etc.) Develop and carry out processes to translate product requirements/system level requirements into actionable plans to identify, purchase, configure/assemble, and deploy required hardware Qualifications Bachelor’s degree in a technical field (Math, Physics, Engineering) and/or relevant work experience Expertise in the installation, upgrade, configuration, and performance tuning of Linux-based servers Understanding of networking concepts 4+ years of experience as a Systems Engineer, Site Reliability Engineer, Datacenter engineer, or equivalent Experience with configuration of L2 and L3 networking equipment Proficiency with bash and/or Python Strong written and verbal communication skills Ability to lift and carry up to 40 pounds Ability to install servers and networking equipment in a colo/datacenter environment Benefits & Perks Competitive Pay & Equity Paid Time Off Medical, dental & vision plan participation Strong 401K matching program Gym Reimbursement But above all, be part of an amazing team! Together, we’ll make this world a safer place About Qrypt Qrypt’s mission is to protect the world’s data. Ending encryption key transmission, the Qrypt Quantum Security suite hardens security and future-proofs encryption against quantum attacks. Qrypt’s unique technology independently generates one-time pads and symmetric keys at multiple endpoints, so that customers can eliminate key transmissions from critical workflows today. Qrypt's team of engineers, physicists, and cryptographers is committed to creating a new standard in security. Powered by JazzHR DfWjAxH9uw\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "Software Developer Intern", "jobId": "3385765787", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-developer-intern-at-yahoo-3385765787?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=zRLC56RJIdOPmGoRJhvJ5A%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us Under the office of the CTO, the Yahoo Platforms Engineering (YPE) group enables all of the Yahoo verticals to develop and deliver the best possible products to our customers globally with the highest standards. Yahoo’s Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Yahoo’s brands at scale. The Yahoo Edge Engineering Group writes the code that runs Yahoo’s internal content delivery network (CDN). We develop the open source Apache Traffic Server as well as internal solutions for content caching, edge security, traffic shaping and routing, load balancing and failover, and IPv6 translation. Our code makes delivering Yahoo properties fast and reliable. We offer a variety of internships to students who want jobs with real responsibility, outstanding training, and the chance to learn from the best through 1:1 mentorship in a small team setting. As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for a potential full-time position after graduation. During the course of your internship, you will take part in an exciting lineup of intern events and engage in important projects that significantly impact the success of our businesses. At the end of your summer, you will have the opportunity to present your work to our leadership and network with our hiring managers. Your Day Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed Develop project timelines, implement design specifications, system flow diagrams, documentation, testing, and ongoing support Recommend modifications to our processes and procedures Help us to identify a gold standard for current methodologies and implementations Make your voice heard by promoting your ideas within project teams Get involved in the intern outings, workshops, and trainings we have available Present your work to leadership and network with your fellow interns You Are An avid problem solver who has the capability to work independently as well as collaborate within a team Enrolled in a Bachelor's, Masters or Phd program in Computer Science or related major, and have a strong record of academic achievement Proficient in a language including one or many of the following: HTML, CSS, JavaScript, Node. JS, JS Framework (React and Ember) Java, C/C++, Grid, Hadoop, Perl, PHP, Python, Ruby, Lamp, Oracle, MySQL, Hive, etc. Passionate about large-scale, large-user base, website development Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Developer Intern", "jobId": "3385767756", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-developer-intern-at-yahoo-3385767756?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=g4%2FHTLsBwr0w3bIUZDi6ug%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us Under the office of the CTO, the Yahoo Platforms Engineering (YPE) group enables all of the Yahoo verticals to develop and deliver the best possible products to our customers globally with the highest standards. Yahoo’s Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Yahoo’s brands at scale. The Yahoo Edge Engineering Group writes the code that runs Yahoo’s internal content delivery network (CDN). We develop the open source Apache Traffic Server as well as internal solutions for content caching, edge security, traffic shaping and routing, load balancing and failover, and IPv6 translation. Our code makes delivering Yahoo properties fast and reliable. We offer a variety of internships to students who want jobs with real responsibility, outstanding training, and the chance to learn from the best through 1:1 mentorship in a small team setting. As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for a potential full-time position after graduation. During the course of your internship, you will take part in an exciting lineup of intern events and engage in important projects that significantly impact the success of our businesses. At the end of your summer, you will have the opportunity to present your work to our leadership and network with our hiring managers. Your Day Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed Develop project timelines, implement design specifications, system flow diagrams, documentation, testing, and ongoing support Recommend modifications to our processes and procedures Help us to identify a gold standard for current methodologies and implementations Make your voice heard by promoting your ideas within project teams Get involved in the intern outings, workshops, and trainings we have available Present your work to leadership and network with your fellow interns You Are An avid problem solver who has the capability to work independently as well as collaborate within a team Enrolled in a Bachelor's, Masters or Phd program in Computer Science or related major, and have a strong record of academic achievement Proficient in a language including one or many of the following: HTML, CSS, JavaScript, Node. JS, JS Framework (React and Ember) Java, C/C++, Grid, Hadoop, Perl, PHP, Python, Ruby, Lamp, Oracle, MySQL, Hive, etc. Passionate about large-scale, large-user base, website development Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Developer Intern", "jobId": "3385771156", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-developer-intern-at-yahoo-3385771156?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=ZYs8o%2FjzO1sYh7SmEE10Rw%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us Under the office of the CTO, the Yahoo Platforms Engineering (YPE) group enables all of the Yahoo verticals to develop and deliver the best possible products to our customers globally with the highest standards. Yahoo’s Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Yahoo’s brands at scale. The Yahoo Edge Engineering Group writes the code that runs Yahoo’s internal content delivery network (CDN). We develop the open source Apache Traffic Server as well as internal solutions for content caching, edge security, traffic shaping and routing, load balancing and failover, and IPv6 translation. Our code makes delivering Yahoo properties fast and reliable. We offer a variety of internships to students who want jobs with real responsibility, outstanding training, and the chance to learn from the best through 1:1 mentorship in a small team setting. As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for a potential full-time position after graduation. During the course of your internship, you will take part in an exciting lineup of intern events and engage in important projects that significantly impact the success of our businesses. At the end of your summer, you will have the opportunity to present your work to our leadership and network with our hiring managers. Your Day Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed Develop project timelines, implement design specifications, system flow diagrams, documentation, testing, and ongoing support Recommend modifications to our processes and procedures Help us to identify a gold standard for current methodologies and implementations Make your voice heard by promoting your ideas within project teams Get involved in the intern outings, workshops, and trainings we have available Present your work to leadership and network with your fellow interns You Are An avid problem solver who has the capability to work independently as well as collaborate within a team Enrolled in a Bachelor's, Masters or Phd program in Computer Science or related major, and have a strong record of academic achievement Proficient in a language including one or many of the following: HTML, CSS, JavaScript, Node. JS, JS Framework (React and Ember) Java, C/C++, Grid, Hadoop, Perl, PHP, Python, Ruby, Lamp, Oracle, MySQL, Hive, etc. Passionate about large-scale, large-user base, website development Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "SQL Database Developer", "jobId": "3374550268", "companyName": "Apex Systems", "location": "United States", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/sql-database-developer-at-apex-systems-3374550268?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=77rgYXau%2FBESPLoaUYCahw%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "12+ months  Location: Charlotte, NC  Pay Rate: $65-$70/hour on W2  W2 applicants only, unable to work C2C  Unable to provide visa sponsorship Top Requirements:  SQL Server Development  Data Warehousing Experience working on architecture or modules  Desired qualifications:  - Degree (or equivalent experience) in Computer Science or related Engineering field - 5+ years development experience in a complex application development (client and/or server) - 5+ years of experience in solution engineering - Strong SQL Development Experience (DDL, DML, SSIS) - Hands on experience in advanced db concepts. - Provides technical knowledge and capabilities as a team member and individual contributor - Experience with automated SDLC solutions (CI/CD) - Experience working on Autosys, for job scheduling \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Contract", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Systems Engineer remote position", "jobId": "3377845357", "companyName": "Indotronix Avani Group", "location": "Pittsburgh, PA", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/systems-engineer-remote-position-at-indotronix-avani-group-3377845357?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=c7MVulKt4AIYmK4ytISxMQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Position Title: Systems Engineer 3 Position Location: remote Ability to work remote: Yes Remote details and time zone(s): 8-5PM EST Intended length of Assignment: 6 months before FTE consideration; 6 month extension if needed but NO visa candidates Potential for Contract Extension: Yes If yes, details (intended length of extension): 6 months Required Skills Strong Windows Desktop troubleshooting skills Experience using Microsoft Endpoint Configuration Manager and vulnerability remediation; Windows 10 20h2 (preferred but ANY version of Windows 10 is fine/required), Proficient in supporting Microsoft Defender for Endpoints using Microsoft Intune and MECM. Proficient in supporting Symantec Endpoint Protection (SEP 14) management server and workstation clients. Installation, configuration, and day-to-day management of Symantec Endpoint Protection Troubleshooting and tuning the performance of Symantec Endpoint Protection in the enterprise environment. Microsoft excel for reporting Windows remote assist and Windows remote desktop Service Now for ticketing Degrees or certifications HS Diploma is ok (tech certs would help - Azure, intune, etc. any Microsoft certification is a plus) Bachelor's preferred (software engineering, computer science, and/or related field); tech certs for Azure, intune, etc. any MS certs is a plus 5+ of related work exp Interview Process 30 min initial phone interview virtual face to face interview via team\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Staffing and Recruiting"},
{"programName": "Software Engineering Systems", "title": "Software Intern", "jobId": "3385251626", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-intern-at-yahoo-3385251626?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=nKhDrReojeizFPfesVDXjQ%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Yahoo is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports, to shopping, gaming and news—with the trusted products, content and tech that fuel their day. For partners, we provide a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search and media. About Yahoo Yahoo is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports to shopping, gaming and news—with the trusted products, content, and tech that fuel their day. For partners, we provide a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search, and media. A Little About Us The Media Edge team provides technical expertise in Infrastructure, Proxy, and Cloud technologies to all Yahoo properties. At peak traffic time, our proxies service over 1 Million RPS (requests per second). We provide common features such as Experimentation (bucket testing), Resiliency (Abuse detection, Caching, Failsafe), Security (mTLS), GDPR compliance, and a Programmable Edge (to build flexible features), etc. within the company. A Lot About You We are looking for great talent - Software Developers that can contribute to the development of our exciting next-generation products. If you are excited about the overall lifecycle of a product - building, coding, testing, launching, and learning, this is the place to be, because you will learn and gain hands-on experience while engaged in projects with a significant impact on the success of Yahoo businesses. You are a great problem solver, have the capability to work independently as well as with a team, and have the willingness to learn from our leadership. You Must Have Actively pursuing a BS, MS, or Ph.D. in Computer Science or a related major, and a strong record of academic achievement. Programming proficiency in a language, preferably one of C/C++, Python, Go, Java, etc. Knowledge of software engineering processes, tools, methods, test development, support, algorithms, and data structures. Familiarity with object-oriented programming concepts, large-scale software architecture, networking, distributed systems, and Linux environments Experience in one or many of the following is a plus Knowledge of best practices related to L4/L7 Proxy such as Apache Traffic Server, Nginx, Envoy, etc. Security, performance, and disaster recovery Container deployment and Orchestration technologies Working with public cloud technologies such as AWS or GCP Cross-browser, Cross-platform coding Large-scale website development experience Internship experience at a tech company Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Engineering Intern", "jobId": "3385767747", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-yahoo-3385767747?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=MXhzQE6srfAQYIUZX%2BBEuw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? About Our Team Our Team develops and maintains the content serving and recommendation systems that power all our Yahoo brands such as Yahoo.com, Yahoo Sports, Yahoo Finance, AOL.com, TechCrunch, AutoBlog and Engadget on the web as well as the mobile experiences. We develop and maintain large scale web crawling systems, distributed storage solutions, highly flexible federation layer and a low latency search indexes. To do all this, we work with technologies such as Vespa (Vespa.ai), Redis, Cassandra, Storm, Kafka, Hadoop, Hive, Pig, Spark, and gRPC. We work closely with data and applied science teams to continuously improve the recommendations and content understanding to give the user what they seek and build the features that delight them. We work on a massive scale, ingest and transform 100s of terabytes of data, build various interesting algorithms and work closely with our data analytics team to measure our successes. Who we are Our engineering teams are focused on delivering the best product experiences across News, Sports and Finance and many others, across all devices from watches to TVs and everything in between and to users around the globe. Our team structure encourages trust, learning from one another, having fun, and attracting people who are passionate about what they do. What we are looking for We are looking for great talent, well rounded Software Developers that can contribute to the development of our exciting next-generation products. If you are excited about the overall lifecycle of a product - building, coding, testing, launching and learning, this is the place to be, because you will learn and gain hands-on experience while engaged in projects with significant impact on the success of all of Yahoo's products. You are a great problem solver, have the capability to work independently as well as with a team, and have the drive and willingness to learn new things. What a normal day looks like Design, develop, code and test software systems or applications for software enhancements and new products; revise and refine as required Participate in agile development of project timelines, implementation design specifications, system flow diagrams, documentation, testing and ongoing support of systems Recommend modifications to processes and procedures, and contribute to best practices, architecture, and implementations Promote and solicit ideas within project teams You Must Have Actively pursuing a BS, MS, or PhD in Computer Science or related major, and strong record of academic achievement Knowledge of software engineering processes, programming languages (preferably Java), programming tools like IDEs and source control, testing frameworks and algorithms and data structure Familiarity with object-oriented programming concepts, large-scale software architecture, networking and distributed systems, and UNIX/Linux environments Experience in one or many of the following is a plus: Backend system experience (Big Data, search engines) Scripting language Security Large-scale, large-user base website development experience Data mining, machine learning, AI, statistics, information retrieval, linguistic analysis Strong mathematical background Internship experience at a tech company Front-end language: HTML, CSS, JavaScript, Node.JS, JS Framework (React and Ember) Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "IT Systems Engineer", "jobId": "3385812387", "companyName": "VineBrook Homes LLC", "location": "Dayton, OH", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/it-systems-engineer-at-vinebrook-homes-llc-3385812387?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=LXIwDFsQJqBTcTWwBDeIXg%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Position Summary/Objective The IT Systems Engineer is responsible for supporting the corporate office, market offices, and field-based staff in day-to-day use of their technology equipment. Equipment supported includes desktop computers, laptops, desk phone, cellular phones, tablets, printers, and other technology equipment. The role provides technical expertise to the desktop environment with a goal of increasing performance, reliability, usability, efficiency, and functionality of the computing environment. Typical duties include administering multiple systems for access control, packaging software for deployment, building/deploying desktop hardware and related software images, and utilizing group policy in a cloud-based domain structure for account administration. The IT Systems Engineer will use their skills and passion for technology to diagnose the most effective method to resolve problems and implement solutions that keep end user technology functional. Responsibilities also include the documentation of activities via support tickets, technology asset inventory, IT processes, policies, and procedures as necessary. Essential Duties And Responsibilities  This position will work with other IT team members to resolve help desk tickets, troubleshoot networking issues, support end user desktop and peripheral devices including phones, printers, tablets and smart phones  Additional duties include supporting the company servers, administering users within business applications, and maintaining run documentation for procedure manuals Minimum Qualifications  Bachelor's Degree in a related field or related professional experience; A+ and/or MCTS Certification  3-5 years of progressive experience in Information Technology Department with an emphasis on desktop support  Minimum 3 years customer service experience working with end users to troubleshoot and resolve end user technical problems  Technical knowledge and experience in Office 365, Windows 10, Active Directory, Group Policy, Application Repackaging, Apple IOS, PC Hardware Installation and Diagnosis, LAN I WAN Concepts (TCP IP, DHCP, DNS)  Build sustainable relationships of trust through open and interactive communication  Understanding of enterprise class networking equipment and concepts helpful  Ability to carry out assignments with minimum direction where objectives are broadly defined  Valid Driver's License is a requirement Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  S upervisory Responsibility  None  T ravel  This position may require travel to market offices as necessary to deploy technology equipment . Other Duties Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice. We recognize that people come with a wealth of experience and talent beyond just the technical requirements of the job. If your experience is close to what you see listed here, please still consider applying. Diversity of experience and skills combined with passion is a key to innovation and excellence; therefore, we encourage people from all backgrounds to apply to our positions. Please let us know if you require accommodations during the interview process. We are an equal opportunity employer. Qualified applicants shall be considered for all positions without regard to race, color, sex, religion, national origin, age, disability, veteran status, or any other status protected by federal, state or local law. We are also a Drug Free Work Place. Qualified applicants will also be required to pass a drug screening before receiving an offer or beginning employment. Refusal to submit to testing will result in disqualification of further employment consideration.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Analyst", "industry": "Software Development"},
{"programName": "Software Engineering Systems", "title": "Software Engineer Intern", "jobId": "3385766805", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-yahoo-3385766805?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=kMrAX0C3ESo%2FkZPoCvpwqg%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us: Yahoo is a values-led company committed to building brands people love. We reach over one billion people worldwide with a dynamic house of 50+ media and technology brands. As a global leader in digital and mobile, Yahoo is shaping the future of media. Our mission: build brands consumers love, build platforms customers love, and build a company talent loves. The user understanding team plays a critical part in the Media Personalization that powers all the critical components of our Media Business. As part of this team, we work on various features that directly impact properties like Yahoo Sports, Yahoo Finance, Yahoo News, and Yahoo Homepage. We are directly responsible for billions of impressions and millions of clicks for our content. A Lot About You: You are someone who is motivated by our mission and wants to ensure that our media platform plays a critical role in improving the experience of our users. You are passionate about solving technical problems, from the network to the user experience. You want to make web applications and middleware systems faster, more reliable, and more efficient; think outside the box to build tools and systems that allow faster and easier to create experiences and launch, with low latency and high-performing runtime. Responsibilities: Engineering ownership in a complex backend system, including new feature work, improvements on existing code, debugging and investigation of user issues, participation in code reviews, and designing and shipping the product. Contribute to standard methodologies and the culture of the team. Collaborate with Product Managers to ideate technical solutions. Qualifications : Pursuing BS/MS in Computer Science (or equivalent) Experience with Java and related technologies like Spring, Junit, JAX-RS/Jersey, GRPC, Apache Storm, NoSql DB, Redis, etc. Experience with object-oriented programming concepts, event-driven programming, large-scale software architecture, networking,  distributed systems, and UNIX/Linux environments Experience with Web technologies like REST APIs, JSON, NodeJS, etc Bonus / Nice to Have: Exposure to AI/ML Experience with large data processing and storage solutions like Storm, Spark, Hadoop Map/Reduce, Pig, Oozie, DynamoDB, and Cassandra. Experience working with search and real-time retrieval solutions like Vespa.ai, Elasticsearch, Apache Solr Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Systems Engineering - Junior", "jobId": "3384266845", "companyName": "VectorCSP", "location": "Elizabeth City, NC", "datePosted": "2022-11-10", "link": "https://www.linkedin.com/jobs/view/systems-engineering-junior-at-vectorcsp-3384266845?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=F5L1TFX%2FtIqu7z7KFgc%2FUA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "VectorCSP is looking for an experienced Systems Engineering - Junior (ALC-ISD) to work in the Elizabeth City, NC area.Job Summary:Performs in all phases of systems development and implementation, with special emphasis on study and analysis, and testing and acceptance phases.Requirements: CompTIA Sec+ CertificationEducation and Experience:Bachelor's Degree or equivalent in Electrical Engineering, Mechanical Engineering, Computer Science, Management Information Systems, Systems Engineering or Electrical Engineering TechnologyTwo (2) years of experience in current operating systems.Essential Duties:Perform evaluation of current IT operations in order to determine multi-year projections for personnel, hardware, and software.Participate in hardware/software evaluations.Supports systems analysts, as well as Government personnel to ensure that the problem has been properly identified and that the solution shall satisfy the customer's requirements.Provide technical expertise and guidance in IT specialties not covered by other specialists.Perform analysis in a specialized IT area(s), e.g. telecommunications, operating systems software, software/hardware integration, software validation, and verification preferred.Capable of defining all required database administration policies, procedures, standards, guidelines, and OPKnowledge, Skills and Abilities:Experience working in/around militaryExperience with software analysis/development for government customersDemonstrated ability to work with large and diverse teams and the ability to effectively provide support as neededAbility to write technicallyAbility to work within a team and solve problems collectivelyAbility to communicate at all levels of the command chainTo apply, please go tohttps://vectorcsp.applicantpro.com/. For assistance please contact our Human Resources Department by telephone at (252) 338-4255 or by email, human.resources@vectorcsp.com.Vector CSP, LLC is an equal opportunity employer and does not discriminate against any employee or applicant for employment because of race, color, religion, national origin, age, disability, or any other reasons prohibited under Federal, State or local laws. EOE AA/M/F/D/V.For more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.https://www.applicantpro.com/j/2637380-340673\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing"},
{"programName": "Software Engineering Systems", "title": "Vice President, System Operations and Infrastructure", "jobId": "3379639408", "companyName": "Raintree Systems", "location": "United States", "datePosted": "2022-11-29", "link": "https://www.linkedin.com/jobs/view/vice-president-system-operations-and-infrastructure-at-raintree-systems-3379639408?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=ReTtFuP1oBaH%2BtogdEbfiw%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "As VP of Systems Operations & Infrastructure for Raintree Systems, you will lead all aspects of System Operations, Infrastructure, Enterprise Technology (aka IT), and Security for all customer-facing and internal applications. This position is responsible for driving improvements, innovation, automation and efficiencies for Cloud Platforms, SaaS, SSO, SecOps, ISO27001 Compliance, Service Level, and Performance Management. You will partner with company leadership to ensure appropriate people, talent, strategy, and processes are in place to support the company's strategic and operational initiatives. This position will also act as Raintree’s Chief Information Security Officer (CISO) ensuring comprehensive electronic health care PHI-related security and compliance. As the company’s CISO you will be responsible for the planning, development, and execution of Raintree’s enterprise information security strategy and best practices approach in support of Raintree’s information security architecture. In this role, you will work collaboratively across the organization to identify, develop, implement, and maintain processes and best practices across the organization to reduce information and information technology risks and will report timely and regularly to Executive management. This position is remote from one of the designated states below. Responsibilities Lead the Infrastructure, System Operations, Security and Desktop Support teams for all products and systems in the company. Establish technology and security vision and goals. Build/enhance effective systems and platforms that meet stakeholder requirements Act as Chief Information Security Officer (CISO) to keep our platforms secure from internal and external threats  Manage the budgets, including build, buy, or partner decisions and manage our cloud and capital costs to industry standards. Analyze the costs, value, and risks of technology to advise executive leaders and drive investments Establish service level agreements (SLAs) that meet business needs, and monitor performance to ensure adherence to commitments Implement technology and optimizations to streamline operations and security. Monitor changes or advancements in technology to discover ways to gain a competitive advantage  Partner effectively with all levels of the organization to identify, prioritize, and drive strategic initiatives that impact the organization. Communicate strategy, objectives, and performance results to the executive team and cross-functional partners Abilities & Knowledge Cloud - AWS ISO27001 Security Governance & Compliance Broad knowledge of IT disciplines, most important system administration, information security, and DevOps Strong leadership presence Track record building, leading and mentoring high-performing technical teams Significant experience working and leading cross-functionally in high growth organizations Outstanding written and verbal communication skills; proven ability to communicate effectively at C-level and Board of Directors Knowledge of Microsoft and Google product suites Education and Experience Bachelor's degree in a related field Minimum 10 years of work experience in the technology industry required 7+ years technology leadership experience in high-tech companies, preferably with SaaS business models Must reside in one of the following states: AZ, CA, CO, CT, FL, GA, ID, IL, IN, KS, MA, MI, MO, MS, NC, NJ, NV, OR, PA, SC, TN, TX, UT, VA, WA Raintree Systems provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Powered by JazzHR ZJ5ajvX5ce\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Director", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "Information Technology Engineer", "jobId": "3385840807", "companyName": "Outsource IT Solutions", "location": "Naperville, IL", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/information-technology-engineer-at-outsource-it-solutions-3385840807?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=fpcxsjMPfyNr87DLwa815w%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "We are looking for a dedicated and dynamic individual to join our team! Responsibilities We require an IT problem solver with strong communication skills to design, install, document, and support our customer’s networks, servers, and desktop hardware and software. The position requires travel by car throughout Chicago and surrounding suburbs as well as the ability to manage multiple projects/problems efficiently. A strong background in troubleshooting and problem resolution is also required. Experience with Connectwise Automate or Connectwise Manage is highly desirable. Experience 2+ years of experience, network design, build and troubleshooting with firewalls, routers, servers and Microsoft Networks. The ideal candidate will have experience and certifications on Windows 10/11, Windows Server 2016/2019, Virtualization (Both VMware and Hyper-V), VDI Technology, Microsoft Exchange/Office 365, Azure, HP ProLiant Servers, Cisco and Fortinet Switches, Routers, Firewalls and Meraki Wireless. Salary range is flexible based on current certifications and experience. We offer competitive benefits including company-paid medical/dental insurance coverage, company matching SIMPLE IRA, & PTO. We also offer an excellent work environment with potential for personal growth as part of a dynamic and successful organization. Please visit our web site www.osgusa.com Outsource IT Solutions Group, Inc. is one of the fastest-growing MSPs in the Chicagoland area. With a team of brilliant-minded employees and an amazing clientele to match, we want this to be the last place you ever work! We have been in business since 1998, where we entered the market at the leading edge of modern networking and complex computer systems - and we've been there ever since. We take the utmost care of our employees, and make sure that all of their needs are met. Our Mission Outsource IT Solutions Group, Inc. mission is to design high quality, cost effective, technology solutions that provide the greatest return on investment for our growing customer base. Our Vision Outsource IT Solutions Group’s vision is to achieve predictable profitable growth through superior customer service, quality of work, and commitment to excellence. Our Values We will execute our missions and realize our vision by: Hiring the candidates who demonstrate the highest potential to achieve our goals. Retain only exceptional employees who repeatedly exemplify our values, execute our missions and move us toward our vision. Take care of our employees first, our customers, our vendors, and other partners in this order. Accept only the highest level of competency and execution in our team in creating the solutions and solving the problems of our customers. Empathize such that we make the pains and problems of our customers our own so me may move to the solution together equally. Treat others, both externally and internally, the way that we would want and expect to be treated.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Software Dev Engineering Intern", "jobId": "3385766806", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-dev-engineering-intern-at-yahoo-3385766806?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=jT%2BGbIwjf2s19nbxVFyxhw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? The Location Platforms team is responsible for all services related to the processing and serving of location centric entities, predicting and processing user location, and the contextual intersection of these two spaces ­including: geo­political relationship mapping, forward and reverse geo­coding and routing, point­-of-­interest catalog and search, movement data contextual enrichment, etc. These services are embedded across the footprint of the Yahoo Media network in applications like Web Search, Ads Targeting, Content Personalization, Mail Inbox Commerce, etc, while also producing aggregate data for campaign insights and business intelligence. In support of these goals, the Location team builds highly scalable back­-office and front­-stage systems backed by both statistical and machine­-learned models that have access to large scale data from user activities and interactions. This requires Software Engineers skilled in the disciplines of big­-data manipulation using distributed computing technologies, data mining, statistical analysis, machine-­learned modelling, and the domain knowledge to support these models with appropriate feature engineering activities. Responsibilities : Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed. Data mine and aggregate captured user activities. Construct ad hoc studies, data visualizations, and analytic tools.  Implement workflows to enrich user activities based on Spatio-temporal behaviors. Identify and execute feature extraction and engineering opportunities related to supervised and unsupervised models.  Work side­-by-­side with other engineers to train, evaluate and launch machine-learned ranking and classification models ­deployed in back-end workflows. Adhere to coding and documentation standards, conduct code reviews, and be a fully participating member of the engineering team and its practices.  Present your work to leadership and network with your fellow interns Qualifications : Enrolled in M.S. or qualified program focused in the disciplines of Computer Science.  Solid programming skills in Java or Python.  Experience in handling large scale data processing in the Hadoop ecosystem (e.g. HDFS, MapReduce, Pig, Oozie, HBase, Hive, Spark, etc) is a plus. Strong oral and written communication skills. Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Systems Developer", "jobId": "3385236440", "companyName": "Ralco", "location": "Marshall, MN", "datePosted": "2022-11-08", "link": "https://www.linkedin.com/jobs/view/systems-developer-at-ralco-3385236440?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=ai51UdNhC3JTPQSKZvxSew%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Company Overview Ralco is a science and technology company that provides the agriculture and aquaculture industries with natural technologies that help create safe and abundant food. It is our mission to perfect technologies that naturally create an abundant global food supply. We carry out our mission through applied science and research that enhance practical natural technologies for the agriculture and aquaculture industries. In a world filled with technology that people mistrust, creative thinking has driven Ralco to provide trusted alternatives. Our technologies come to life through products in our Ralco brands: Ralco Nutrition, Strong Animals®, Agnition®, trū® Shrimp and Ralco Show.  OUR MISSION:  Steward our God-given gifts to perfect technologies that enhance the vitality of plants and animals for a safe and abundant food supply.  OUR VALUES:  We do what is right We serve others and help them succeed We believe in hard work and a commitment to family We treat others with dignity and respect JOB SUMMARY: As Systems Developer, you are charged with utilizing technology to solve complex business problems that will increase sales, improve our customers experience, increase efficiencies, and help differentiate us from our competitors. You must possess a blend of business and technical savvy; a big-picture vision, and the drive to make that vision a reality. You must be a seasoned developer who understands technology broadly, loves to learn new technologies and enjoys new technical challenges. You must be able to communicate well with the broader IT team and provide technical leadership as you help us translate business strategy into systems to support that strategy. KEY WORK DUTIES AND REQUIRED SKILLS: Design and development of new systems as well as maintenance and enhancement of existing systems.  Implementation, testing, debugging and deployment of software systems. Work with business analyst, external technical resources and end-users as required for design and implementation of new systems and trouble-shooting problems with existing systems. Serving as team lead on projects and. Ensure productivity of end-users through their use of software and computer systems and related support. Ensure our systems are reliable and secure to meet our growing business needs.  Measuring and tracking performance of systems and preparing reports to keep management informed of needs and risks. Mentoring and supporting more junior members of the systems development staff. Proactively learn and utilize new technologies, concepts and procedures as appropriate to ensure we are staying current with technology advancements. Other duties as assigned. JOB REQUIREMENTS:  Education:   Undergraduate degree in computer science, management information systems or related field required.  Experience:  5+ years development experience preferred, including .NET using C# and web services.  Physical:   The following activities are required as needed to perform the job function: lifting, driving, bending, climbing, carrying and twisting. Confined space entry is not a required job function. Reasonable accommodations may be made to enable individuals with disabilities to perform the key work duties.  Travel:   This position requires minimal travel to customer and non-customer sites.  Location:   This position will be based in the Ralco Headquarters in Marshall, MN. Benefits Competitive pay based on previous experience. All existing benefits available to full time Ralco employees as outlined in the handbook: Health Insurance Life Insurance Ralco 401 K Plan Paid Holidays Paid Vacation/Sick Days Powered by JazzHR K3e5nyuNIc\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "SQL Developer", "jobId": "3385816367", "companyName": "Sideshow", "location": "Thousand Oaks, CA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/sql-developer-at-sideshow-3385816367?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=oHYNWgjDeazPpLUL%2BmG02A%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Sideshow is the premier maker and distributor of Pop Culture collectibles and lifestyle products. Our IT team is looking for an experienced SQL Programmer to help manage, maintain, and improve our digital systems with an emphasis on our ERP system. In this role, you will develop new programs and processes as well as maintain existing programs and code. Ad-hoc reports and queries will be frequent. You'll be part a small team that has a direct and immediate impact on efficiency and workflow. Sideshow's environment is fast paced, creative, and friendly. Required Skills MS SQL – writing complex queries, triggers, stored procedures MS SQL: SSIS & SSRS Understanding of MS SQL Server administration and configuration Creating and restoring databases in SQL Server VB & VBS Experience with ERP systems Responsibilities Create and modify triggers, stored procedures, queries, views, and tables Create programs and scripts to gain efficiencies for staff Write ad-hoc queries and reports Improve, troubleshoot, and maintain existing code Build reports in SSRS, Power BI, and similar programs Additional related duties may be assigned Additional Details Be a part of a positive and supportive work environment that promotes creativity and pride, with a balance of healthy and fun activities On-site cafe serving free healthy lunch options for all staff Applicants will undergo a 10-year background, credit and security check References Required Job Type:  Hybrid Hours:  Day Shift, Monday - Friday Pop culture is our culture In 1994, Sideshow embarked on a mission of connecting people with their favorite characters and icons from the worlds of film, television, comic books and popular culture. Today, we are a specialty manufacturer and distributor of the most highly sought-after licensed and original collectible products, sustained by a passionate worldwide community that is committed to the lifestyle of collecting figural art. Our development team consists of expert artists, sculptors, model makers, painters and costumers whose combined efforts result in the creation of outstanding original designs and intricately detailed likenesses of popular characters from highly recognized brands such as Star Wars, Marvel, DC Comics, Alien & Predator, Terminator, The Lord of the Rings, G.I. Joe and many more.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Entertainment Providers"},
{"programName": "Software Engineering Systems", "title": "IT Systems Administrator", "jobId": "3380735624", "companyName": "Corrigan Oil", "location": "Brighton, MI", "datePosted": "2022-11-29", "link": "https://www.linkedin.com/jobs/view/it-systems-administrator-at-corrigan-oil-3380735624?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=2moTlXSbPIqzO1Y2tudb6A%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Corrigan Oil - Who We Are:  Corrigan Oil is an equal employment opportunity employer with a dedication to customer satisfaction and quality that is second to none. Corrigan Oil is a family-owned business offering long-term career opportunities and a culture where you will be treated with respect and proud to work within. Corrigan Oil has expanded into a family of companies including:  Corrigan Oil, Construction, 24-hour Towing, Lubricants, Transportation, Propane, Mechanical Contractors, Environmental Solutions, Technical Environmental Services and Blue Water Industrial Products. Corrigan Oil understands the importance of preserving our environment and giving back to the communities. At Corrigan, we are proud supporters of our communities and encourage our employees to be active leaders, mentors, and volunteers.  Why Join the Corrigan Team:  Corrigan is a large company that operates with a small feel. Our culture is best described as hard working and ambitious. We are constantly looking for opportunities to say “yes we can” with a goal of total customer satisfaction while providing our products and services safely. Corrigan is a fast moving, quickly growing company that empowers our employees to be the best they can be with room for advancement throughout all branches of the organization.  Benefits:  Corrigan Oil offers a comprehensive benefits package to help you stay well, protect yourself and your family, and plan for a secure future. Benefits include: Medical, Dental & Vision Insurance. Life Insurance. Short-Term Disability coverage Vacation & Personal Time 401(k) – Company matches 50% up to 5% employee income  Job Overview:  The primary function of the IT Systems Administrator is to administer the installation, configuration and maintenance of physical\\virtual infrastructure equipment and software. This includes Network Routers/Switches, WAN Links, Firewalls, Mail Filters: Application/File Servers; Mail/Messaging Servers; and Cloud Services. This position will work with a high level of independence requiring excellent prioritization skills, as well as the ability to efficiently evaluate and escalate support calls when necessary. This position will assist the IT Manager in regular functions and on special projects as requested. Duties vary and are assigned based on knowledge and skills.  Essential Job Functions:  Administration and support computer IT environments, which includes but is not limited, to implementing system configuration, determining hardware, software and system functional specifications, and performing system installation. Administer the installation, operation, maintenance, and upgrades of hardware and software systems required. This includes the WAN (Wide Area Networks), LAN (Local Area Networks), VMware, Linux/Unix, MS Windows Servers, and data storage/SAN (Storage Area Network) and NAS (Network Attached Storage) environments. Configures and maintains physical / virtual servers, internal / cloud applications, end user computers, security, disaster recovery solutions, and network design and implementation. Implementation and management of system back-up, restoration and controlling protocols/procedures. Make recommendations regarding systems or procedural improvements, including recommendations regarding existing and/or new equipment, networking technology (such as network hardware, switches, routers, firewalls), security appliances, or software / cloud solutions. Establishes and administers the monitoring, measuring, and evaluating of hardware, software and network capacity performance reporting results to external clients. Manages user accounts, permissions, email, anti-virus, anti-spam and installs security programs to prevent unauthorized access to privileged data and information. Provide regular structured IT support and maintenance relating to issues with infrastructure leveraging the client Services’ standards and procedures. Performs intermediate level troubleshooting analysis of servers, workstations, and associated systems. Troubleshoots malfunctions of network hardware and software applications, to resolve operational issues and documents network problems and resolutions. Actively contribute to development of applicable IT standards and procedures. Manages and aids in project plan development and execution for server and network infrastructure upgrades. Installation, configuration, and support for PCs and PC related peripherals, network routers/switches, and printers. Escalate service or project issues that cannot be completed within agreed service levels. Travel to various company locations as required. Complete on-call responsibilities as required. Assist in the development of strong client relationships through constant dedication to client service and encouraging open lines of communication. Review IT publications and online materials to remain up to date with current and future technologies emerging in the industry.  Qualifications / Experience / Education:   Bachelor’s Degree in Computer Science or Information Systems (or related degree/equivalent combination of work experience) is required. 2-4 years of administrative support experience with an emphasis on Windows Server 2016/2012/2008 computing environments (Windows File Servers and PCs) supporting an organization of 50+ users. MCSE certification a plus. Experience with Unix/Linux, UNIX certification(s) desirable. Intermediate knowledge and experience in the area LAN and WAN inclusive of DNS, DHCP, IP addressing, etc. Entry to intermediate level knowledge of hardware imaging applications and deployment tools. (MS WDS, MS MDT, Acronis) Multiple Professional IT Certifications, such as: Microsoft MCP, MCSA, or MCSE; WatchGuard; Cisco CCNA; CompTIA; or VMware VCP. Interpersonal skills: Professional verbal and written communication skills, active listening, and client-care. Ability to effectively communicate to a diverse group of directors, managers, vendors, clients, and personnel at all levels. Technical awareness: ability to match resources to technical issues appropriately. Professional in appearance and approach; exudes expertise and credibility. Sound tactical thinker: ability to identify opportunities; initiator of improvements. Robust problem solving, analytical and listening skills. Ability to excel in a fast-paced, dynamic organization. Superior time management skills and demonstrated ability to multi-task on various work activities. Proficient knowledge of Microsoft Office to include Word, Excel, Visio and Power Point. Good verbal, written, presentation and problem-solving skills. Demonstrates the ability to work as part of a team and has a clear understanding of how assigned responsibilities impact other processes and the work of other people. Possess a “positive can-do” attitude. Highly self-motivated to work independently, within delegated authority, with minimal supervision. May sit at desk for long periods of time; frequently answer telephone and write or use a keyboard to communicate through written means. Some lifting to 50 lbs. may be required. Network Engineer: 2 years (Preferred). System Administration: 2 years (Preferred). Able to pass 7-year background check. #INDAOJ Powered by JazzHR lBL2j8ei0O\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "Computer System Analyst", "jobId": "3385259346", "companyName": "Linchpin Solutions, Inc.", "location": "Goose Creek, SC", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/computer-system-analyst-at-linchpin-solutions-inc-3385259346?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=sj2Dg%2FwDgUCc7XlITK32uA%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Goose Creek, SC (http://maps.google.com/maps?q=2316+Red+Bank+Rd+Goose+Creek+SC+29445) Job Type Full-time Description If you are looking for an exciting career opportunity in the IT, engineering, software development, logistics, and project management fields, we are currently hiring for a dynamic and experienced Computer Systems Analyst. The Computer System Analyst II qualified candidate should have a working knowledge of Linux and Windows servers in a VMware virtualized architecture, managing port, protocol, and network configuration information for Linux, Windows, VM servers and hosted applications, implementation of RMF, IAVs and STIG mitigations to satisfy cybersecurity requirements. Assists in the support for access privileges associated with maintenance and management of complexities associated with Information Technology infrastructures, system administration, technical support, and problem resolution for a production DoD enterprise network as well as development of future enterprise networks to include hardware and software solutions Manages system uptime and availability for Linux and Windows servers in a VMware virtualized architecture Configures, manages, and troubleshoots issues with Windows, RHEL, and SUSE servers Applies operating system and software patches and upgrades for Linux, Microsoft, VM servers, and workstations.  Requirements Requirements: Three (3) years of \"Task-Specific Project\" Computerized System experience, including Test and Evaluation, Network Protocols, LAN administration fundamentals, and UNIX and Windows-based operating systems. Must have strong written and oral communication skills to clearly communicate with all levels of employees, management, and Government customers Must have strong analytical and troubleshooting skills Secret Clearance Education Requirements High School diploma or GED. Completed the following certifications within one and a half years after assuming duties: Professional Software Engineering Master (PSEM)/ Certified Software Development Professional (CSDP) or with COR approval complete a vendor/platform specific certification (e.g., Microsoft Certified Solutions Developer (MCSD), Microsoft Certified Applications Developer (MCAD), Microsoft Certified Database Administrator (MCDBA), Sun Certified Professional (SCP), Red Hat Certification Program (RHCP), CISCO Certified Network Professional (CCNP), CISCO Certified Design Professional (CCDP), Oracle Certified Professional (OCP), etc.). \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Help Desk Manager", "jobId": "3374547885", "companyName": "Recycle Track Systems", "location": "New York City Metropolitan Area", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/help-desk-manager-at-recycle-track-systems-3374547885?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=iU46Kkn%2BnKrYqwvTaJ1K7Q%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "HELP DESK MANAGER – NYC/HQ   Recycle Track Systems - Equal Opportunity Employer: B Corporation  Recycle Track Systems is a leading provider of comprehensive environmental and waste management solutions services in North America. We invest in our client’s success by providing state-of-the-art technology, processes, and the best leadership in the industry. We are educators and leaders, with a passion for helping businesses become more sustainable and using our proprietary technology to make our service exceptional. We provide waste management, recycling, sustainability solutions for across businesses verticals Recycle Track Systems (RTS) has ushered in a new era for waste and recycling solutions, through the use of data analytics and technology service offerings. RTS proprietary tracking system empowers both customers and waste haulers by providing real time data and analytics increasing efficiency and surfacing greater insight into waste and recycling service pickups. Headquartered in New York City, Recycle Track Systems team of sustainability analysts, waste experts, and technologists remove inefficiencies in the waste management and recycling chain, creating an enhanced experience for customers and haulers.    About the Role Recycle Track system is looking for an experienced hands-on help desk manager to oversee our desktop support team in providing exemplary technical support to our end-users. The manager will manage an outsourced vendor and two help desk support engineers in different locations. This is a full-time onsite role based in our New York city headquarters location. Candidates are expected to be in the office during regular business hours. To be successful as a help desk manager, you should have excellent customer service and conflict management skills. Ultimately, a top-notch help desk manager should be able to ensure that our users receive professional and efficient technical support. The ideal candidate has strong communication skills, attention to detail, and the ability to prioritize tasks with a problem-solving attitude.  What You’ll Do To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Other minor duties may be assigned. Managing outsourced partners and SLAs. Maintain and upgrade network operations, help desk, and monitoring systems. Provides clients with technical services for laptops, workstations, peripherals, remote computing, applications, communications, Office 365, and internet solutions. Knowledge of cloud technologies like Azure, and AWS is preferable. Managing and supporting a team of helpdesk support engineers. Properly identify changes, make recommendations and implement technical solutions. Mentor team members, providing training and conducting performance evaluations. Monitoring team and vendor performance and developing feedback reports for management. Conduct monthly stakeholder meetings to review SLA and obtain feedback. Communicating with users and providing in-person and phone support, if required. Troubleshooting and resolving technical issues. Managing escalations and ensuring any issues are resolved promptly. Making recommendations to improve operational efficiency. Procurement of IT hardware and software, including renewals Define Cyber Security Policy, Practices and Procedures, implement application- CASB, MFA tools, security apps and monitoring of threats. Investigate security reaches and other cyber security incidents. Implement IT ad-hoc projects and improvement initiatives Management of IT assets including mobile devices, VOIP infrastructure for the organization Provide required access to managed service vendor for technologies such as Citrix, VPN, Cisco/Meraki firewall & switch, Cisco Meraki MDM or Virtual Desktop Troubleshooting system and network problems and diagnosing and solving hardware and software faults, replacing parts as required. Be Available to provide after-hours support to all urgent and emergency requests. What We’re Looking For Bachelor's degree in computer science, information technology, or a related field. Ability to work well independently as well as take ownership of assigned tasks to completion At least two years of experience as a Help Desk Manager with 5 years in technical support role. Understanding and hands-on experience with Cloud computing, virtualization technologies and Office 365 Good project management, organizational and time management skills to handle multiple projects simultaneously. Excellent customer service and communication skills (verbal and written) to effectively engage with clients. ERP experience, preferably with Microsoft Dynamics applications Strong technical background. Excellent analytical and troubleshooting skills. Ability to work under pressure. Excellent leadership and people management skills. Strong customer service skills. A self-starter with the ability to work independently under minimal supervision. Benefits RTS provides a competitive total compensation package including Medical, Dental, Vision, Life Insurance, 401(k) savings, and Short-Term Disability. Our employees also receive paid vacation, holidays, and volunteer days. Please note that benefits may vary and are subject to change. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Environmental Services"},
{"programName": "Software Engineering Systems", "title": "IT Specialist", "jobId": "3385800316", "companyName": "University of Utah", "location": "Salt Lake City, UT", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/it-specialist-at-university-of-utah-3385800316?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=N%2BY9gE2TChOC726XTpxuIw%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Details Open Date  11/30/2022 Requisition Number  PRN33110B Job Title  IT Specialist Working Title  IT Specialist Job Grade  E FLSA Code  Computer Employee Patient Sensitive Job Code?  No Standard Hours per Week  40 Full Time or Part Time?  Full Time Shift  Day Work Schedule Summary VP Area  President Department  00810 - Scient Comp & Imag Instit-Oper Location  Campus City  Salt Lake City, UT Type of Recruitment  External Posting Pay Rate Range  39,300 to 72700 Close Date Open Until Filled  Yes Job Summary Skills and Competencies:  Bachelor’s Degree in Computer Science or Information Technology or Engineering or related field or applicable professional certification and at least three years relevant technical and analytical experience.  Experience in systems administration and support task.  Experience in software systems, including databases, system software, and networking.  Knowledge of coding at system level (e.g., bash, Python, C/C++).  Knowledge of cloud technologies.  Knowledge in continuous integration/delivery/configuration management.  Proactive approach to IT, rather than reactive.  Low to medium supervision needed, takes the initiative in monitoring and troubleshooting issues that arise.  Communication and presentation skills to engage technical and non-technical audiences. Personal Attributes Desired For The Position  Strong interpersonal abilities.  Strong teamwork skills.  Highly motivated to support research projects. The Applicant Will Responsibilities  provide support to different aspects of systems and systems software, including but not limited to implementation, deployment, maintenance, monitoring, performance analysis, and security.  work under the director, collaborate with other team members, and be exposed to multiple platforms and IT disciplines, including distributed systems. This position will provide support in building solutions to automate IT processes, including design, development, test, and deploying custom workflows and scripts within cloud infrastructure that can be used for integration, deployment, monitoring, and other IT tasks. The applicant will routinely interact with people of diverse backgrounds, so excellent interpersonal and communication skills are necessary. Disclaimer This job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job. Work Environment And Level Of Frequency Typically Required Nearly Continuously: Office environment. Physical Requirements and Level of Frequency that may be required Nearly Continuously: Sitting, hearing, listening, talking. Often: Repetitive hand motion (such as typing), walking. Seldom: Bending, reaching overhead Minimum Qualifications Requires a bachelor’s degree or equivalency and 0-2 years of experience in the field or in a related area. Has knowledge of commonly-used concepts, practices, and procedures within areas of specialty. Preferences Type  Benefited Staff Additional Information Special Instructions Summary The University of Utah values candidates who have experience working in settings with students from diverse backgrounds and possess a strong commitment to improving access to higher education for historically underrepresented students. Individuals from historically underrepresented groups, such as minorities, women, qualified persons with disabilities and protected veterans are encouraged to apply. Veterans’ preference is extended to qualified applicants, upon request and consistent with University policy and Utah state law. Upon request, reasonable accommodations in the application process will be provided to individuals with disabilities. The University of Utah is an Affirmative Action/Equal Opportunity employer and does not discriminate based upon race, ethnicity, color, religion, national origin, age, disability, sex, sexual orientation, gender, gender identity, gender expression, pregnancy, pregnancy-related conditions, genetic information, or protected veteran’s status. The University does not discriminate on the basis of sex in the education program or activity that it operates, as required by Title IX and 34 CFR part 106. The requirement not to discriminate in education programs or activities extends to admission and employment. Inquiries about the application of Title IX and its regulations may be referred to the Title IX Coordinator, to the Department of Education, Office for Civil Rights, or both. To Request a Reasonable Accommodation For a Disability Or If You Or Someone You Know Has Experienced Discrimination Or Sexual Misconduct Including Sexual Harassment, You May Contact The Director/Title IX Coordinator In The Office Of Equal Opportunity And Affirmative Action Director/ Title IX Coordinator Office of Equal Opportunity and Affirmative Action ( OEO /AA) 135 Park Building Salt Lake City, UT 84112 801-581-8365 oeo@utah.edu Online reports may be submitted at oeo.utah.edu  For more information: https://www.utah.edu/nondiscrimination/   To inquire about this posting, email:employment@utah.edu (%20employment@utah.edu) or call 801-581-2300.  The University is a participating employer with Utah Retirement Systems (“URS”). Eligible new hires with prior URS service, may elect to enroll in URS if they make the election before they become eligible for retirement (usually the first day of work). Contact Human Resources at (801) 581-7447 for information. Individuals who previously retired and are receiving monthly retirement benefits from URS are subject to URS’ post-retirement rules and restrictions. Please contact Utah Retirement Systems at (801) 366-7770 or (800) 695-4877 or University Human Resource Management at (801) 581-7447 if you have questions regarding the post-retirement rules. This position may require the successful completion of a criminal background check and/or drug screen.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Higher Education"},
{"programName": "Software Engineering Systems", "title": "Entry-Level Systems Engineer", "jobId": "3377723488", "companyName": "Pileum Corporation", "location": "Jackson, MS", "datePosted": "2022-11-27", "link": "https://www.linkedin.com/jobs/view/entry-level-systems-engineer-at-pileum-corporation-3377723488?refId=j5sP42CjqbK0h6EfaAyOsA%3D%3D&trackingId=hE236E%2Fd%2B9J7dpiHpBrz9Q%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Pileum Corporation is a Systems Integration and Technology Consulting firm with locations in Jackson, Mississippi; Knoxville, Tennessee; and Birmingham, Alabama. We have an immediate opening for a Full-Time Systems Engineer in our Jackson, MS office to provide customer support services, implementation services and technology consulting services. The ideal candidate will have experience with Microsoft Windows Workstations Operating Systems, Microsoft Office Suite, hardware and software troubleshooting, local area networking and possess excellent communication, interpersonal and troubleshooting skills. Certifications such as Microsoft Certified IT Professional (MCITP) or Cisco Certified Network Associate (CCNA) are a plus. Experience with VMware, routers, switches, firewalls, or Servers is also a plus. Compensation commensurate with experience and certification level. Each Systems Engineer is provided an excellent benefits package, mileage reimbursement, company provided laptop, company-provided iPhone and parking space. Job Requirements Duties/Responsibilities: Design, implement and support customers’ workstations, laptops, servers and associated network equipment Interact with customers to provide onsite, remote and phone support as necessary Knowledge/Skills/Abilities Experience implementing and supporting Microsoft Windows Workstation Operating Systems and Microsoft Office Suite Experience implementing and supporting Server Class hardware Experience implementing and supporting Storage Area Networks Experience with virtual hypervisors Experience implementing and supporting network switches and firewalls Possess excellent troubleshooting skills Possess excellent organizational skills Possess leadership skills Strong written and verbal communication skills Ability to support pre-sales efforts and provide recommendations Microsoft, VMware or other certifications is a plus Pileum Corporation is a Systems Integration and Technology Consulting firm with locations in Jackson, Mississippi; Knoxville, Tennessee; Nashville, Tennessee; and Birmingham, Alabama.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Junior Data Engineer", "jobId": "3385235136", "companyName": "iland Cloud", "location": "Houston, TX", "datePosted": "2022-12-01", "link": "https://www.linkedin.com/jobs/view/junior-data-engineer-at-iland-cloud-3385235136?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=D7hxWrVIrOmitWT8z29agQ%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Description Our growing organization is looking for a  Junior Data Engineer  to join our growing team of software engineers. Does working with Python, Apache Spark, Apache Cassandra, Apache Pulsar, CockroachDB and other current Big Data technologies sound exciting to you? iland’s Junior Data Engineer will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross-functional teams. The ideal candidate is someone excited about building data pipelines, wrangling data, and optimizing data systems. This person will support our software developers, database architects, and data analysts on data initiatives and will ensure optimal delivery and consistent architecture throughout ongoing projects. The right candidate will be excited by the prospect of optimizing and influencing the direction of our company’s data architecture aimed at supporting our next generation of products and data initiatives. Join our global team of software developers as a Junior Data Engineer and contribute to development of the industry-leading 11:11 Cloud Console (https://1111systems.com/why-1111/cloud-console ), among other exciting projects. This is only the beginning of what will surely be your most challenging and rewarding role to date. Work with the latest technologies and push the barriers, all while helping build dynamic software that will have a lasting effect on the industry. Responsibilities Take an idea from design concept to working implementation that will be deployed for both internal and external use Build elegant, clean, bulletproof code that is driven by tests Work with Software Engineering to ensure architectural and implementation coherence Debug issues and develop quick, robust solutions to keep systems running smoothly Participate in code reviews to ensure alignment with the architectural approach and to maintain a clean code base Requirements   Bachelor’s Degree in Computer Science, Information Systems, or equivalent Strong interpersonal and communication skills is essential Flexibility, energy, and ability to work well with others in a team environment Must have skills include: 1+ years of Python experience 1+ year(s) of Data Engineering experience Strong Understanding of SQL and NoSQL databases Git CI/CD Linux Nice to have skills include: Experience with Apache Spark or other DataFrame-like frameworks Experience with Apache Cassandra Open-source project contributions GitHub or public-facing source code Developer forum (Stack Overflow, etc.) participation Benefits Competitive Salary 401k Plan with Company Match PPO Healthcare Insurance Plan Dental Insurance Vision Insurance Life Insurance Paid Vacation & Holidays About 11:11 Systems 11:11 Systems was created to deliver a fully integrated and unified network experience, providing our customers with visibility, control, and decision making to simplify their requirements through one experience: simplified, synchronized, and optimized. 11:11 is invested in creating a new model empowering its customers and partners to “RETHINK CONNECTED”. Fully integrated, fully automated. All services, all activities, all data, all performance, powered on a single platform.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "SQL Developer", "jobId": "3385816367", "companyName": "Sideshow", "location": "Thousand Oaks, CA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/sql-developer-at-sideshow-3385816367?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=9rn3EsC2uZvlvU%2FdOomn0g%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Sideshow is the premier maker and distributor of Pop Culture collectibles and lifestyle products. Our IT team is looking for an experienced SQL Programmer to help manage, maintain, and improve our digital systems with an emphasis on our ERP system. In this role, you will develop new programs and processes as well as maintain existing programs and code. Ad-hoc reports and queries will be frequent. You'll be part a small team that has a direct and immediate impact on efficiency and workflow. Sideshow's environment is fast paced, creative, and friendly. Required Skills MS SQL – writing complex queries, triggers, stored procedures MS SQL: SSIS & SSRS Understanding of MS SQL Server administration and configuration Creating and restoring databases in SQL Server VB & VBS Experience with ERP systems Responsibilities Create and modify triggers, stored procedures, queries, views, and tables Create programs and scripts to gain efficiencies for staff Write ad-hoc queries and reports Improve, troubleshoot, and maintain existing code Build reports in SSRS, Power BI, and similar programs Additional related duties may be assigned Additional Details Be a part of a positive and supportive work environment that promotes creativity and pride, with a balance of healthy and fun activities On-site cafe serving free healthy lunch options for all staff Applicants will undergo a 10-year background, credit and security check References Required Job Type:  Hybrid Hours:  Day Shift, Monday - Friday Pop culture is our culture In 1994, Sideshow embarked on a mission of connecting people with their favorite characters and icons from the worlds of film, television, comic books and popular culture. Today, we are a specialty manufacturer and distributor of the most highly sought-after licensed and original collectible products, sustained by a passionate worldwide community that is committed to the lifestyle of collecting figural art. Our development team consists of expert artists, sculptors, model makers, painters and costumers whose combined efforts result in the creation of outstanding original designs and intricately detailed likenesses of popular characters from highly recognized brands such as Star Wars, Marvel, DC Comics, Alien & Predator, Terminator, The Lord of the Rings, G.I. Joe and many more.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Entertainment Providers"},
{"programName": "Software Engineering Systems", "title": "IT Systems Administrator", "jobId": "3380735624", "companyName": "Corrigan Oil", "location": "Brighton, MI", "datePosted": "2022-11-29", "link": "https://www.linkedin.com/jobs/view/it-systems-administrator-at-corrigan-oil-3380735624?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=Vd6aQCjw7W5FoFLZxHqLRg%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Corrigan Oil - Who We Are:  Corrigan Oil is an equal employment opportunity employer with a dedication to customer satisfaction and quality that is second to none. Corrigan Oil is a family-owned business offering long-term career opportunities and a culture where you will be treated with respect and proud to work within. Corrigan Oil has expanded into a family of companies including:  Corrigan Oil, Construction, 24-hour Towing, Lubricants, Transportation, Propane, Mechanical Contractors, Environmental Solutions, Technical Environmental Services and Blue Water Industrial Products. Corrigan Oil understands the importance of preserving our environment and giving back to the communities. At Corrigan, we are proud supporters of our communities and encourage our employees to be active leaders, mentors, and volunteers.  Why Join the Corrigan Team:  Corrigan is a large company that operates with a small feel. Our culture is best described as hard working and ambitious. We are constantly looking for opportunities to say “yes we can” with a goal of total customer satisfaction while providing our products and services safely. Corrigan is a fast moving, quickly growing company that empowers our employees to be the best they can be with room for advancement throughout all branches of the organization.  Benefits:  Corrigan Oil offers a comprehensive benefits package to help you stay well, protect yourself and your family, and plan for a secure future. Benefits include: Medical, Dental & Vision Insurance. Life Insurance. Short-Term Disability coverage Vacation & Personal Time 401(k) – Company matches 50% up to 5% employee income  Job Overview:  The primary function of the IT Systems Administrator is to administer the installation, configuration and maintenance of physical\\virtual infrastructure equipment and software. This includes Network Routers/Switches, WAN Links, Firewalls, Mail Filters: Application/File Servers; Mail/Messaging Servers; and Cloud Services. This position will work with a high level of independence requiring excellent prioritization skills, as well as the ability to efficiently evaluate and escalate support calls when necessary. This position will assist the IT Manager in regular functions and on special projects as requested. Duties vary and are assigned based on knowledge and skills.  Essential Job Functions:  Administration and support computer IT environments, which includes but is not limited, to implementing system configuration, determining hardware, software and system functional specifications, and performing system installation. Administer the installation, operation, maintenance, and upgrades of hardware and software systems required. This includes the WAN (Wide Area Networks), LAN (Local Area Networks), VMware, Linux/Unix, MS Windows Servers, and data storage/SAN (Storage Area Network) and NAS (Network Attached Storage) environments. Configures and maintains physical / virtual servers, internal / cloud applications, end user computers, security, disaster recovery solutions, and network design and implementation. Implementation and management of system back-up, restoration and controlling protocols/procedures. Make recommendations regarding systems or procedural improvements, including recommendations regarding existing and/or new equipment, networking technology (such as network hardware, switches, routers, firewalls), security appliances, or software / cloud solutions. Establishes and administers the monitoring, measuring, and evaluating of hardware, software and network capacity performance reporting results to external clients. Manages user accounts, permissions, email, anti-virus, anti-spam and installs security programs to prevent unauthorized access to privileged data and information. Provide regular structured IT support and maintenance relating to issues with infrastructure leveraging the client Services’ standards and procedures. Performs intermediate level troubleshooting analysis of servers, workstations, and associated systems. Troubleshoots malfunctions of network hardware and software applications, to resolve operational issues and documents network problems and resolutions. Actively contribute to development of applicable IT standards and procedures. Manages and aids in project plan development and execution for server and network infrastructure upgrades. Installation, configuration, and support for PCs and PC related peripherals, network routers/switches, and printers. Escalate service or project issues that cannot be completed within agreed service levels. Travel to various company locations as required. Complete on-call responsibilities as required. Assist in the development of strong client relationships through constant dedication to client service and encouraging open lines of communication. Review IT publications and online materials to remain up to date with current and future technologies emerging in the industry.  Qualifications / Experience / Education:   Bachelor’s Degree in Computer Science or Information Systems (or related degree/equivalent combination of work experience) is required. 2-4 years of administrative support experience with an emphasis on Windows Server 2016/2012/2008 computing environments (Windows File Servers and PCs) supporting an organization of 50+ users. MCSE certification a plus. Experience with Unix/Linux, UNIX certification(s) desirable. Intermediate knowledge and experience in the area LAN and WAN inclusive of DNS, DHCP, IP addressing, etc. Entry to intermediate level knowledge of hardware imaging applications and deployment tools. (MS WDS, MS MDT, Acronis) Multiple Professional IT Certifications, such as: Microsoft MCP, MCSA, or MCSE; WatchGuard; Cisco CCNA; CompTIA; or VMware VCP. Interpersonal skills: Professional verbal and written communication skills, active listening, and client-care. Ability to effectively communicate to a diverse group of directors, managers, vendors, clients, and personnel at all levels. Technical awareness: ability to match resources to technical issues appropriately. Professional in appearance and approach; exudes expertise and credibility. Sound tactical thinker: ability to identify opportunities; initiator of improvements. Robust problem solving, analytical and listening skills. Ability to excel in a fast-paced, dynamic organization. Superior time management skills and demonstrated ability to multi-task on various work activities. Proficient knowledge of Microsoft Office to include Word, Excel, Visio and Power Point. Good verbal, written, presentation and problem-solving skills. Demonstrates the ability to work as part of a team and has a clear understanding of how assigned responsibilities impact other processes and the work of other people. Possess a “positive can-do” attitude. Highly self-motivated to work independently, within delegated authority, with minimal supervision. May sit at desk for long periods of time; frequently answer telephone and write or use a keyboard to communicate through written means. Some lifting to 50 lbs. may be required. Network Engineer: 2 years (Preferred). System Administration: 2 years (Preferred). Able to pass 7-year background check. #INDAOJ Powered by JazzHR lBL2j8ei0O\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "Computer System Analyst", "jobId": "3385259346", "companyName": "Linchpin Solutions, Inc.", "location": "Goose Creek, SC", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/computer-system-analyst-at-linchpin-solutions-inc-3385259346?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=IIgq72KL0sKvQ8j3U7myTQ%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Goose Creek, SC (http://maps.google.com/maps?q=2316+Red+Bank+Rd+Goose+Creek+SC+29445) Job Type Full-time Description If you are looking for an exciting career opportunity in the IT, engineering, software development, logistics, and project management fields, we are currently hiring for a dynamic and experienced Computer Systems Analyst. The Computer System Analyst II qualified candidate should have a working knowledge of Linux and Windows servers in a VMware virtualized architecture, managing port, protocol, and network configuration information for Linux, Windows, VM servers and hosted applications, implementation of RMF, IAVs and STIG mitigations to satisfy cybersecurity requirements. Assists in the support for access privileges associated with maintenance and management of complexities associated with Information Technology infrastructures, system administration, technical support, and problem resolution for a production DoD enterprise network as well as development of future enterprise networks to include hardware and software solutions Manages system uptime and availability for Linux and Windows servers in a VMware virtualized architecture Configures, manages, and troubleshoots issues with Windows, RHEL, and SUSE servers Applies operating system and software patches and upgrades for Linux, Microsoft, VM servers, and workstations.  Requirements Requirements: Three (3) years of \"Task-Specific Project\" Computerized System experience, including Test and Evaluation, Network Protocols, LAN administration fundamentals, and UNIX and Windows-based operating systems. Must have strong written and oral communication skills to clearly communicate with all levels of employees, management, and Government customers Must have strong analytical and troubleshooting skills Secret Clearance Education Requirements High School diploma or GED. Completed the following certifications within one and a half years after assuming duties: Professional Software Engineering Master (PSEM)/ Certified Software Development Professional (CSDP) or with COR approval complete a vendor/platform specific certification (e.g., Microsoft Certified Solutions Developer (MCSD), Microsoft Certified Applications Developer (MCAD), Microsoft Certified Database Administrator (MCDBA), Sun Certified Professional (SCP), Red Hat Certification Program (RHCP), CISCO Certified Network Professional (CCNP), CISCO Certified Design Professional (CCDP), Oracle Certified Professional (OCP), etc.). \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Help Desk Manager", "jobId": "3374547885", "companyName": "Recycle Track Systems", "location": "New York City Metropolitan Area", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/help-desk-manager-at-recycle-track-systems-3374547885?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=k%2FcONXCJWb%2F4PnG%2FSYpUuA%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "HELP DESK MANAGER – NYC/HQ   Recycle Track Systems - Equal Opportunity Employer: B Corporation  Recycle Track Systems is a leading provider of comprehensive environmental and waste management solutions services in North America. We invest in our client’s success by providing state-of-the-art technology, processes, and the best leadership in the industry. We are educators and leaders, with a passion for helping businesses become more sustainable and using our proprietary technology to make our service exceptional. We provide waste management, recycling, sustainability solutions for across businesses verticals Recycle Track Systems (RTS) has ushered in a new era for waste and recycling solutions, through the use of data analytics and technology service offerings. RTS proprietary tracking system empowers both customers and waste haulers by providing real time data and analytics increasing efficiency and surfacing greater insight into waste and recycling service pickups. Headquartered in New York City, Recycle Track Systems team of sustainability analysts, waste experts, and technologists remove inefficiencies in the waste management and recycling chain, creating an enhanced experience for customers and haulers.    About the Role Recycle Track system is looking for an experienced hands-on help desk manager to oversee our desktop support team in providing exemplary technical support to our end-users. The manager will manage an outsourced vendor and two help desk support engineers in different locations. This is a full-time onsite role based in our New York city headquarters location. Candidates are expected to be in the office during regular business hours. To be successful as a help desk manager, you should have excellent customer service and conflict management skills. Ultimately, a top-notch help desk manager should be able to ensure that our users receive professional and efficient technical support. The ideal candidate has strong communication skills, attention to detail, and the ability to prioritize tasks with a problem-solving attitude.  What You’ll Do To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Other minor duties may be assigned. Managing outsourced partners and SLAs. Maintain and upgrade network operations, help desk, and monitoring systems. Provides clients with technical services for laptops, workstations, peripherals, remote computing, applications, communications, Office 365, and internet solutions. Knowledge of cloud technologies like Azure, and AWS is preferable. Managing and supporting a team of helpdesk support engineers. Properly identify changes, make recommendations and implement technical solutions. Mentor team members, providing training and conducting performance evaluations. Monitoring team and vendor performance and developing feedback reports for management. Conduct monthly stakeholder meetings to review SLA and obtain feedback. Communicating with users and providing in-person and phone support, if required. Troubleshooting and resolving technical issues. Managing escalations and ensuring any issues are resolved promptly. Making recommendations to improve operational efficiency. Procurement of IT hardware and software, including renewals Define Cyber Security Policy, Practices and Procedures, implement application- CASB, MFA tools, security apps and monitoring of threats. Investigate security reaches and other cyber security incidents. Implement IT ad-hoc projects and improvement initiatives Management of IT assets including mobile devices, VOIP infrastructure for the organization Provide required access to managed service vendor for technologies such as Citrix, VPN, Cisco/Meraki firewall & switch, Cisco Meraki MDM or Virtual Desktop Troubleshooting system and network problems and diagnosing and solving hardware and software faults, replacing parts as required. Be Available to provide after-hours support to all urgent and emergency requests. What We’re Looking For Bachelor's degree in computer science, information technology, or a related field. Ability to work well independently as well as take ownership of assigned tasks to completion At least two years of experience as a Help Desk Manager with 5 years in technical support role. Understanding and hands-on experience with Cloud computing, virtualization technologies and Office 365 Good project management, organizational and time management skills to handle multiple projects simultaneously. Excellent customer service and communication skills (verbal and written) to effectively engage with clients. ERP experience, preferably with Microsoft Dynamics applications Strong technical background. Excellent analytical and troubleshooting skills. Ability to work under pressure. Excellent leadership and people management skills. Strong customer service skills. A self-starter with the ability to work independently under minimal supervision. Benefits RTS provides a competitive total compensation package including Medical, Dental, Vision, Life Insurance, 401(k) savings, and Short-Term Disability. Our employees also receive paid vacation, holidays, and volunteer days. Please note that benefits may vary and are subject to change. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Environmental Services"},
{"programName": "Software Engineering Systems", "title": "IT Specialist", "jobId": "3385800316", "companyName": "University of Utah", "location": "Salt Lake City, UT", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/it-specialist-at-university-of-utah-3385800316?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=aWWF%2BPRlfLXeZj5iuVxt9w%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Details Open Date  11/30/2022 Requisition Number  PRN33110B Job Title  IT Specialist Working Title  IT Specialist Job Grade  E FLSA Code  Computer Employee Patient Sensitive Job Code?  No Standard Hours per Week  40 Full Time or Part Time?  Full Time Shift  Day Work Schedule Summary VP Area  President Department  00810 - Scient Comp & Imag Instit-Oper Location  Campus City  Salt Lake City, UT Type of Recruitment  External Posting Pay Rate Range  39,300 to 72700 Close Date Open Until Filled  Yes Job Summary Skills and Competencies:  Bachelor’s Degree in Computer Science or Information Technology or Engineering or related field or applicable professional certification and at least three years relevant technical and analytical experience.  Experience in systems administration and support task.  Experience in software systems, including databases, system software, and networking.  Knowledge of coding at system level (e.g., bash, Python, C/C++).  Knowledge of cloud technologies.  Knowledge in continuous integration/delivery/configuration management.  Proactive approach to IT, rather than reactive.  Low to medium supervision needed, takes the initiative in monitoring and troubleshooting issues that arise.  Communication and presentation skills to engage technical and non-technical audiences. Personal Attributes Desired For The Position  Strong interpersonal abilities.  Strong teamwork skills.  Highly motivated to support research projects. The Applicant Will Responsibilities  provide support to different aspects of systems and systems software, including but not limited to implementation, deployment, maintenance, monitoring, performance analysis, and security.  work under the director, collaborate with other team members, and be exposed to multiple platforms and IT disciplines, including distributed systems. This position will provide support in building solutions to automate IT processes, including design, development, test, and deploying custom workflows and scripts within cloud infrastructure that can be used for integration, deployment, monitoring, and other IT tasks. The applicant will routinely interact with people of diverse backgrounds, so excellent interpersonal and communication skills are necessary. Disclaimer This job description has been designed to indicate the general nature and level of work performed by employees within this classification. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to the job. Work Environment And Level Of Frequency Typically Required Nearly Continuously: Office environment. Physical Requirements and Level of Frequency that may be required Nearly Continuously: Sitting, hearing, listening, talking. Often: Repetitive hand motion (such as typing), walking. Seldom: Bending, reaching overhead Minimum Qualifications Requires a bachelor’s degree or equivalency and 0-2 years of experience in the field or in a related area. Has knowledge of commonly-used concepts, practices, and procedures within areas of specialty. Preferences Type  Benefited Staff Additional Information Special Instructions Summary The University of Utah values candidates who have experience working in settings with students from diverse backgrounds and possess a strong commitment to improving access to higher education for historically underrepresented students. Individuals from historically underrepresented groups, such as minorities, women, qualified persons with disabilities and protected veterans are encouraged to apply. Veterans’ preference is extended to qualified applicants, upon request and consistent with University policy and Utah state law. Upon request, reasonable accommodations in the application process will be provided to individuals with disabilities. The University of Utah is an Affirmative Action/Equal Opportunity employer and does not discriminate based upon race, ethnicity, color, religion, national origin, age, disability, sex, sexual orientation, gender, gender identity, gender expression, pregnancy, pregnancy-related conditions, genetic information, or protected veteran’s status. The University does not discriminate on the basis of sex in the education program or activity that it operates, as required by Title IX and 34 CFR part 106. The requirement not to discriminate in education programs or activities extends to admission and employment. Inquiries about the application of Title IX and its regulations may be referred to the Title IX Coordinator, to the Department of Education, Office for Civil Rights, or both. To Request a Reasonable Accommodation For a Disability Or If You Or Someone You Know Has Experienced Discrimination Or Sexual Misconduct Including Sexual Harassment, You May Contact The Director/Title IX Coordinator In The Office Of Equal Opportunity And Affirmative Action Director/ Title IX Coordinator Office of Equal Opportunity and Affirmative Action ( OEO /AA) 135 Park Building Salt Lake City, UT 84112 801-581-8365 oeo@utah.edu Online reports may be submitted at oeo.utah.edu  For more information: https://www.utah.edu/nondiscrimination/   To inquire about this posting, email:employment@utah.edu (%20employment@utah.edu) or call 801-581-2300.  The University is a participating employer with Utah Retirement Systems (“URS”). Eligible new hires with prior URS service, may elect to enroll in URS if they make the election before they become eligible for retirement (usually the first day of work). Contact Human Resources at (801) 581-7447 for information. Individuals who previously retired and are receiving monthly retirement benefits from URS are subject to URS’ post-retirement rules and restrictions. Please contact Utah Retirement Systems at (801) 366-7770 or (800) 695-4877 or University Human Resource Management at (801) 581-7447 if you have questions regarding the post-retirement rules. This position may require the successful completion of a criminal background check and/or drug screen.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Higher Education"},
{"programName": "Software Engineering Systems", "title": "Entry-Level Systems Engineer", "jobId": "3377723488", "companyName": "Pileum Corporation", "location": "Jackson, MS", "datePosted": "2022-11-27", "link": "https://www.linkedin.com/jobs/view/entry-level-systems-engineer-at-pileum-corporation-3377723488?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=eQhIfSPp45ZY1%2B%2BXBKU9zQ%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Pileum Corporation is a Systems Integration and Technology Consulting firm with locations in Jackson, Mississippi; Knoxville, Tennessee; and Birmingham, Alabama. We have an immediate opening for a Full-Time Systems Engineer in our Jackson, MS office to provide customer support services, implementation services and technology consulting services. The ideal candidate will have experience with Microsoft Windows Workstations Operating Systems, Microsoft Office Suite, hardware and software troubleshooting, local area networking and possess excellent communication, interpersonal and troubleshooting skills. Certifications such as Microsoft Certified IT Professional (MCITP) or Cisco Certified Network Associate (CCNA) are a plus. Experience with VMware, routers, switches, firewalls, or Servers is also a plus. Compensation commensurate with experience and certification level. Each Systems Engineer is provided an excellent benefits package, mileage reimbursement, company provided laptop, company-provided iPhone and parking space. Job Requirements Duties/Responsibilities: Design, implement and support customers’ workstations, laptops, servers and associated network equipment Interact with customers to provide onsite, remote and phone support as necessary Knowledge/Skills/Abilities Experience implementing and supporting Microsoft Windows Workstation Operating Systems and Microsoft Office Suite Experience implementing and supporting Server Class hardware Experience implementing and supporting Storage Area Networks Experience with virtual hypervisors Experience implementing and supporting network switches and firewalls Possess excellent troubleshooting skills Possess excellent organizational skills Possess leadership skills Strong written and verbal communication skills Ability to support pre-sales efforts and provide recommendations Microsoft, VMware or other certifications is a plus Pileum Corporation is a Systems Integration and Technology Consulting firm with locations in Jackson, Mississippi; Knoxville, Tennessee; Nashville, Tennessee; and Birmingham, Alabama.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Software Engineer I (Intern) United States", "jobId": "3385790099", "companyName": "Cisco", "location": "Seattle, WA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-engineer-i-intern-united-states-at-cisco-3385790099?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=4lf1CbAMaEvLMOCJFrC69Q%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "What You’ll Do Our software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. Who You’ll Work With Our hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. You would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. Who You Are  Including but not limited to an upcoming graduate of a technical degree or certification program from a Technical Boot Camp, Apprenticeship, Community College or 4-Year University.   Up-to-date on programming and scripting languages: C/C++, Python, Java   Knowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML   Hands on QA, Testing, and/or Debugging skills   Experience with Databases, Web Application Development, and Web Services   Able to legally live and work in the country for which you’re applying, without visa support or sponsorship  Why Cisco #WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. We embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! But “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) Day to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. So, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Internship", "jobFunction": "Information Technology and Engineering", "industry": "Computer Hardware Manufacturing, Software Development, and Computer Networking Products"},
{"programName": "Software Engineering Systems", "title": "IT Systems Assistant/Helpdesk", "jobId": "3383545195", "companyName": "Ledgent Technology", "location": "Golden Valley, AZ", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/it-systems-assistant-helpdesk-at-ledgent-technology-3383545195?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=S0ic3HH%2FmpUUaKKoDpqCCA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Our client is seeking an experienced Help Desk/IT Support professional to join their team! This individual will be responsible for supporting end users and maintaining the company's IT systems including troubleshooting, installation, setup, and management of hardware, software, networking, and peripherals, as well as some basic user training. This is a contract-to-hire position which will begin onsite in Golden Valley during a 3-month training and onboarding period and move to hybrid with 3 days per week onsite. Responsibilities Provide onsite and remote help desk support for internal end users Deploy, set up, and maintain desktops, software, phones, printers, etc. Manage IT inventory, providing tracking and organization Provide documentation for technology and processes Manage Active Directory alongside other members of IT team Preferred Experience 2+ years in prior IT experience required Office 365 programs Infrastructure including Windows servers, virtual machines, and SQL Server Network hardware, protocols, and services Windows OS and iOS for mobile devices Cloud-based software Shell scripting or other scripting languages Cyber security Pursuit or completion of a Bachelor's in Information Technology or related field We are an equal opportunity employer and make hiring decisions based on merit. Recruitment, hiring, training, and job assignments are made without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, or any other protected classification. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance. To apply please email your resume to mpieper@ledgent.com\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Staffing and Recruiting"},
{"programName": "Software Engineering Systems", "title": "Software Engineering Intern", "jobId": "3370186715", "companyName": "Yahoo", "location": "United States", "datePosted": "2022-11-22", "link": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-yahoo-3370186715?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=8edlXEU6LzOzKHGTA8ti%2Fg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? About Us: As a global email provider, Yahoo Mail is the ultimate Consumer Inbox with over 220 million users. It is the best way to access your email and stay organized from a computer, phone or tablet. We develop technology that changes the internet while handling billions of inbound connections per day to manage trillions of messages requiring petabytes of efficient storage. The Yahoo Mail engineering team provides opportunities to work on challenges that are as exciting as the Yahoo Mail product itself at the scale that only a handful of companies can match. We are looking for innovative, entrepreneurial, and passionate developers to help us build the future of communications experiences and delight our users. We are engineers who strive to deliver our users only the absolute best and are willing to meticulously refine the details to achieve this goal. We believe that engineering is only a piece of the effort and that you must be as passionate about the user’s experience as you are about code quality and architecture. Our goal is to make communication simple, enjoyable and more productive to help our users run the business of life. About the team: Do you relish the opportunity to work on one of the largest distributed storage systems in the world, running on thousands of machines and handling petabytes of data? Developing this infrastructure requires solving many technical challenges in the areas of distributed computing frameworks, data structures and algorithms. The team is responsible to architect these platforms, build scalable and modular systems, measure and optimize system performance, and ensure that systems run reliably in a 24/7 production environment. Specifically, we work on a complete Java stack that serves hundreds of billions of transactions daily and will work on the complete redesign of the Mail Backend Storage System to make our system secure, highly available and durable. We also work on Next Gen solutions to reduce the hardware cost and Innovative algorithms to keep the user data in sync across multiple copies. Sounds Exciting? Then, come join us!! Responsibilities:  You will work on features or proof of concepts that are critical to the team. Collaborate with other engineers to write testable, reliable code, continuously deploying to production systems Responsible for writing excellent code and following best practices in software engineering. Deploy, monitor and operate large-scale production systems distributed across the globe.  Automate the provisioning, scaling, and management of our infrastructure A Lot About YOU You are passionate about growing your skills and value high quality engineering that can help modernize systems in the Cloud. You are interested in how best to drive tasks to completion, collaborate to achieve your goals, think through scenarios and edge cases, learn from your leadership (mentors), and understand the broader impact of your work. If you are interested in joining a world-class team of passionate people and industry veterans who like to work hard and play hard, we look forward to hearing from you soon! Qualifications: Strong Object Oriented programming languages such as Java, C++, or similar Strong understanding of computer science fundamentals including Data Structures, Algorithms, OS and Networking Understanding and experience with UNIX Knowledge of Perl, Python, or Shell scripting languages Ability to work well with diverse groups of people, geographically dispersed across the world Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Developer Intern", "jobId": "3385765787", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-developer-intern-at-yahoo-3385765787?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=Q3t86Z9gLtMNv8v1F%2BTEeQ%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us Under the office of the CTO, the Yahoo Platforms Engineering (YPE) group enables all of the Yahoo verticals to develop and deliver the best possible products to our customers globally with the highest standards. Yahoo’s Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Yahoo’s brands at scale. The Yahoo Edge Engineering Group writes the code that runs Yahoo’s internal content delivery network (CDN). We develop the open source Apache Traffic Server as well as internal solutions for content caching, edge security, traffic shaping and routing, load balancing and failover, and IPv6 translation. Our code makes delivering Yahoo properties fast and reliable. We offer a variety of internships to students who want jobs with real responsibility, outstanding training, and the chance to learn from the best through 1:1 mentorship in a small team setting. As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for a potential full-time position after graduation. During the course of your internship, you will take part in an exciting lineup of intern events and engage in important projects that significantly impact the success of our businesses. At the end of your summer, you will have the opportunity to present your work to our leadership and network with our hiring managers. Your Day Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed Develop project timelines, implement design specifications, system flow diagrams, documentation, testing, and ongoing support Recommend modifications to our processes and procedures Help us to identify a gold standard for current methodologies and implementations Make your voice heard by promoting your ideas within project teams Get involved in the intern outings, workshops, and trainings we have available Present your work to leadership and network with your fellow interns You Are An avid problem solver who has the capability to work independently as well as collaborate within a team Enrolled in a Bachelor's, Masters or Phd program in Computer Science or related major, and have a strong record of academic achievement Proficient in a language including one or many of the following: HTML, CSS, JavaScript, Node. JS, JS Framework (React and Ember) Java, C/C++, Grid, Hadoop, Perl, PHP, Python, Ruby, Lamp, Oracle, MySQL, Hive, etc. Passionate about large-scale, large-user base, website development Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Developer Intern", "jobId": "3385767756", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-developer-intern-at-yahoo-3385767756?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=%2FfQwyIcZYJ7HPNawP8oLQA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us Under the office of the CTO, the Yahoo Platforms Engineering (YPE) group enables all of the Yahoo verticals to develop and deliver the best possible products to our customers globally with the highest standards. Yahoo’s Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Yahoo’s brands at scale. The Yahoo Edge Engineering Group writes the code that runs Yahoo’s internal content delivery network (CDN). We develop the open source Apache Traffic Server as well as internal solutions for content caching, edge security, traffic shaping and routing, load balancing and failover, and IPv6 translation. Our code makes delivering Yahoo properties fast and reliable. We offer a variety of internships to students who want jobs with real responsibility, outstanding training, and the chance to learn from the best through 1:1 mentorship in a small team setting. As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for a potential full-time position after graduation. During the course of your internship, you will take part in an exciting lineup of intern events and engage in important projects that significantly impact the success of our businesses. At the end of your summer, you will have the opportunity to present your work to our leadership and network with our hiring managers. Your Day Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed Develop project timelines, implement design specifications, system flow diagrams, documentation, testing, and ongoing support Recommend modifications to our processes and procedures Help us to identify a gold standard for current methodologies and implementations Make your voice heard by promoting your ideas within project teams Get involved in the intern outings, workshops, and trainings we have available Present your work to leadership and network with your fellow interns You Are An avid problem solver who has the capability to work independently as well as collaborate within a team Enrolled in a Bachelor's, Masters or Phd program in Computer Science or related major, and have a strong record of academic achievement Proficient in a language including one or many of the following: HTML, CSS, JavaScript, Node. JS, JS Framework (React and Ember) Java, C/C++, Grid, Hadoop, Perl, PHP, Python, Ruby, Lamp, Oracle, MySQL, Hive, etc. Passionate about large-scale, large-user base, website development Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Developer Intern", "jobId": "3385771156", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-developer-intern-at-yahoo-3385771156?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=3G4zzc%2F%2B3Qw9mXdS3MMVaA%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us Under the office of the CTO, the Yahoo Platforms Engineering (YPE) group enables all of the Yahoo verticals to develop and deliver the best possible products to our customers globally with the highest standards. Yahoo’s Platforms Engineering organization creates modern, secure, and efficient software platforms to power all of Yahoo’s brands at scale. The Yahoo Edge Engineering Group writes the code that runs Yahoo’s internal content delivery network (CDN). We develop the open source Apache Traffic Server as well as internal solutions for content caching, edge security, traffic shaping and routing, load balancing and failover, and IPv6 translation. Our code makes delivering Yahoo properties fast and reliable. We offer a variety of internships to students who want jobs with real responsibility, outstanding training, and the chance to learn from the best through 1:1 mentorship in a small team setting. As an intern, you will gain valuable work experience while developing your skills and establishing a track record to set you up for a potential full-time position after graduation. During the course of your internship, you will take part in an exciting lineup of intern events and engage in important projects that significantly impact the success of our businesses. At the end of your summer, you will have the opportunity to present your work to our leadership and network with our hiring managers. Your Day Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed Develop project timelines, implement design specifications, system flow diagrams, documentation, testing, and ongoing support Recommend modifications to our processes and procedures Help us to identify a gold standard for current methodologies and implementations Make your voice heard by promoting your ideas within project teams Get involved in the intern outings, workshops, and trainings we have available Present your work to leadership and network with your fellow interns You Are An avid problem solver who has the capability to work independently as well as collaborate within a team Enrolled in a Bachelor's, Masters or Phd program in Computer Science or related major, and have a strong record of academic achievement Proficient in a language including one or many of the following: HTML, CSS, JavaScript, Node. JS, JS Framework (React and Ember) Java, C/C++, Grid, Hadoop, Perl, PHP, Python, Ruby, Lamp, Oracle, MySQL, Hive, etc. Passionate about large-scale, large-user base, website development Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "SQL Database Developer", "jobId": "3374550268", "companyName": "Apex Systems", "location": "United States", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/sql-database-developer-at-apex-systems-3374550268?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=9baTpWmlybNc6Mnj2GBmeA%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "12+ months  Location: Charlotte, NC  Pay Rate: $65-$70/hour on W2  W2 applicants only, unable to work C2C  Unable to provide visa sponsorship Top Requirements:  SQL Server Development  Data Warehousing Experience working on architecture or modules  Desired qualifications:  - Degree (or equivalent experience) in Computer Science or related Engineering field - 5+ years development experience in a complex application development (client and/or server) - 5+ years of experience in solution engineering - Strong SQL Development Experience (DDL, DML, SSIS) - Hands on experience in advanced db concepts. - Provides technical knowledge and capabilities as a team member and individual contributor - Experience with automated SDLC solutions (CI/CD) - Experience working on Autosys, for job scheduling \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Contract", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Systems Engineer remote position", "jobId": "3377845357", "companyName": "Indotronix Avani Group", "location": "Pittsburgh, PA", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/systems-engineer-remote-position-at-indotronix-avani-group-3377845357?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=0zWfdrAwIocKQ4Bm6dfsfw%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Position Title: Systems Engineer 3 Position Location: remote Ability to work remote: Yes Remote details and time zone(s): 8-5PM EST Intended length of Assignment: 6 months before FTE consideration; 6 month extension if needed but NO visa candidates Potential for Contract Extension: Yes If yes, details (intended length of extension): 6 months Required Skills Strong Windows Desktop troubleshooting skills Experience using Microsoft Endpoint Configuration Manager and vulnerability remediation; Windows 10 20h2 (preferred but ANY version of Windows 10 is fine/required), Proficient in supporting Microsoft Defender for Endpoints using Microsoft Intune and MECM. Proficient in supporting Symantec Endpoint Protection (SEP 14) management server and workstation clients. Installation, configuration, and day-to-day management of Symantec Endpoint Protection Troubleshooting and tuning the performance of Symantec Endpoint Protection in the enterprise environment. Microsoft excel for reporting Windows remote assist and Windows remote desktop Service Now for ticketing Degrees or certifications HS Diploma is ok (tech certs would help - Azure, intune, etc. any Microsoft certification is a plus) Bachelor's preferred (software engineering, computer science, and/or related field); tech certs for Azure, intune, etc. any MS certs is a plus 5+ of related work exp Interview Process 30 min initial phone interview virtual face to face interview via team\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Staffing and Recruiting"},
{"programName": "Software Engineering Systems", "title": "Software Intern", "jobId": "3385251626", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-intern-at-yahoo-3385251626?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=skMdv4ACUTs3%2FFv7LmQtYw%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Yahoo is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports, to shopping, gaming and news—with the trusted products, content and tech that fuel their day. For partners, we provide a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search and media. About Yahoo Yahoo is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they love—from finance and sports to shopping, gaming and news—with the trusted products, content, and tech that fuel their day. For partners, we provide a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search, and media. A Little About Us The Media Edge team provides technical expertise in Infrastructure, Proxy, and Cloud technologies to all Yahoo properties. At peak traffic time, our proxies service over 1 Million RPS (requests per second). We provide common features such as Experimentation (bucket testing), Resiliency (Abuse detection, Caching, Failsafe), Security (mTLS), GDPR compliance, and a Programmable Edge (to build flexible features), etc. within the company. A Lot About You We are looking for great talent - Software Developers that can contribute to the development of our exciting next-generation products. If you are excited about the overall lifecycle of a product - building, coding, testing, launching, and learning, this is the place to be, because you will learn and gain hands-on experience while engaged in projects with a significant impact on the success of Yahoo businesses. You are a great problem solver, have the capability to work independently as well as with a team, and have the willingness to learn from our leadership. You Must Have Actively pursuing a BS, MS, or Ph.D. in Computer Science or a related major, and a strong record of academic achievement. Programming proficiency in a language, preferably one of C/C++, Python, Go, Java, etc. Knowledge of software engineering processes, tools, methods, test development, support, algorithms, and data structures. Familiarity with object-oriented programming concepts, large-scale software architecture, networking, distributed systems, and Linux environments Experience in one or many of the following is a plus Knowledge of best practices related to L4/L7 Proxy such as Apache Traffic Server, Nginx, Envoy, etc. Security, performance, and disaster recovery Container deployment and Orchestration technologies Working with public cloud technologies such as AWS or GCP Cross-browser, Cross-platform coding Large-scale website development experience Internship experience at a tech company Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Software Engineering Intern", "jobId": "3385767747", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-engineering-intern-at-yahoo-3385767747?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=r3tU8AJgVRxX1fJiTHvZdQ%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? About Our Team Our Team develops and maintains the content serving and recommendation systems that power all our Yahoo brands such as Yahoo.com, Yahoo Sports, Yahoo Finance, AOL.com, TechCrunch, AutoBlog and Engadget on the web as well as the mobile experiences. We develop and maintain large scale web crawling systems, distributed storage solutions, highly flexible federation layer and a low latency search indexes. To do all this, we work with technologies such as Vespa (Vespa.ai), Redis, Cassandra, Storm, Kafka, Hadoop, Hive, Pig, Spark, and gRPC. We work closely with data and applied science teams to continuously improve the recommendations and content understanding to give the user what they seek and build the features that delight them. We work on a massive scale, ingest and transform 100s of terabytes of data, build various interesting algorithms and work closely with our data analytics team to measure our successes. Who we are Our engineering teams are focused on delivering the best product experiences across News, Sports and Finance and many others, across all devices from watches to TVs and everything in between and to users around the globe. Our team structure encourages trust, learning from one another, having fun, and attracting people who are passionate about what they do. What we are looking for We are looking for great talent, well rounded Software Developers that can contribute to the development of our exciting next-generation products. If you are excited about the overall lifecycle of a product - building, coding, testing, launching and learning, this is the place to be, because you will learn and gain hands-on experience while engaged in projects with significant impact on the success of all of Yahoo's products. You are a great problem solver, have the capability to work independently as well as with a team, and have the drive and willingness to learn new things. What a normal day looks like Design, develop, code and test software systems or applications for software enhancements and new products; revise and refine as required Participate in agile development of project timelines, implementation design specifications, system flow diagrams, documentation, testing and ongoing support of systems Recommend modifications to processes and procedures, and contribute to best practices, architecture, and implementations Promote and solicit ideas within project teams You Must Have Actively pursuing a BS, MS, or PhD in Computer Science or related major, and strong record of academic achievement Knowledge of software engineering processes, programming languages (preferably Java), programming tools like IDEs and source control, testing frameworks and algorithms and data structure Familiarity with object-oriented programming concepts, large-scale software architecture, networking and distributed systems, and UNIX/Linux environments Experience in one or many of the following is a plus: Backend system experience (Big Data, search engines) Scripting language Security Large-scale, large-user base website development experience Data mining, machine learning, AI, statistics, information retrieval, linguistic analysis Strong mathematical background Internship experience at a tech company Front-end language: HTML, CSS, JavaScript, Node.JS, JS Framework (React and Ember) Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "IT Systems Engineer", "jobId": "3385812387", "companyName": "VineBrook Homes LLC", "location": "Dayton, OH", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/it-systems-engineer-at-vinebrook-homes-llc-3385812387?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=NggmZzr%2FBfn9DWSI04moaA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Position Summary/Objective The IT Systems Engineer is responsible for supporting the corporate office, market offices, and field-based staff in day-to-day use of their technology equipment. Equipment supported includes desktop computers, laptops, desk phone, cellular phones, tablets, printers, and other technology equipment. The role provides technical expertise to the desktop environment with a goal of increasing performance, reliability, usability, efficiency, and functionality of the computing environment. Typical duties include administering multiple systems for access control, packaging software for deployment, building/deploying desktop hardware and related software images, and utilizing group policy in a cloud-based domain structure for account administration. The IT Systems Engineer will use their skills and passion for technology to diagnose the most effective method to resolve problems and implement solutions that keep end user technology functional. Responsibilities also include the documentation of activities via support tickets, technology asset inventory, IT processes, policies, and procedures as necessary. Essential Duties And Responsibilities  This position will work with other IT team members to resolve help desk tickets, troubleshoot networking issues, support end user desktop and peripheral devices including phones, printers, tablets and smart phones  Additional duties include supporting the company servers, administering users within business applications, and maintaining run documentation for procedure manuals Minimum Qualifications  Bachelor's Degree in a related field or related professional experience; A+ and/or MCTS Certification  3-5 years of progressive experience in Information Technology Department with an emphasis on desktop support  Minimum 3 years customer service experience working with end users to troubleshoot and resolve end user technical problems  Technical knowledge and experience in Office 365, Windows 10, Active Directory, Group Policy, Application Repackaging, Apple IOS, PC Hardware Installation and Diagnosis, LAN I WAN Concepts (TCP IP, DHCP, DNS)  Build sustainable relationships of trust through open and interactive communication  Understanding of enterprise class networking equipment and concepts helpful  Ability to carry out assignments with minimum direction where objectives are broadly defined  Valid Driver's License is a requirement Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.  S upervisory Responsibility  None  T ravel  This position may require travel to market offices as necessary to deploy technology equipment . Other Duties Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice. We recognize that people come with a wealth of experience and talent beyond just the technical requirements of the job. If your experience is close to what you see listed here, please still consider applying. Diversity of experience and skills combined with passion is a key to innovation and excellence; therefore, we encourage people from all backgrounds to apply to our positions. Please let us know if you require accommodations during the interview process. We are an equal opportunity employer. Qualified applicants shall be considered for all positions without regard to race, color, sex, religion, national origin, age, disability, veteran status, or any other status protected by federal, state or local law. We are also a Drug Free Work Place. Qualified applicants will also be required to pass a drug screening before receiving an offer or beginning employment. Refusal to submit to testing will result in disqualification of further employment consideration.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Analyst", "industry": "Software Development"},
{"programName": "Software Engineering Systems", "title": "Software Engineer Intern", "jobId": "3385766805", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-engineer-intern-at-yahoo-3385766805?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=lbnSogcQGc0OBSRg0pXW6g%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? A Little About Us: Yahoo is a values-led company committed to building brands people love. We reach over one billion people worldwide with a dynamic house of 50+ media and technology brands. As a global leader in digital and mobile, Yahoo is shaping the future of media. Our mission: build brands consumers love, build platforms customers love, and build a company talent loves. The user understanding team plays a critical part in the Media Personalization that powers all the critical components of our Media Business. As part of this team, we work on various features that directly impact properties like Yahoo Sports, Yahoo Finance, Yahoo News, and Yahoo Homepage. We are directly responsible for billions of impressions and millions of clicks for our content. A Lot About You: You are someone who is motivated by our mission and wants to ensure that our media platform plays a critical role in improving the experience of our users. You are passionate about solving technical problems, from the network to the user experience. You want to make web applications and middleware systems faster, more reliable, and more efficient; think outside the box to build tools and systems that allow faster and easier to create experiences and launch, with low latency and high-performing runtime. Responsibilities: Engineering ownership in a complex backend system, including new feature work, improvements on existing code, debugging and investigation of user issues, participation in code reviews, and designing and shipping the product. Contribute to standard methodologies and the culture of the team. Collaborate with Product Managers to ideate technical solutions. Qualifications : Pursuing BS/MS in Computer Science (or equivalent) Experience with Java and related technologies like Spring, Junit, JAX-RS/Jersey, GRPC, Apache Storm, NoSql DB, Redis, etc. Experience with object-oriented programming concepts, event-driven programming, large-scale software architecture, networking,  distributed systems, and UNIX/Linux environments Experience with Web technologies like REST APIs, JSON, NodeJS, etc Bonus / Nice to Have: Exposure to AI/ML Experience with large data processing and storage solutions like Storm, Spark, Hadoop Map/Reduce, Pig, Oozie, DynamoDB, and Cassandra. Experience working with search and real-time retrieval solutions like Vespa.ai, Elasticsearch, Apache Solr Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Systems Engineering - Junior", "jobId": "3384266845", "companyName": "VectorCSP", "location": "Elizabeth City, NC", "datePosted": "2022-11-10", "link": "https://www.linkedin.com/jobs/view/systems-engineering-junior-at-vectorcsp-3384266845?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=8t04iaSSmqT%2FC%2FY662ooiA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "VectorCSP is looking for an experienced Systems Engineering - Junior (ALC-ISD) to work in the Elizabeth City, NC area.Job Summary:Performs in all phases of systems development and implementation, with special emphasis on study and analysis, and testing and acceptance phases.Requirements: CompTIA Sec+ CertificationEducation and Experience:Bachelor's Degree or equivalent in Electrical Engineering, Mechanical Engineering, Computer Science, Management Information Systems, Systems Engineering or Electrical Engineering TechnologyTwo (2) years of experience in current operating systems.Essential Duties:Perform evaluation of current IT operations in order to determine multi-year projections for personnel, hardware, and software.Participate in hardware/software evaluations.Supports systems analysts, as well as Government personnel to ensure that the problem has been properly identified and that the solution shall satisfy the customer's requirements.Provide technical expertise and guidance in IT specialties not covered by other specialists.Perform analysis in a specialized IT area(s), e.g. telecommunications, operating systems software, software/hardware integration, software validation, and verification preferred.Capable of defining all required database administration policies, procedures, standards, guidelines, and OPKnowledge, Skills and Abilities:Experience working in/around militaryExperience with software analysis/development for government customersDemonstrated ability to work with large and diverse teams and the ability to effectively provide support as neededAbility to write technicallyAbility to work within a team and solve problems collectivelyAbility to communicate at all levels of the command chainTo apply, please go tohttps://vectorcsp.applicantpro.com/. For assistance please contact our Human Resources Department by telephone at (252) 338-4255 or by email, human.resources@vectorcsp.com.Vector CSP, LLC is an equal opportunity employer and does not discriminate against any employee or applicant for employment because of race, color, religion, national origin, age, disability, or any other reasons prohibited under Federal, State or local laws. EOE AA/M/F/D/V.For more information, or to apply now, you must go to the website below. Please DO NOT email your resume to us as we only accept applications through our website.https://www.applicantpro.com/j/2637380-340673\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Defense and Space Manufacturing"},
{"programName": "Software Engineering Systems", "title": "Vice President, System Operations and Infrastructure", "jobId": "3379639408", "companyName": "Raintree Systems", "location": "United States", "datePosted": "2022-11-29", "link": "https://www.linkedin.com/jobs/view/vice-president-system-operations-and-infrastructure-at-raintree-systems-3379639408?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=z1yJv9A%2BhnKdxkZ%2B5eRWxA%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "As VP of Systems Operations & Infrastructure for Raintree Systems, you will lead all aspects of System Operations, Infrastructure, Enterprise Technology (aka IT), and Security for all customer-facing and internal applications. This position is responsible for driving improvements, innovation, automation and efficiencies for Cloud Platforms, SaaS, SSO, SecOps, ISO27001 Compliance, Service Level, and Performance Management. You will partner with company leadership to ensure appropriate people, talent, strategy, and processes are in place to support the company's strategic and operational initiatives. This position will also act as Raintree’s Chief Information Security Officer (CISO) ensuring comprehensive electronic health care PHI-related security and compliance. As the company’s CISO you will be responsible for the planning, development, and execution of Raintree’s enterprise information security strategy and best practices approach in support of Raintree’s information security architecture. In this role, you will work collaboratively across the organization to identify, develop, implement, and maintain processes and best practices across the organization to reduce information and information technology risks and will report timely and regularly to Executive management. This position is remote from one of the designated states below. Responsibilities Lead the Infrastructure, System Operations, Security and Desktop Support teams for all products and systems in the company. Establish technology and security vision and goals. Build/enhance effective systems and platforms that meet stakeholder requirements Act as Chief Information Security Officer (CISO) to keep our platforms secure from internal and external threats  Manage the budgets, including build, buy, or partner decisions and manage our cloud and capital costs to industry standards. Analyze the costs, value, and risks of technology to advise executive leaders and drive investments Establish service level agreements (SLAs) that meet business needs, and monitor performance to ensure adherence to commitments Implement technology and optimizations to streamline operations and security. Monitor changes or advancements in technology to discover ways to gain a competitive advantage  Partner effectively with all levels of the organization to identify, prioritize, and drive strategic initiatives that impact the organization. Communicate strategy, objectives, and performance results to the executive team and cross-functional partners Abilities & Knowledge Cloud - AWS ISO27001 Security Governance & Compliance Broad knowledge of IT disciplines, most important system administration, information security, and DevOps Strong leadership presence Track record building, leading and mentoring high-performing technical teams Significant experience working and leading cross-functionally in high growth organizations Outstanding written and verbal communication skills; proven ability to communicate effectively at C-level and Board of Directors Knowledge of Microsoft and Google product suites Education and Experience Bachelor's degree in a related field Minimum 10 years of work experience in the technology industry required 7+ years technology leadership experience in high-tech companies, preferably with SaaS business models Must reside in one of the following states: AZ, CA, CO, CT, FL, GA, ID, IL, IN, KS, MA, MI, MO, MS, NC, NJ, NV, OR, PA, SC, TN, TX, UT, VA, WA Raintree Systems provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Powered by JazzHR ZJ5ajvX5ce\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Director", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "Information Technology Engineer", "jobId": "3385840807", "companyName": "Outsource IT Solutions", "location": "Naperville, IL", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/information-technology-engineer-at-outsource-it-solutions-3385840807?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=bwOjo0RMHFJ97wqbcx21jQ%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "We are looking for a dedicated and dynamic individual to join our team! Responsibilities We require an IT problem solver with strong communication skills to design, install, document, and support our customer’s networks, servers, and desktop hardware and software. The position requires travel by car throughout Chicago and surrounding suburbs as well as the ability to manage multiple projects/problems efficiently. A strong background in troubleshooting and problem resolution is also required. Experience with Connectwise Automate or Connectwise Manage is highly desirable. Experience 2+ years of experience, network design, build and troubleshooting with firewalls, routers, servers and Microsoft Networks. The ideal candidate will have experience and certifications on Windows 10/11, Windows Server 2016/2019, Virtualization (Both VMware and Hyper-V), VDI Technology, Microsoft Exchange/Office 365, Azure, HP ProLiant Servers, Cisco and Fortinet Switches, Routers, Firewalls and Meraki Wireless. Salary range is flexible based on current certifications and experience. We offer competitive benefits including company-paid medical/dental insurance coverage, company matching SIMPLE IRA, & PTO. We also offer an excellent work environment with potential for personal growth as part of a dynamic and successful organization. Please visit our web site www.osgusa.com Outsource IT Solutions Group, Inc. is one of the fastest-growing MSPs in the Chicagoland area. With a team of brilliant-minded employees and an amazing clientele to match, we want this to be the last place you ever work! We have been in business since 1998, where we entered the market at the leading edge of modern networking and complex computer systems - and we've been there ever since. We take the utmost care of our employees, and make sure that all of their needs are met. Our Mission Outsource IT Solutions Group, Inc. mission is to design high quality, cost effective, technology solutions that provide the greatest return on investment for our growing customer base. Our Vision Outsource IT Solutions Group’s vision is to achieve predictable profitable growth through superior customer service, quality of work, and commitment to excellence. Our Values We will execute our missions and realize our vision by: Hiring the candidates who demonstrate the highest potential to achieve our goals. Retain only exceptional employees who repeatedly exemplify our values, execute our missions and move us toward our vision. Take care of our employees first, our customers, our vendors, and other partners in this order. Accept only the highest level of competency and execution in our team in creating the solutions and solving the problems of our customers. Empathize such that we make the pains and problems of our customers our own so me may move to the solution together equally. Treat others, both externally and internally, the way that we would want and expect to be treated.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Software Engineering Systems", "title": "Software Dev Engineering Intern", "jobId": "3385766806", "companyName": "Yahoo", "location": "United States", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/software-dev-engineering-intern-at-yahoo-3385766806?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=vdfxViO7gHt8mL%2BrPMhFfQ%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in? The Location Platforms team is responsible for all services related to the processing and serving of location centric entities, predicting and processing user location, and the contextual intersection of these two spaces ­including: geo­political relationship mapping, forward and reverse geo­coding and routing, point­-of-­interest catalog and search, movement data contextual enrichment, etc. These services are embedded across the footprint of the Yahoo Media network in applications like Web Search, Ads Targeting, Content Personalization, Mail Inbox Commerce, etc, while also producing aggregate data for campaign insights and business intelligence. In support of these goals, the Location team builds highly scalable back­-office and front­-stage systems backed by both statistical and machine­-learned models that have access to large scale data from user activities and interactions. This requires Software Engineers skilled in the disciplines of big­-data manipulation using distributed computing technologies, data mining, statistical analysis, machine-­learned modelling, and the domain knowledge to support these models with appropriate feature engineering activities. Responsibilities : Design, develop, code and test software systems or applications for software improvements and new products; revise and refine as needed. Data mine and aggregate captured user activities. Construct ad hoc studies, data visualizations, and analytic tools.  Implement workflows to enrich user activities based on Spatio-temporal behaviors. Identify and execute feature extraction and engineering opportunities related to supervised and unsupervised models.  Work side­-by-­side with other engineers to train, evaluate and launch machine-learned ranking and classification models ­deployed in back-end workflows. Adhere to coding and documentation standards, conduct code reviews, and be a fully participating member of the engineering team and its practices.  Present your work to leadership and network with your fellow interns Qualifications : Enrolled in M.S. or qualified program focused in the disciplines of Computer Science.  Solid programming skills in Java or Python.  Experience in handling large scale data processing in the Hadoop ecosystem (e.g. HDFS, MapReduce, Pig, Oozie, HBase, Hive, Spark, etc) is a plus. Strong oral and written communication skills. Yahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response. At Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more. US Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law. The compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply. Yahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements. If you’re curious about how this factors into this role, please discuss with the recruiter. Currently work for Yahoo? Please apply on our internal career site. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Internship", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Advertising Services"},
{"programName": "Software Engineering Systems", "title": "Systems Developer", "jobId": "3385236440", "companyName": "Ralco", "location": "Marshall, MN", "datePosted": "2022-11-08", "link": "https://www.linkedin.com/jobs/view/systems-developer-at-ralco-3385236440?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=dHs%2BIgrPdbdc1UwkNTeu8Q%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Company Overview Ralco is a science and technology company that provides the agriculture and aquaculture industries with natural technologies that help create safe and abundant food. It is our mission to perfect technologies that naturally create an abundant global food supply. We carry out our mission through applied science and research that enhance practical natural technologies for the agriculture and aquaculture industries. In a world filled with technology that people mistrust, creative thinking has driven Ralco to provide trusted alternatives. Our technologies come to life through products in our Ralco brands: Ralco Nutrition, Strong Animals®, Agnition®, trū® Shrimp and Ralco Show.  OUR MISSION:  Steward our God-given gifts to perfect technologies that enhance the vitality of plants and animals for a safe and abundant food supply.  OUR VALUES:  We do what is right We serve others and help them succeed We believe in hard work and a commitment to family We treat others with dignity and respect JOB SUMMARY: As Systems Developer, you are charged with utilizing technology to solve complex business problems that will increase sales, improve our customers experience, increase efficiencies, and help differentiate us from our competitors. You must possess a blend of business and technical savvy; a big-picture vision, and the drive to make that vision a reality. You must be a seasoned developer who understands technology broadly, loves to learn new technologies and enjoys new technical challenges. You must be able to communicate well with the broader IT team and provide technical leadership as you help us translate business strategy into systems to support that strategy. KEY WORK DUTIES AND REQUIRED SKILLS: Design and development of new systems as well as maintenance and enhancement of existing systems.  Implementation, testing, debugging and deployment of software systems. Work with business analyst, external technical resources and end-users as required for design and implementation of new systems and trouble-shooting problems with existing systems. Serving as team lead on projects and. Ensure productivity of end-users through their use of software and computer systems and related support. Ensure our systems are reliable and secure to meet our growing business needs.  Measuring and tracking performance of systems and preparing reports to keep management informed of needs and risks. Mentoring and supporting more junior members of the systems development staff. Proactively learn and utilize new technologies, concepts and procedures as appropriate to ensure we are staying current with technology advancements. Other duties as assigned. JOB REQUIREMENTS:  Education:   Undergraduate degree in computer science, management information systems or related field required.  Experience:  5+ years development experience preferred, including .NET using C# and web services.  Physical:   The following activities are required as needed to perform the job function: lifting, driving, bending, climbing, carrying and twisting. Confined space entry is not a required job function. Reasonable accommodations may be made to enable individuals with disabilities to perform the key work duties.  Travel:   This position requires minimal travel to customer and non-customer sites.  Location:   This position will be based in the Ralco Headquarters in Marshall, MN. Benefits Competitive pay based on previous experience. All existing benefits available to full time Ralco employees as outlined in the handbook: Health Insurance Life Insurance Ralco 401 K Plan Paid Holidays Paid Vacation/Sick Days Powered by JazzHR K3e5nyuNIc\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Internet Publishing"},
{"programName": "Software Engineering Systems", "title": "Systems Engineer", "jobId": "3380821988", "companyName": "Qrypt", "location": "Germantown, MD", "datePosted": "2022-11-30", "link": "https://www.linkedin.com/jobs/view/systems-engineer-at-qrypt-3380821988?refId=JrSovwAwbfE3GnnKxl8Z4g%3D%3D&trackingId=vHK33LcNFc%2BLdfc5dZ%2BLgg%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Qrypt builds quantum-secure encryption software and hardware in partnership with world-class national laboratories and academic institutions. We value protecting individual privacy and being transparent about the technology we use to enable it. The foundation of Qrypt technology is published by our experts in peer-reviewed scientific journals and supported by a growing portfolio of international patents. Qrypt’s product portfolio builds on these technologies to ensure enduring data security in the quantum age. Qrypt is looking for a  Systems Engineer  to join our growing team. The Systems Engineer will own the deployment, configuration, management, and monitoring of Qrypt's hardware infrastructure (servers, networking, power, and support). They will work with the Qrypt hardware and software team to translate product requirements into deployed infrastructure. This position is in Germantown, MD. Responsibilities Installing, configuring, testing, and maintaining operating systems, application software and system management tools Monitor deployed hardware and perform first-line triage and troubleshooting Develop a deep understanding of the system to be able to identify and resolve issues Identify hardware (server, networking, firewall, etc.) needs based on product team requirements (number of users, random generation, etc.) Develop and carry out processes to translate product requirements/system level requirements into actionable plans to identify, purchase, configure/assemble, and deploy required hardware Qualifications Bachelor’s degree in a technical field (Math, Physics, Engineering) and/or relevant work experience Expertise in the installation, upgrade, configuration, and performance tuning of Linux-based servers Understanding of networking concepts 4+ years of experience as a Systems Engineer, Site Reliability Engineer, Datacenter engineer, or equivalent Experience with configuration of L2 and L3 networking equipment Proficiency with bash and/or Python Strong written and verbal communication skills Ability to lift and carry up to 40 pounds Ability to install servers and networking equipment in a colo/datacenter environment Benefits & Perks Competitive Pay & Equity Paid Time Off Medical, dental & vision plan participation Strong 401K matching program Gym Reimbursement But above all, be part of an amazing team! Together, we’ll make this world a safer place About Qrypt Qrypt’s mission is to protect the world’s data. Ending encryption key transmission, the Qrypt Quantum Security suite hardens security and future-proofs encryption against quantum attacks. Qrypt’s unique technology independently generates one-time pads and symmetric keys at multiple endpoints, so that customers can eliminate key transmissions from critical workflows today. Qrypt's team of engineers, physicists, and cryptographers is committed to creating a new standard in security. Powered by JazzHR DfWjAxH9uw\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"}
]