[
{"programName": "Data Analytics Engineering", "title": "Associate, Content Analytics & Operations", "jobId": "3356615002", "companyName": "Netflix", "location": "Los Angeles, CA", "datePosted": "2022-11-16", "link": "https://www.linkedin.com/jobs/view/associate-content-analytics-operations-at-netflix-3356615002?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=szLsV64k58Ez9f48cW0Ypw%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Netflix is the world's leading streaming entertainment service with 221 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. As Netflix continues to grow globally, we are looking for the best and brightest to drive analytics that underpin our content strategy and key business decisions. Netflix’s Content Analytics & Operations team is looking for an Associate to join its team in its Hollywood office. The Content Analytics & Operations team is part of the broader Content Strategy & Analytics team. We drive the vision and business strategy that provides Netflix with best-in-class metrics, tools, analysis, insights and reporting to make effective content performance and programming decisions. We partner closely with our Data Science & Engineering teams as well as Content and Content Strategy & Analysis leadership to do so. This role is based in our Hollywood, California office with a hybrid work schedule (Tues-Thurs in-office).  Responsibilities Innovating and developing content performance metrics, frameworks, and insights Analyzing programming investment and performance to develop short- and long-term content planning Guiding Netflix’s content launch strategy and deepening understanding of title audiences Setting the strategy and structure for external data sharing Spearheading special projects for senior Netflix leaders and developing recommendations on key strategic issues Executing market research and competitive trends analysis Streamlining and managing key analytical operations and reporting Partnering closely with Data Science & Engineering across these efforts Embrace and embody our Culture Netflix is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. The ideal candidate would be prepared to regularly \"roll up their sleeves\" to perform more routine tasks the same day that they are asked to prepare a presentation to the executives of the company Qualifications 1.5-3 years of work experience, ideally in investment banking or management consulting Passion for Content / Entertainment  Experience conducting quantitative analysis (including modeling) and qualitative analysis and can drive to insight and results using data Excellent communication/presentation skills with a track record of presenting complex analyses to executives/senior management clearly and concisely Strong initiative and ability to work independently, thrive in a fast-paced, always-changing environment Highly intellectually curious and has the courage to challenge the status quo and exhibits the highest personal and professional standards of integrity and ethics Excellent proficiency with MS Excel / PowerPoint \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Management and Manufacturing", "industry": "Movies, Videos, and Sound, Technology, Information and Internet, and Entertainment Providers"},
{"programName": "Data Analytics Engineering", "title": "Principal Analyst, Data Science & Analytics", "jobId": "3311157304", "companyName": "Zillow", "location": "United States", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/principal-analyst-data-science-analytics-at-zillow-3311157304?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=8UIkRjuyZwgiwYR%2FOXFYpw%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "About The Team The Zillow Analytics organization is passionate about understanding the customer journey on our platforms through deep analysis and measurement. We relentlessly advocate for a seamless and delightful home shopping experience from dream to reality! The team works closely across the organization to discover strategic opportunities in areas spanning the search and discovery process, membership and re-engagement, evaluation and curation of potential homes, and personalization for both the Zillow and Trulia brands. We scale this work by partnering with engineering teams to build and maintain key analytics tools and infrastructure. About The Role Zillow is looking for Principal Analyst to join a growing world-class analytics group dedicated to excellence. In this role you will: Lead analytical efforts across the organization. Define, measure, and report on success metrics for complex projects and pilots. Use data to identify large opportunities for product and operational improvements. Partner with product, marketing, and operations leaders across the organization to deliver impactful solutions to business problems. Partner with customers to understand and clarify requirements to creatively solve complex business problems with analytic solutions. Recruit, hire, and mentor extraordinary analysts and data scientists. In Colorado, Connecticut, Nevada and New York City the standard base pay range for this role is $153,200.00 - $244,800.00 Annually. This base pay range is specific to Colorado, Connecticut, Nevada and New York City and may not be applicable to other locations. In addition to a competitive base salary this position is also eligible for equity awards based on factors such as experience, performance and location. Actual amounts will vary depending on experience, performance and location. Who you are 8-10 years experience in an analytical role. 3-4 years of experience communicating regularly with executive stakeholders. Strong bias for action and impact informed by your data insights. Ability to design and communicate your analytical roadmap to peers and stakeholders. Strong business acumen, communication skills and the ability to work cross-functionally and connect customer problems to business strategy. Expert at applying the “80/20” rule and estimating the impact and relative priority of a potential analysis project. Deep, intuitive understanding of core statistical concepts, such as probability, randomness, correlation and sampling distributions. Expert in SQL, Excel, and either Tableau, Mode, or other visualization software. Scripting and automation experience is preferred. Experience leading self and mentoring junior data analysts and/or data scientists. Get to know us Zillow is reimagining real estate to make it easier to unlock life’s next chapter. As the most-visited real estate website in the United States, Zillow® and its affiliates help movers find and win their home through digital solutions, first class partners, and easier buying, selling, financing and renting experiences. Millions of people visit Zillow Group sites every month to start their home search, and now they can rely on Zillow to help make it easier to move. The work we do is helping people move from dreaming to transacting — and no matter what job you're in, you will play a critical role in making this vision a reality. Our efforts to streamline the real estate transaction are supported by a deep-rooted culture of innovation, our passion to redefine the employee experience, a fundamental commitment to Equity and Belonging, and  world-class benefits . We’re also setting the standard for work experiences of the future, where our employees are supported in doing their best work and living a flexible, well-balanced life. But don’t just take our word for it. Read recent reviews on  Glassdoor  and recent recognition from multiple organizations, including: the 100 Best Companies to Work For in 2022 list, Glassdoor Employees’ Choice Award, honoring the  Best Places to Work  in 2022, Bloomberg Gender-Equality Index 2022, Human Rights Campaign (HRC) Corporate Equity Index and Best Place to Work for LGBTQ Equality 2022, and TIME  100 Most Influential Companies  list. Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please contact us at RecruitingAccessibility@zillowgroup.com. Applicants who receive job offers from Zillow Group will be asked to sign a Proprietary Rights Agreement which includes confidentiality, intellectual property assignment, customer and employee non-solicitation, and non-competition provisions. If you are contacted for a role at Zillow Group and wish to review a copy of the Proprietary Rights Agreement prior to receiving an offer, you may request a copy from your Recruiter. See What Information We Collect About You. ]]>\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Science", "industry": "Software Development"},
{"programName": "Data Analytics Engineering", "title": "VP, Data Analytics", "jobId": "3339080809", "companyName": "TechInsights", "location": "Denver, CO", "datePosted": "2022-11-01", "link": "https://www.linkedin.com/jobs/view/vp-data-analytics-at-techinsights-3339080809?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=Ph7xgm%2FOPjEfQ7%2FaiW4mQA%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "OUR STORY TechInsights is the world’s most trusted and authoritative source of actionable intelligence on innovation in the semiconductor and microelectronics industry. Our clients include the largest and most successful technology companies who rely on our content platform to make the most informed business and engineering decisions faster and with greater confidence. Our platform is based on continuous analysis of the most innovative devices in the industry using state-of-the-art reverse engineering facilities and expert curation by specialized subject matter experts. As part of our recruitment process, we strongly encourage every applicant to explore our TechInsights Platform by creating a free trial account. TechInsights is headquartered in Ottawa, Canada, with operations in the US (Denver, San Jose), Poland, Japan, Taiwan, South Korea, China, and England. Our customers are some of the largest blue-chip companies in the world. We have successfully integrated four acquisitions in the last 12 months, with the ambition to double our business through acquisition and organic growth over the next 12 to 24 months. THE OPPORTUNITY: Reporting to the CFO (with daily interaction with the CEO and the rest of the C-Suite), the VP of Data and Analytics plays a central role in understanding the business, ensuring data is at the center of everything TechInsights does, identifying problems and facilitating solutions through the application of data analytics. The VP of data and analytics will inherit a team dispersed across various departments (Finance, Sales and Marketing, People, Platform and each of the business units) and coordinate delivery and analysis of day to day data such as tracking marketing effectiveness, sales pipelines, close rates, retention rates, staff utilization, diversity, recruitment effectiveness, price trends, product performance, active users in the platform, types of content viewed, serviceable and total addressable market etc. WHAT YOU WILL DO: The key deliverable will be the establishment and continuous improvement of day to day running and tracking of KPI’s across the entire business, identifying insights and recommendations to drive the company and achieve our ambitious growth plan and to ensure that we deliver on our vision to build the authoritative information platform for the semiconductor industry. Ownership of all data within the company, including quality, cleanliness, all data reporting (for avoidance of doubt, not financial reporting) Ensure that the organization has data at the heart of everything it does and drives every decision, tracking marketing effectiveness, sales pipelines, close rates, retention rates, staff utilization, diversity, recruitment effectiveness, price trends, product performance, active users in the platform, types of content viewed, serviceable and total addressable market etc. Manage a high performing team of analysts across business functions ((Finance, Sales and Marketing, People, Platform and each of the business units) Gather information, normalize data and identify, resolve and to the extent required, fix data quality deficiencies Ownership of reporting dashboards Ownership of Due Diligence and exposure to private equity board and transactions Drives team to ensure clear documentation of data sources and output Defines and industrializing metrics and KPIs Communicates insights to key stakeholders by presenting findings in a clear, concise and initiative way to ensure maximum value  Prepares strategic recommendations for process adjustments and performance improvements Gathers information; understands and analyzes business problems Initiates and participates in the development of data and reporting policies and procedures WHO YOU ARE: The successful candidate will be comfortable in understanding and manipulating varying significant data sets from multiple sources and will also input into and drive the cleanliness of data and reporting, identifying issues through analytical review of output and fixing upstream data issues in systems such as Salesforce, NetSuite, HRIS system, TechInsights Platform. The candidate will also be able to understand the background to reporting requirements, document the process for delivering and analytically review the quality of the output. Post-secondary education in accounting, finance, mathematics, statistics, economics, or related discipline Experience at consulting companies such as Bain, McKinsey, Accenture, E&Y, PwC etc. or within private equity analysing large data sets for trends as part of go to market consulting projects or acquisition due diligence validating Total Addressable Markets and historical performance of metrics like retention rates, drivers of growth etc. Proven skills in data analysis, data models Ability to analyze large data sets and write comprehensive reports Strong verbal and written communication skills Critical thinking abilities, strong analytical skills and inclination for problem solving Persistent attention to detail Ability to maintain confidential information  Strong data analysis capabilities with knowledge of business intelligence tools such as Tableau Advanced data manipulation tools, and Excel skills WHY WORK WITH US: Competitive pay and generous benefits (medical, dental, vision, wellness, RRSP/401K Matching) Flexible work arrangement Flexible vacation policy Annual fitness reimbursement Strong sense of camaraderie, mutual respect and shared goals among colleagues Support for community through charitable alliances Professional and career development opportunities Wellness resources and support from management Salary range: USD $200k - $245k Technology knows no bounds, and neither does TechInsights. Bringing together talented humans from different perspectives, backgrounds and abilities is something we take seriously. We’re committed to building an inclusive environment that welcomes you to be your authentic self and allows us to push past the boundaries together. TechInsights is committed to meeting the needs of people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. As part of any recruitment process, TechInsights collects and processes personal data relating to job applicants. We are committed to being transparent about how we collect and use that data and to meeting our data protection obligations. Our Privacy policy can be referenced here: https://www.techinsights.com/privacy-policy Powered by JazzHR sqqp4PGqWB\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Director", "employmentType": "Full-time", "jobFunction": "Business Development and Sales", "industry": "Internet Publishing"},
{"programName": "Data Analytics Engineering", "title": "Vice President – Data Science & Analytics", "jobId": "3219049068", "companyName": "H&R Block", "location": "United States", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/vice-president-%E2%80%93-data-science-analytics-at-h-r-block-3219049068?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=M0BRzgbVln1LvuOPbS3GGg%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "What You'll Do... H&R Block is seeking a Vice President – Data Science & Analytics. Most of the team resides in Kansas City but the company is open to the position working remote. H&R Block, Inc. (NYSE: HRB) provides help and inspires confidence in its clients and communities everywhere through global tax preparation services, financial products, and small business solutions. The company blends digital innovation with human expertise and care as it helps people get the best outcome at tax time and also be better with money using its mobile banking app, Spruce. Through Block Advisors and Wave, the company helps small-business owners thrive with innovative products like Wave Money, a mobile-first, small-business bank account and bookkeeping solution, that manages bookkeeping automatically. We are amidst a transformation journey and focused on the future with a forward-thinking, innovative culture that is led by a leadership team focused on delivering for our customers, communities, associates, and for our shareholders. We are focused on leveraging our robust data and as the VP of Data Science & Analytics, you’ll lead the company’s efforts in building a data-driven culture to deliver strategic initiatives. You’ll leverage a rich data-set to improve customer experiences and drive profitable growth. You’ll evolve our capabilities to move from reporting results to predicting outcomes that enable business transformation. You'll lead a nimble team that uses machine learning and predictive analytics to partner with product, marketing, & operations to drive growth and further efficiencies. You'll be expected to think strategically, effectively communicate and collaborate with other teams, as well as possess the technical skills to deliver sophisticated projects from concept to production. You will: Act as the champion of analytics to build a data-driven culture throughout the entire organization Be a technical leader and mentor for the data science and analytics team, focusing on continuous learning and process enhancement Work with the leadership team in establishing a long-term vision for the company while building out a roadmap of data science development and applications Enhance enterprise reporting capabilities leveraging a BI data visualization platform Conceive, develop, implement, and continually improve machine learning projects Use data insights to challenge the status quo and inform strategic decisions Work with business leaders to determine strategic direction for pricing of core services Partner with IT to assess and implement best-in-class capabilities for data structures, governance processes and analytics tools Communicate insights and business performance with the leadership team and other colleagues Lead a data science team of approximately 50 associates What You'll Bring To The Team... 10+ years of experience managing a team of data scientists Experience in analytics applications including machine learning, R, Python, Adobe Experience with BI data visual platforms Excellent communication and presentation skills Master’s degree in Computer Science, Statistics, Engineering, or a related quantitative field; MBA or PhD preferred About H&R Block... H&R Block’s purpose is simple: To provide help and inspire confidence in our clients and communities everywhere. We’ve been true to that purpose since brothers Henry and Richard Bloch founded our company in 1955. Since then, we’ve grown to have approximately 12,000 offices throughout the United States and around the world. We are a people company first and a tax company second. People who join H&R Block say it feels like being part of something bigger. A place with an amazing and storied history, but with a strong and urgent focus on the future. Maybe it’s how determined, forward thinking and innovative we are, or how accessible our leadership is. We believe it’s all those things, and much more. H&R Block is committed to diversity and inclusion and is proud to be an equal opportunity employer. We consider qualified applicants regardless of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. All qualified applicants are welcomed and encouraged to apply. Sponsored Job #hrbjob \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Research", "industry": "Financial Services and Retail"},
{"programName": "Data Analytics Engineering", "title": "VP, Data Analytics", "jobId": "3343511133", "companyName": "Propio Language Services", "location": "Overland Park, KS", "datePosted": "2022-11-08", "link": "https://www.linkedin.com/jobs/view/vp-data-analytics-at-propio-language-services-3343511133?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=QNdGajodibeQxy2LrwyNSA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "At  Propio Language Services  we are closing the language gap by connecting people anywhere and anytime through innovative technology and solutions. Propio  provides critical interpreting and translation services that improve the quality of life with the communities we engage.Propio believes language changes the map of how people see the world. If you agree, want to make an immediate impact and help us change the world, we want to talk to you. Propio  is hiring a  VP, Data Analytics  and looking for an innovative leader that will leverage the current state of data (and its utilization) to design an analytics platform to continuously inform and forecast the needs of Propio business units as growth continues. What you will be doing Leading ambiguous and undefined problems to resolution in the face of uncertainty.  Lead and hire exceptional talent in data architecture and engineering disciplines. Coaching, develop and mentor engineers, cultivating pragmatic engineering decision-making, and leveraging your technical expertise to constantly raise the bar. Work backwards from intra- and inter-organizational Customers to develop creative and informative solutions to solve data needs via existing and new service offerings Capable of presenting to executive leadership with data integrity and informative dashboards and reports to increase company efficiency Create a Data Analytics roadmap which balances best practices in Data Engineering with tactical and strategic business initiatives. Be an effective collaborator in a cross functional across the Technology and Business Units Other duties as assigned. What you Need to Succeed Bachelor’s Degree in engineering preferably in Computer Science (or related discipline) Experience building and managing local and remote engineering teams (and managing managers)  Proficiency in data modeling, warehousing and ETL/ELT development Experience with multiple scripting (Python, Typescript) and database platforms (MS SQL, Postgres, MySQL, etc.) Knowledge and deliver of securing protected data in transactional and reporting databases. Strong verbal/written communication and inter-personal skills Ability to handle multiple competing priorities in a fast-paced environment Preferred Qualifications Expert in AWS technologies, including Lambda, Kinesis, RDS and Redshift Experience in leveraging audio and video streams as data sources for cleansing, analyzing and reporting. DIVERSITY STATEMENT Diversity creates a healthier atmosphere: Propio is an Equal Employment Opportunity/Affirmative Action employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. All applicants must be able to complete pre-employment onboarding requirements (if selected) which may include any/all of the following: criminal background check, education, and employment verification. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Business Development and Sales", "industry": "Translation and Localization"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3347496049", "companyName": "akdm", "location": "New York City Metropolitan Area", "datePosted": "2022-11-07", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-akdm-3347496049?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=A%2B3oMfP2PKpoPs4WPk2lzQ%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Who We Are: AKDM is a leader in delivering digital growth strategies guided by data, analytics, and business intelligence. We work with a range of clients — spanning niche players to industry leaders across e-commerce, financial services, travel, entertainment, and consumer packaged goods. Inclusivity for our teams is a priority. From DEI training to volunteering, we are on a journey to connect our business goals with values by promoting a culture of equity and access. We are actively seeking candidates that bring diverse perspectives to our team and work with us to build better, more inclusive approaches to work and collaboration. About the Role: As an Analytics Engineer, you will be on a mission to help develop a single unified view of AKDM’s data and speed up the cycle of insight. With a broad knowledge of the digital marketing analytics space from current industry trends to technical platform expertise, you will provide the opportunity for deeper client experiences and improving AKDM’s organizational growth. You will work with your counterparts across the Media, SEO, S&I, BI, Finance, and Customer Success teams to empower AKDM’s clients with a data-driven culture of measurement. This role would collaborate with data engineers to automate reporting systems and with solution engineers to deploy reusable data structures. The ideal candidate would be highly adaptable to new areas of domain knowledge and would apply thought beyond technical requirements into business use cases and analysis.  The salary range for the Data Analytics Engineer position is between $100,000 and $110,000. The actual annual salary is dependent upon many factors, such as the individual's experience, knowledge, skills, and qualifications.  Responsibilities: Take charge of the OAuth and API work to integrate various third party data sources in various formats. Build the infrastructure for optimal extraction, transformation and loading data from a wide variety of data sources using big data technologies.  You’ll collaborate with agency counterparts to define metrics for web, marketing, app, and operational-related initiatives; you'll work with the data engineer in modeling and maintaining KPIs. You’ll own the development of metrics, data models and the underlying ETL/ELT pipeline that powers the dashboards and reporting designed by our agency counterparts, which in turn supports strategic decision-making by leadership. Work with the data engineer to automate, design, build, deploy, and optimize the data architecture and estimated time to launch pipelines to make accessible for end users that enable self-service consumption. You’ll act as both the technical and business expert to help streamline decision-making between our data engineering team, and core business services, including media, SEO and business intelligence. You’ll identify and debug issues with core metrics, and coordinate with fellow Analytics team members and stakeholders to utilize one source-of-truth. Develop and communicate strong opinions about best practices in Analytics Engineering. Strong drive to organize and document data and best practice in a reproducible manner. Develop batch audits of data ingestion, data pipeline, and data resource systems for availability, maintenance, reusability, performance, scalability, security, standardization, etc. to refine the end-to-end architecture. Competencies: 2+ years experience working in analytical capacity modeling and/or interpreting data (i.e., data analyst, data science, data engineer, consultant). Degree in Computer Science, Math, Statistics, Engineering, Economics, Information Systems, or hands-on job experience with data science or analytics.  Experience using data integration software such as Adverity, Fivetran or Stitch. Experience communicating with third party endpoints for data extraction. Highly skilled at writing and interpreting complex SQL queries. Experience with modern data stacks (Big Query, Microsoft SQL Server, Google Cloud Functions, ETL tools such as Airflow, dbt, etc). Working knowledge of a scripting language for data processing (e.g. Python). Ability to precisely and effectively communicate technical challenges and limitations, and the results of your analyses directly to both technical and non-technical stakeholders. Underlying understanding of databases and data structures Possess an intuition for understanding underlying business needs and a knack for dealing with ambiguity. Nice to Haves: Experience building dashboards with a data visualization tools (e.g. Tableau, Looker) Experience working with marketing (Google Ads, Facebook Ads, etc) platforms and data, or have worked on measuring sales performance indicators. Prior experience in Marketing Focused Roles, Analytics Consulting, or a Growth Stage company Ready to be part of a tight-knit, growing team; ambitious, can work independently as well as collaboratively and possess interpersonal skills What We Provide : 100% Health, Dental, and Vision Coverage: We pay the monthly premium for all employees and cover 70% for spouses, partner, and dependents 3% Non-Elective 401k Match: We contribute to your retirement even if you choose not to Unlimited Vacation. On average, AKDM employees take 20+ days of vacation and we encourage each other to take time off as needed Unlimited Sick Days: We want our team to stay healthy and stay home when they need to Holidays: We observe all major holidays and encourage our employees to celebrate their cultural and ethnic traditions without having to take PTO Paid Parental Leave: We provide 12 weeks paid leave for primary and secondary caregivers plus flexibility in case more time is needed Mentorship Program: Mentees receive one-on-one support from the leadership team to receive practical advice and guidance in developing future career goals Flexible work from home policy What We Value:  At AKDM we believe diversity is essential to crafting digital strategies. We're proud to be an equal opportunity employer committed to diversity and inclusion. We do not discriminate on the basis of race, gender, ethnicity, citizenship, national origin of employees, religion, sexual orientation, age, marital status, disability, veteran status or any other legally protected status. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology, Engineering, and Analyst", "industry": "Advertising Services"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Associate", "jobId": "3369749727", "companyName": "First Help Financial", "location": "Needham, MA", "datePosted": "2022-11-21", "link": "https://www.linkedin.com/jobs/view/data-analytics-associate-at-first-help-financial-3369749727?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=CMyqa5YEc5w1C%2FAmr5RHww%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "First Help Financial  is one of the fastest growing and most diverse companies in the U.S. We provide auto loans to the underserved and care for our customers and partners with exceptional service. Through flexible financing options and tri-lingual support, we offer consumers an easier way to finance their first car. We lend to and support our portfolio which has consistently grown 40% each year over the last five years. Are you a data science professional that enjoys statistical modeling? Here you will find hard-working colleagues that come from over 20 countries. We hold ourselves to the highest standards of professionalism but also enjoy our work. Our culture and benefits are geared towards making you successful in life and comfortable at work. Your Title:  Data Analytics Associate Your Location:  Remote/ Anywhere in the US You Report To:  Senior Manager, Data Analytics Compensation:  $60,000+ plus bonus! About the Opportunity: First Help Financial, voted and certified as a “Great Place to Work” by our workforce for two years in a row, is adding a new partner to our Data Analytics and Strategy department to accommodate our remarkable growth! The Data Analytics role will work closely with the CEO and other C-level execs to play a pivotal role in growing the company. You will see the challenges and opportunities of building a company through technology and data and use internal and external data to influence decision making. As part of a very small team focused exclusively on Strategy & Analytics, you will see everything that it takes to grow a business. Portfolio Analytics  Design and develop analytical infrastructure to monitor portfolio performance including KPI dashboards, reports and other tools.  Derive analytical insights from portfolio data and evaluate risk profile trends.  Develop pricing models to evaluate and price bulk portfolios for purchase  Conduct analysis on impact on portfolio due to changes in the macroeconomic factors and make business recommendations Operations Analytics  Develop metrics to monitor and improve collector effectiveness along several key Servicing dimensions  Formulate actionable tasks to lower delinquency rates, losses and roll-rates  Ideate and innovate superior collection strategies to increase the effectiveness and efficiency of collector activities  Champion operational process improvements to leverage technology & analytical tools as appropriate. Standardize & automate reports generation. Cross-functional  Partner with Servicing Operations team to leverage analytics to develop superior operational processes  Partner with Technology team for evaluation and roll out of cutting-edge innovation in financial technology.  Coordinate with Risk team to refine existing underwriting models and build newer risk models  Support C-level executives with ad hoc analyses to address specific business problems. Provide operational support to Servicing team as required What you bring:  Bachelor’s degree in Finance, Statistics, Mathematics, Engineering or similar is required  2+ years experience as a Data Scientist/Statistical Modeling  Advanced expertise in Microsoft Excel and Microsoft PowerPoint  Strong written communication skills, with an ability to create clear and concise communication  Strong oral communication skills, with experience in presenting to mid-senior management  Basic exposure to translating a business problem into a structured analysis. Experience in analyzing large and complex data sets  Experience in business analytics and data-based decision making  Experience with a data scripting language (Python, SAS, R)  Experience with SQL or relational databases (Candidate will be trained on harnessing big data using SQL queries for analytics) Differentiating Factors:  Masters in a highly quantitative discipline such as Statistics is preferred  2+ years experience in a consulting capacity  Experience with VBA for Excel  Experience with machine learning principals such as AB testing, association analysis, clustering, decision trees, neural networks, principal component analysis, regression, etc. FHF Benefits: Great Perks – We offer generous salaries, competitive health and welfare benefits, paid vacation, 401(k) match, tuition reimbursement, quarterly social outings, monthly lunches, a robust employee recognition, and training development program to enhance your career with us. Culture - We are believers in maintaining a healthy work-life balance. While we work hard and care deeply about our customers and partners, we want you to have room for your family, friends, and yourself. Growth - Company growth provides unprecedented career growth. FHF’s extraordinary year over year growth in revenue and new markets provides opportunity for you to establish and develop your career growth. We engage each employee to build a career plan that benefits everyone, and we have a proven record of investing in you. Diversity and Inclusion: FHF is committed to building a culture that respects and embraces all walks of life, inclusive of all genders, race, culture, age, sexual orientation, and other identities. We will make accommodations when interviewing anyone with special needs. Keywords: Data Science, Data Scientist, Statistical Modeling\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Associate", "employmentType": "Full-time", "jobFunction": "Analyst", "industry": "Technology, Information and Internet"},
{"programName": "Data Analytics Engineering", "title": "Software Data Engineer - Analytics Engineering", "jobId": "3184476269", "companyName": "Apple", "location": "Seattle, WA", "datePosted": "2022-11-13", "link": "https://www.linkedin.com/jobs/view/software-data-engineer-analytics-engineering-at-apple-3184476269?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=43twedwxlrlJh5b9SO8hsg%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology! These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries!  These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.  Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, forward-thinking, and cross-functional, offering greater exposure to the array of opportunities here.   Key Qualifications   5+ years of programming experience Proven understanding on the following distributed data processing platforms: Spark, Hadoop Solid understanding of HBase, Kafka, Java Map Reduce or Scala Experience developing new algorithms and data structures to process large scale data efficiently Distributed Algorithms to process and mine data, e.g. Map Reduce Algorithm Able to gather multi-functional requirements and translate them into practical engineering tasks Graph, Data classification and clustering algorithms in distributed environment Good debugging, critical thinking, and interpersonal skills Knowledge in engineering machine learning, feature engineering systems is desired Ability to stay focused and prioritize a full workload while achieving extraordinary quality   Description   The Apple Mediate Products Analytics team is responsible for collecting, analyzing, and reporting on customer experience data. From this data we generate insights into how customers interact with our products, and use these insights to drive improvements to user-facing features.   As a member of the Data Engineering team, you will have significant responsibility and influence in shaping its future direction. This role is inherently cross-functional and the ideal candidate will work across disciplines. We are looking for someone with a love for data and ability to iterate quickly on all stages of data pipeline.   This position involves working on a small team to develop large scale data pipelines and analytical solutions using Big Data technologies. Successful candidates will have strong engineering skills and communication, as well as a belief that data driven processes lead to phenomenal products.   Education & Experience   MS or BS degree in Computer Science or a related field Apple is an equal opportunity employer and value diversity at our company. Apple does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.   Role Number: 200403515 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Director of Data & Analytics", "jobId": "3326593193", "companyName": "Lawrence Harvey", "location": "United States", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/director-of-data-analytics-at-lawrence-harvey-3326593193?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=CuycK8wFE%2Fb3LWswhS2xag%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Lawrence Harvey is partnering with a mid-size marketing analytics firm who are building their Data Engineer team and looking for a VP who's looking to take the next step in a more SR role to help them take the next level! In this position, you will lead a small team of Data Engineers to help build out this companies newest data platform to generate insights for various business units. This role reports directly to the CEO Salary: $175-200k + 20% bonus Skills Required: Hands-on data Data Engineering experience Ability to road map and move and be a part of a growing team Track record of mentoring and developing teams of data engineers Ability and willingness to communicate and collaborate with teams across various business units If your a Engineering leader with a passion to grow and develop others, this position is the one for you! Please reach out to me directly via email: j.contreras@lawrenceharvey.com \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Engineering", "industry": "Software Development and Telecommunications"},
{"programName": "Data Analytics Engineering", "title": "VP, Data & Analytics", "jobId": "3333555986", "companyName": "Vuori", "location": "Carlsbad, CA", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/vp-data-analytics-at-vuori-3333555986?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=y4319MGT6kiBZxVEaLULow%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Title:   VP, Data & Analytics Reports to:   Chief Information Officer (CIO) Brand Overview: Vuori is re-defining what athletic apparel looks like: built to move and sweat in but designed with a casual aesthetic to transition into everyday life. Our high energy, fast paced office environment is reflected in the clothes we make. We aim to inspire others to take on all aspects of their lives with clarity, enthusiasm and purpose….while having a lot of fun along the way. We are proud to be an outlet for opportunity of personal growth and success. Role Overview: Vuori is seeking an experienced Data and Analytics leader to join the organization as Vice President, Data and Analytics. Reporting to the CIO, this role will drive the vision, strategy, and creation of a best-in-class Data and Analytics organization that enables Vuori to unlock insights to drive critical operational and strategic decisions across all aspects of our business. This leader will oversee the company’s data and analytics functions with a focus on enhancing capabilities and democratizing data to enable data-driven decisions across all levels of the organization. As the leader of this team, the VP, Data & Analytics will drive the strategy and direction of the Data and Analytics organization while providing exceptional services and solutions to Vuori’s internal and external business partners. They will have the opportunity to shape and deliver world-class analytical capabilities in support of Vuori’s mission. Immediate focus for this role will be on advancing the Data & Analytics team’s capabilities, confirming long-term architectural direction, developing leading-edge solutions, and creating close partnership with business stakeholders. Responsibilities include but are not limited to: Partner with business stakeholders to develop a cohesive vision and prioritized multi-year roadmap to create advanced data and analytics capabilities Collaborate across business units to deliver new and innovated services and solutions that help Vuori to achieve its mission Partner with business leaders to identify, develop, and drive adoption of actionable insights Partner with key business executives to develop and drive a Data Governance framework that enables a common data language and creates trust in enterprise data Continuously innovate the data and analytics platforms and tools architecture to meet current and future needs Build a trusted and highly capable Data & Analytics organization that may include Data Engineers, Architects, Data Analysts, Data Scientists, and Report Designers Ensure the data and analytics frameworks follow best practices for maintainability, recoverability, and high-performance Implement a right-sized SDLC methodology to effectively and efficiently manage change through a complex business and technical environment Strive for operational excellence in all aspects of the Data & Analytics organization - program, process, team and technology Budget oversight and vendor management as appropriate  Educational/ Position Requirements:  12+ years’ experience in the data warehouse, data lake, business intelligence, and the analytics space 7+ years of leading successful Data and Analytics organizations with significant experience in building highly adopted solutions that positively impact the bottom line 7+ years’ experience in team leadership and management 5+ years developing corporate KPI dashboards and reports that drive organizational insight from data Expertise in leveraging analytics for competitive advantage and business enhancement across the enterprise Able to translate business strategy into Data and Analytics vision, drive creation and execution of multi-year roadmap Expertise in data strategy, data architecture, data engineering, advanced analytics, data science, data mining, and machine learning Expertise in defining and evolving Data and Analytics platforms, tools, and solutions architectures in an enterprise environment Expertise in implementing appropriate Data and Analytics SDLC methodologies for controlled and iterative development of high-quality solutions Experience implementing an enterprise-level Data Governance program by partnering across the business and using best-practices to enforce data consistency across the Data and Analytics platforms, tools, and solutions Highly skilled at assembling, leading, and growing high-performing teams in a fast-paced, business-focused environment Experience communicating (both written and verbally) to diverse audiences, specifically delivering compelling presentations and telling the story with action-oriented implications Proven track record implementing highly functional/automated operational and support processes in 24x7 global business environment Exposure to a variety of Data Integration/ETL tools Experience with a variety of BI and Analytics platforms like Power BI, Tableau, DOMO, Looker, PowerBI, Alteryx, and advanced statistical analysis tools like SAS or SSPS Experience with a variety of cloud-based data warehouse/platform offerings like Snowflake, Redshift, Azure Synapse, S3, etc Experience with Big Data and NoSQL technologies Who you are: A change agent who challenges the status quo. Thought leader who stay on top of current and emerging technology trends to discover new and innovative ways to exploit data for strategic advantage Able to effectively drive business, culture and technology change in a dynamic and complex operating environment Results-oriented, detailed, energetic, and focused with a strong desire to learn and succeed. Takes on new opportunities and tough challenges with a sense of urgency, high energy, and enthusiasm. Builds partnerships and works collaboratively across the organization with others to meet shared objectives. Relies on a mixture of analysis, wisdom, experience, and judgment when making decisions. This role is sourced directly by Vuori, Inc, and all communication from our team @vuoriclothing.com. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Information Technology and Product Management", "industry": "Retail Apparel and Fashion, Retail, and Wellness and Fitness Services"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3322741273", "companyName": "Bose Corporation", "location": "Framingham, MA", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-bose-corporation-3322741273?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=YtVOtAP7JQF7vUEjcjLZzQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Bose is about better sound, but better sound is just the beginning. We’re about inventing new technologies that truly benefit people and creating a culture where innovation and teamwork are highly valued. Working at Bose, you’re encouraged to question conventional thinking in the relentless quest to create products and experiences that change people's lives. Data analytics and data science are a crucial part of our mission, fueling the creation of new and innovative products, helping us to bring the right products to the right customers, and allowing us to astonish customers with carefully crafted and personalized experiences. We are looking for a Data Analytics Engineer within our Data and Analytics Center of Excellence. The mission of this team is to develop world-class data science, machine learning, and statistical solutions to extract insights and enable data driven decisions that improve our business and enhance customer experiences. This Data Analytics Engineer role will be critical to help drive analysis, data science, and reporting across many diverse data sets to make sure we deliver impact from our data products and services. This includes working with raw data sets that leads to development of logical and physical data models, data wrangling and design / building of semantic layer that helps to create dashboards and models that drive insights and actions. This work will directly inform and influence multiple division’s strategies. This is a unique opportunity to shape the experiences, technologies, and products that millions of people will use. The ideal candidate has a deep understanding of data modeling, SQL, data warehouses / data lake and data engineering skills. You will often serve as an internal expert about the data, what it means and how it can be used to solve business problems. You can demonstrate that you have experience deeply understanding the data structure and transformations required to develop a semantic layer for data analysts and scientists. We are seeking a highly motivated, detail-oriented engineer who is passionate about data and enabling data-driven decisions. Primary Responsibilities Leverage DBT to mine , analyze, and transform large structured and unstructured datasets, collaborating with analysts, data scientists, and business users to create actionable metrics and datasets that solve business questions.  Provide expertise in query building and data modeling to ensure data is made available in a timely, efficient, and comprehendible means. Help define the strategy and standards for analytical engineering. Help define testing and data quality programs leveraging dbt Cloud Partner with our other teams to ensure documentation, privacy, and best in class coding practices are implemented within Analytical engineering. Act as SME for specific data domains by enabling analytical data sets for ad-hoc analysis  Engage with key stakeholders in the business, product and software teams to clearly understand and scope analytical requests.  Qualifications Extensive background and demonstrated track record in building analytical models in SQL. Strong technical skills, including experience with analytics, query and data visualization tools. Experience with Snowflake, dbt, and Python is preferred. Excellent communication skills, and the ability to explain deep technical results to diverse groups of stakeholders.  A life-long learner who is curious, has a passion for solving hard, ill-defined problems, has comfort taking initiative and who continuously seeks to improve their skills and understanding. Enjoys working in a team environment as well as independently.  Education Bachelor’s or Master’s degree in math, physics, computer science, engineering, business, finance, marketing, economics or related quantitative or computational field  Work Experience 3+ years of related data analytics experience in relevant consulting, finance, data science or market intelligence functions  Previous experience in a consumer electronics environment, particularly in a technical field, is a definite plus  Previous experience with mobile app data is a plus  What's In It For You Be a part of and work with a top notch, multidisciplinary, transparent, and agile team.  Collaborate with people like you who want to solve problems and have fun together.  Work on developing innovative Wellness products that improve people's lives.  Excellent work life balance and a continuous learning environment.  Highly competitive package as well as a comprehensive benefits program.  We strive to help our employees and customers reach their fullest potential.  Compensation for this role for a candidate based in Colorado is expected to be between $101,800 and $130,300 and for a candidate based in NYC to be between $101,800 and $130,300 . Actual pay may be higher or lower depending on geographic locations, skills, experience, and other factors permitted by law. This role is also eligible to receive a bonus, which is not guaranteed and may be based on individual and company performance.  Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing and Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3375106879", "companyName": "TechnologyAdvice", "location": "Nashville, TN", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-technologyadvice-3375106879?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=cg%2FnLLkEmTCKe87edrrVWQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Hi, we're TechnologyAdvice. At TechnologyAdvice, we pride ourselves on helping B2B tech buyers manage the complexity and risk of the buying process. We are a trusted source of information for tech buyers, delivering advice and facilitating connections between our buyers and the world's leading sellers of business technology. Headquartered in Nashville, Tennessee, we are a remote-first company with more than 20 digital publications and over 500 global team members in the US, UK, Singapore, and Australia. We're proud to have been repeatedly recognized as one of America's fastest growing private companies by Inc., as well as a Tennessee top workplace. We work hard each day and have fun, too, with monthly virtual events, recreational slack channels, and the occasional costumed dance from our CEO. All positions are open to remote work unless otherwise specified in the requirements below. The opportunity We are looking for an  Data  Analytics Engineer  to be a part of our Business Intelligence team! You will work closely with our Data Analysts, Revenue Ops, Dev Ops, and Product teams to build, manage, and optimize the systems and processes that collect, manage, and transform our data into information for our teams to analyze and feed into other systems. What You'll Do Create, maintain, and optimize data pipelines and pipeline architecture Assemble and transform large, complex data into data sets that meet our business needs Create data validation and quality assurance methods Build processes supporting data transformation, data structures, dependencies, and workload management Work with Business Stakeholders and the Business Intelligence team to support data infrastructure needs Identify opportunities and implement strategies to scale and optimize our data operations Who You Are Advanced working knowledge of SQL Experience working with large relational databases Working experience with AWS Redshift preferred and bonus points for Google BigQuery  Working experience with dbt Working experience with ETL tools, Fivetran preferred Experience with scripting languages: Python, Scala, etc.  Experience with Tableau is preferred What We Offer You Our benefits and programs are designed to make your life better for you and your family... Flexible schedule with remote, hybrid and on-site options Comprehensive medical, dental and vision insurance 401K with company matching Flexible paid time off Paid maternity and paternity leave Pet insurance for your furry family members and co-workers  Wellness perks that include the Headspace App and monthly fitness reimbursements Ongoing career development opportunities, mentorship program, bucket list benefit, and more In-office snacks, beverages, catered meals, and even some ping pong Beer on Fridays Work authorization Employer work visa sponsorship and support are not provided for this role. Applicants must be currently authorized to work in the United States at hire and must maintain authorization to work in the United States throughout their employment with our company. EOE statement We believe that our differences make us stronger, and thus foster a diverse and inclusive culture where people feel safe being themselves. TechnologyAdvice is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected under federal, state or local law. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Technology, Information and Internet"},
{"programName": "Data Analytics Engineering", "title": "Data Analyst – Analytics and Insights - Data Center of Excellence", "jobId": "3325611699", "companyName": "Bose Corporation", "location": "Framingham, MA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/data-analyst-%E2%80%93-analytics-and-insights-data-center-of-excellence-at-bose-corporation-3325611699?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=sTxeOhV%2FfCZPXsNgRb2XHA%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Job Description Do you love working with data? Would you like to use your Data Analytics skills to solve real world problems and improve people’s lives by analyzing App, product, operational and marketing data? Bose produces innovative products and experiences that improve our customer’s lives. This is a unique opportunity to shape the experiences, technologies, and products that millions of people will use. As part of the CoE team, you will evangelize a data-driven culture throughout the organization and enable products grounded in science and powered by AI which improve our customer’s experience. This Data Analyst role will drive analysis and reporting across many diverse data sets to make sure we deliver impact from our data products and services. This includes identifying and categorizing patterns across product usage, creating user profiles, analysis of review data and creating dashboards and reports that display actionable business metrics. This work will directly inform and influence multiple division’s strategies. The ideal candidate has a deep understanding of data analytics and visualizations, coupled with creativity and business acumen needed to develop insight. Because you will often serve as an internal expert about the data, what it means and how it can be used to solve business problems, you can demonstrate that you have experience deeply understanding the data structure and applying rigorous analytical methods to derive actionable recommendations. We are seeking a highly motivated, detail-oriented analyst who can transform raw data into meaningful insights, providing actionable recommendations. This individual will be part of an extended team. Primary Responsibilities Engage with key stakeholders in the business, product, and software teams to clearly understand and scope analytical requests.  Partner with colleagues working with survey data or online review data to integrate these kinds of data into reporting and analysis to solve business questions.  Support one or more product categories with ad hoc analysis of product and app usage data to support business decisions.  Partner with internal data and systems resources to understand the structure and format of data sources and ensure data integrity and availability to support analytical requirements.  Lead data analysis, synthesize results, and develop and present strategic recommendations for the executive leadership and product teams that inspire action.  Will be responsible for data analytics across multiple apps and products  Creates analytical data sets for ad-hoc analysis  Develops data visualizations and reporting to represent KPI’s  Will be an SME for specific data domains  Mine, analyze, and model large structured and unstructured datasets to create actionable business metrics and solve business questions.  Create custom, targeted reports and dashboards that deliver insights into the current product and app usage and customer response to new features/capabilities or marketing experiments.  Identify data quality issues  Owns data sets and data visualizations they create Assist with PowerBI ecosystem development across the Data and Analytics group Qualifications Strong PowerBI coding, visualization, and customization skills. Certifications a plus. Extensive background and demonstrated track record in obtaining and analyzing quantitative data to solve actual business problems.  Strong technical skills, including experience with analytics, query and data visualization tools. SQL and PowerBI experience a must. Programming languages, e.g. Python is strongly desired. Experience with Snowflake a plus. Excellent communication and presentation skills, and the ability to explain analysis and insights to diverse groups of stakeholders.  A life-long learner who is curious, has a passion for solving hard, ill-defined problems, has comfort taking initiative and who continuously seeks to improve their skills and understanding.  Enjoys working in a team environment as well as independently  Ability to work with teams and stakeholders that are geographically displaced. Education Bachelor’s or Master’s degree in math, physics, computer science, engineering, business, finance, marketing, economics or related quantitative or computational field  Work Experience 4+ years of related data analytics experience in relevant consulting, analytics, market intelligence functions or related business experience Previous analytical experience in a consumer electronics environment is a definite plus Previous experience with analyzing app and product data is a plus  What's In It For You Be a part of and work with a top notch, multidisciplinary, transparent, and agile team.  Collaborate with people like you who want to solve problems and have fun together.  Excellent work life balance and a continuous learning environment.  Highly competitive package as well as a comprehensive benefits program.  We strive to help our employees and customers reach their fullest potential. Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing and Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analyst, Process and Analytics", "jobId": "3358596761", "companyName": "Tesla", "location": "Fremont, CA", "datePosted": "2022-10-22", "link": "https://www.linkedin.com/jobs/view/data-analyst-process-and-analytics-at-tesla-3358596761?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=UCW10SBlrEipQQnKvsKs5g%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "What to Expect  The Material Planning group in Supply Chain is responsible for the reliable and efficient flow of all production materials to Tesla’s factories and Service locations. As Data Analyst in the Process and Analytics team, you will deliver data insights that are critical in order to support increasing production volume and fleet size. You will work with the planning team and stakeholders in other organizations to define business requirements for reporting and formulate applicable data-driven solutions. This requires you to acquire subject matter knowledge about the Material Planning process, systems and KPIs. It is essential that you can think strategically, connecting the dots in the bigger picture, as well as being comfortable in the details of the deliverables. To be a successful candidate for this role you have to be a self-motivated for data analytics and continuously demonstrates an ability to tackle complex problems and implement solutions.  What You’ll Do Define key performance indicators to track process operational performance and apply data mining, analysis and visualization for KPI reporting  Identify, analyze, and interpret trends or patterns in complex data sets  Create reports and data visualizations to guide decision-making across material planning team  Drive problem solving and continuous improvement initiatives to improve supply chain operations processes  Support management with dashboards, KPIs and ad-hoc analyses  Use data to assess business impact and priorities  Independently handle multiple projects at a time meeting objectives and deadlines  Apply out of the box thinking, problem-solving abilities and operational supply chain experience to derive solutions  Gather and define business requirements Identify process gaps and areas for optimization and automation  Own system requirements, and participate in the software development process from design to user acceptance testing    What You’ll Bring Master’s degree in science or engineering or equivalent experience or evidence of exceptional ability  2+ years’ work experience in material planning, supply chain, manufacturing, or business operations  Evidence of exceptional analytical ability  Structured, data-driven and quantitative problem-solving approach  Ability to query from large data set in SQL, analyze and present data  Proven ability to set expectations, manage to deadlines and hold individuals and teams accountable to critical milestones  Ability to drive strategic discussions and convert strategy to action  Collaborative, flexible, open working style and an ability to establish trust and credibility  Excellent communication and leadership skills  Preferences Programming (R, Python)  Experience creating dashboards using Tableau (or similar) visualization tools \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Renewable Energy Semiconductor Manufacturing, Motor Vehicle Manufacturing, and Utilities"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3322736929", "companyName": "Bose Corporation", "location": "United States", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-bose-corporation-3322736929?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=nxGGbFEiT5etOW5AJDzKlw%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Bose is about better sound, but better sound is just the beginning. We’re about inventing new technologies that truly benefit people and creating a culture where innovation and teamwork are highly valued. Working at Bose, you’re encouraged to question conventional thinking in the relentless quest to create products and experiences that change people's lives. Data analytics and data science are a crucial part of our mission, fueling the creation of new and innovative products, helping us to bring the right products to the right customers, and allowing us to astonish customers with carefully crafted and personalized experiences. We are looking for a Data Analytics Engineer within our Data and Analytics Center of Excellence. The mission of this team is to develop world-class data science, machine learning, and statistical solutions to extract insights and enable data driven decisions that improve our business and enhance customer experiences. This Data Analytics Engineer role will be critical to help drive analysis, data science, and reporting across many diverse data sets to make sure we deliver impact from our data products and services. This includes working with raw data sets that leads to development of logical and physical data models, data wrangling and design / building of semantic layer that helps to create dashboards and models that drive insights and actions. This work will directly inform and influence multiple division’s strategies. This is a unique opportunity to shape the experiences, technologies, and products that millions of people will use. The ideal candidate has a deep understanding of data modeling, SQL, data warehouses / data lake and data engineering skills. You will often serve as an internal expert about the data, what it means and how it can be used to solve business problems. You can demonstrate that you have experience deeply understanding the data structure and transformations required to develop a semantic layer for data analysts and scientists. We are seeking a highly motivated, detail-oriented engineer who is passionate about data and enabling data-driven decisions. Primary Responsibilities Leverage DBT to mine , analyze, and transform large structured and unstructured datasets, collaborating with analysts, data scientists, and business users to create actionable metrics and datasets that solve business questions.  Provide expertise in query building and data modeling to ensure data is made available in a timely, efficient, and comprehendible means. Help define the strategy and standards for analytical engineering. Help define testing and data quality programs leveraging dbt Cloud Partner with our other teams to ensure documentation, privacy, and best in class coding practices are implemented within Analytical engineering. Act as SME for specific data domains by enabling analytical data sets for ad-hoc analysis  Engage with key stakeholders in the business, product and software teams to clearly understand and scope analytical requests.  Qualifications Extensive background and demonstrated track record in building analytical models in SQL. Strong technical skills, including experience with analytics, query and data visualization tools. Experience with Snowflake, dbt, and Python is preferred. Excellent communication skills, and the ability to explain deep technical results to diverse groups of stakeholders.  A life-long learner who is curious, has a passion for solving hard, ill-defined problems, has comfort taking initiative and who continuously seeks to improve their skills and understanding. Enjoys working in a team environment as well as independently.  Education Bachelor’s or Master’s degree in math, physics, computer science, engineering, business, finance, marketing, economics or related quantitative or computational field  Work Experience 3+ years of related data analytics experience in relevant consulting, finance, data science or market intelligence functions  Previous experience in a consumer electronics environment, particularly in a technical field, is a definite plus  Previous experience with mobile app data is a plus  What's In It For You Be a part of and work with a top notch, multidisciplinary, transparent, and agile team.  Collaborate with people like you who want to solve problems and have fun together.  Work on developing innovative Wellness products that improve people's lives.  Excellent work life balance and a continuous learning environment.  Highly competitive package as well as a comprehensive benefits program.  We strive to help our employees and customers reach their fullest potential.  Compensation for this role for a candidate based in Colorado is expected to be between $101,800 and $130,300 and for a candidate based in NYC to be between $101,800 and $130,300 . Actual pay may be higher or lower depending on geographic locations, skills, experience, and other factors permitted by law. This role is also eligible to receive a bonus, which is not guaranteed and may be based on individual and company performance.  Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing and Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Software Engineer", "jobId": "3337052662", "companyName": "Apple", "location": "Cupertino, CA", "datePosted": "2022-11-25", "link": "https://www.linkedin.com/jobs/view/data-analytics-software-engineer-at-apple-3337052662?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=XZo0xXr4%2FSAyC5sHFsB%2FCw%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   The CoreMotion team has created innovative ways for users to improve their health with their devices through motion. When you exercise and move with your devices, it's the work of engineers and scientists on this team. As a member of our dynamic group, you will have the rare and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple's customers every single day. Join our CoreMotion team and enrich lives by shipping software that motivates fitness goals, improves health, and enhances the way customers interact with our products!   Key Qualifications   Proficient at one or more of the following domain: signal processing, sensor fusion, health analytics, statistics, data mining Interest or experience in implementing and supporting highly scalable systems Interest or experience in analyzing and working with large data sets, and proficient at data visualization Proficient at programming in Python for quantitative analysis on large-scale data Experience working with databases (SQL/NoSQL), comfortable with query languages and designing tables, views, indices, familiarity with AWS services/API such as S3 is a plus Experience building iOS App, and with C++ is a plus Experience in job scheduling, and stream processing knowledge with Spark framework is a plus Preferred applied experience with machine learning, and building models on large datasets Continuous learning and improvement mindset, willing to push yourself outside of your comfort zone   Description   In this role, you will be highly involved in driving design data quality and algorithm performance to develop our next generation of Health and Fitness features. This includes evaluating large user study datasets, design reviews, algorithm testing, bug reporting and triaging. Key responsibilities of this role are: Profile, process and evaluate large structured and unstructured motion datasets Challenge the design and implementation in the most logical way; design and perform analytics for algorithm verification and validation Create ETL to automate monitoring of quality assurance metrics to constantly track feature performance Participate and present in user study review, code review, and data review Communicate with upstream component (e.g. Hardware) and downstream component (e.g. App) to drive end to end user experience   Education & Experience   BS, MS, or PhD in Computer Science / Electrical Engineering / Mechanical Engineering or equivalent   Additional Requirements   Passionate about health and fitness technologies   Role Number: 200439659 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3359602983", "companyName": "HHS Technology Group", "location": "Denver, CO", "datePosted": "2022-11-17", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-hhs-technology-group-3359602983?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=zs88JVVa1bqgAcq1JD5kUA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Senior Data AnalyticsEngineer Who we are  HHS Technology Group is a software and solutions company serving the needs of commercial enterprises and government agencies. We create and deliver purpose-built, modular software products, solutions, custom development, and integration services for modernization and operation of systems that support a wide spectrum of business and government needs.  Who we need:  Senior Data Analytics Engineer What we do  HHS Tech Group creates innovative, purpose-built technology products and solutions, resulting in value and positive, quantifiable impact for our clients and the people they serve. Our vision drives the future.  HHS Technology Group is expanding. We create software products relevant to the healthcare insurance domain. Our growth trajectory is fantastic. We are leveraging data science to create healthcare insurance software to identify data trends which would indicate fraud waste and abuse scenarios as well as third party liability, thusly giving the insurance provider an opportunity to recover their funds which may have been paid erroneously. 4-5 years of work experience with ETL Expert-level skills in writing SQL Python and SQL/MongoDBskills are must requirements Experience with Big Data technologies such as Spark Experience with AWS Big Data technologies such as AWS Glue/EMR, S3, AWS Athena Experience with Data warehouses such as Snowflake/Redshift Knowledge on processing of Claims/EMR/EHR/Provider / Member datasets. Experience with  NodeJS, ReactJS, and Go Lang Ability to multi-task, take initiative, assume accountability, work independently and self-manage duties and responsibilities, as well as intuitively having the ability to pivot focus between tasks according to priorities to achieve maximum efficiency. Please find all benefits listed here:  https://hhstechgroup.com/careers/benefits-we-offer/   Fully paid premiums on dental, vision, life insurance, and disability insurance.  Generously sponsored Medical Insurance  Generous 401k matching program (100% match up to 6%)  Open PTO policy  HHS Technology Group creates software products in the healthcare insurance domain. Our software, Discover your Provider (DyP) and Discover your Data (DyD) ensure seamless modernization of monolithic, antiquated systems and leverages data science to give our customers intelligent insight of data trends pertaining to paid insurance claims. HHS Technology Group has become a valued and trusted systems integration partner for several departments within a number of State Governments. HHS Technology Group’s flagship product, Discover your Provider (DyP) is a provider relations/provider enrollment solution. Components of this modular software can be re-purposed or built upon to deliver cloud based technical web services solutions. The intense growth and tremendous financial forecast we are experiencing at HHS Technology Group can largely be attributed to our successes on these initiatives.  EEO Statement  HHS Technology Group is an equal opportunity employer. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Data Analytics Engineering", "title": "Data Science, Product Analytics", "jobId": "3346260792", "companyName": "eBay", "location": "San Jose, CA", "datePosted": "2022-11-26", "link": "https://www.linkedin.com/jobs/view/data-science-product-analytics-at-ebay-3346260792?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=wIsiwod8w202UnNvWwutyg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Looking for a company that inspires passion, courage and creativity, where you can be on the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to crafting an ambitious and inclusive work environment, join eBay – a company you can be proud to be with. About This Role The Global Payments, Billing & Risk (GPBR) function at eBay works to ensure great experiences when buyers and sellers come together and engage in commerce on the biggest marketplace in the world. This involves comprehensively understanding Payments, Billing & Risks on the platform. Identifying the opportunity areas and helping build scalable solutions to drive great user experience. Analytics is critical for a data driven Risk and Identity function. Core analytics capabilities include the ability to instrument critical metrics, identify the landscape of the entire function, figure out opportunities for improvement, work with Product to craft scalable solutions, and monitor their performance. We build this behavioral intelligence by exploring creative interpretations of existing and new sources of data, using advanced analytical techniques, and overlaying the appropriate strategies to deliver exceptional results.We are multi-disciplinary with a broad spectrum of industry experiences and deep analytical and quantitative expertise. We are currently seeking a high energy, driven, collaborative team member who brings extensive problem-solving skills to further the goal of applying cutting-edge risk analytics, insights and visualization to drive the payments roadmap. The role is data and analytically intensive. Successful candidates should be quick learners, strategic thinkers, operational and execution driven facilitators, problem solvers, and have an entrepreneurial spirit. Skills in problem definition, rigorous analysis, and recommendation development will also be critical as well as demonstration of exceptional interpersonal skills, initiative and integrity. Primary Responsibilities Collaborate with business partners to answer key business questions – challenge their thinking and become a trusted business partner. Help the business prioritize analytical deliverables and manage their expectations Perform exploratory analysis of large data sets Derive tactical and strategic insights to improve business strategies and accelerate channel growth Champion and evolve the experimentation approach for all the new payment product launches Demonstrate strong analytical and statistical skills towards taking complex and unstructured business problems, and providing structured, hypothesis-driven and data-supported practical solutions Have strong empirical and analytical background, with demonstrated ability to combine quantitative and qualitative findings in order to frame the right questions and measurable insights Be a lateral problem solver, who constructively challenges the obvious answer in order to examine the underlying mechanism or phenomenon Be comfortable in developing analytics vision and roadmap for the team, and foster innovation through continuous evolution of analytical frameworks and data solutions Skill-set Requirements Bachelor’s degree in Math, Statistics, Engineering, or other quantitative discipline 3+ years of experience in data analytics, data science or related field with a Bachelor's degree Or 2+ years of experience with a Masters degree Strong technical skills in SQL and R/Python Hypothesis testing and experience with experimentation (A/B testing) Strong applied statistical knowledge Good experience with both descriptive and inferential statistics – ability to build basic prototype models In addition to delivering insights on existing Product & Tech initiatives, you will come up with innovative product growth opportunities based on insights, and create momentum through influence Proactive collaboration and effective communication are critical Additionally, The Following Background And Experience Is Preferred Proven track record of turning insights into product growth opportunities in prior roles with increasing scope and responsibilities Ability to present complex analyses and insights effectively in simple terms Background in ecommerce product experience and Identity/Risk domain is a plus Benefits are an essential part of your total compensation for the work you do every day. Whether you’re single, in a growing family, or nearing retirement, eBay offers a variety of comprehensive and competitive benefit programs to meet your needs. Including maternal & paternal leave, paid sabbatical, and plans to help ensure your financial security today and in the years ahead because we know feeling financially secure during your working years and through retirement is important. Here at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn’t just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work. To learn about eBay’s Diversity & Inclusion click here: https://www.ebayinc.com/company/diversity-inclusion/ eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible. View our accessibility info to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. For more information see: EEO is the Law Poster and EEO is the Law Poster Supplement. Jobs posted with location as \"Remote - United States (Excludes CO, HI, NM, NYC)\" excludes residents of Colorado, Hawaii, New Mexico and New York City. This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Internet Marketplace Platforms"},
{"programName": "Data Analytics Engineering", "title": "Data Engineer, Business Intelligence and Analytics", "jobId": "3167605698", "companyName": "SOCi, Inc.", "location": "United States", "datePosted": "2022-11-20", "link": "https://www.linkedin.com/jobs/view/data-engineer-business-intelligence-and-analytics-at-soci-inc-3167605698?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=mO%2BW9z%2Bugqe%2BU4S7zNG1%2BQ%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Data Engineer - Business Intelligence and Analytics We’re looking for a Data Engineer - Business Intelligence and Analytics who will support the build out of the data infrastructure to enable analytics across SOCi. This role will work with business users across Sales, Marketing, Engineering, Customer Success, Product, and Finance to scope out their use cases, build out data solutions and suggest ways to optimize. The role will also work to automate various processes using our ETL solutions and scripting as needed to ensure timely delivery of data and reporting. Responsibilities: Develop and maintain the “source of truth” data environment used by everyone at SOCi Design scale databases optimized for business analytics. Build and manage large, real time data pipelines with monitoring and proactive alerting. Extract and maintain 3rd party data using API calls and other connectors and tools (ie..Fivetran) Develop data models that power predictive recommendations, marketing attribution, financial forecasts, and pipeline analysis to support the decision-making within the organization. Collaborate on a regular basis with the following teams at SOCi: Engineering, Customer Success, Sales, Marketing, and Product Work with a team of data engineers and analysts to build a world-class data environment. Requirements: 4+ years of data or software engineering experience, including expertise in SQL and object-oriented programming languages (Python, Java, or C++) Experience in database design, 3NF, denormalization, or star schema. Experience in managing the deployment of new tools and technologies Experience with Big Data technologies (Snowflake, Redshift, Oracle, Hadoop, Kafka) Familiarity with ETL flows/tools (Airflow, DBT, Stitch, Fivetran, HEVO, etc.) Comfortable with massive amounts of semi-structured data Has knowledge of data engineering best practices (data discovery, data documentation, infrastructure development/deployment, and information security) Bachelors or Masters in Engineering, Math, or data science preferred Self-starter mentality and entrepreneurial spirit with a strong drive for excellence and delivery of results Ability to operate in a lean, fast-paced organization, and to create a vision and organization that can scale quickly About Us: SOCi is one of the fastest growing technology companies in the country, ranking in the top tier of Inc 5000’s Fastest Growing Companies in America list for the last 4 years in a row. The builder of an award-winning enterprise SaaS marketing platform, and one of Forbes’ Best Startup Employers, SOCi boasts hundreds of the world’s largest brands as its customers. The SOCi platform specifically solves complicated marketing and workflow problems for national and global multi-location brands that want to scale and optimize their presence across search, social, reviews, listening, ads, bots, and more. As the largest localized marketing platform in the world, SOCi makes the impossible possible by enabling top brands and their locations to strengthen and scale their digital presence across limitless locations. Our accolades include: Recently closed a Series D investment round of $80 million, led by JMI Equity 4x honoree on Inc. 5000 Fastest Growing Companies in America 2x honoree on Financial Times’ Fastest Growing Companies 3x CEO Finalist for Ernst & Young’s Entrepreneur of the Year award Winner of the MarTech Breakthrough Award for Best Overall Social Media Management Platform #1 Rank by Entrepreneur magazine’s Top Marketing Providers for Franchises, three years in a row Front Runner for Gartner award in Reputation Management & Brand Management 2021 Honoree on Forbes America’s Best Startup Employers What's SOCi's culture like? Led by a team of industry experts, SOCi is leading the pack in Localized Marketing for Multi-Location brands. Our passionate team of SOCialites work from home around the globe! This position is remote and thereby needing stable internet connection to be successful in this role. We offer flexible PTO, comprehensive health & benefits packages, 401k and matching (amongst many other perks). Every new team member is equipped with a MacBook laptop, tech accessories & SOCi swag. We are a fast-paced, agile environment where thought leadership and input is encouraged. If you are looking for a place where you can come and make a difference in the way enterprise organizations utilize social technology, then SOCi is for you. SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Software Development"},
{"programName": "Data Analytics Engineering", "title": "data scientist sr- People Analytics (Remote)", "jobId": "3371492693", "companyName": "Starbucks", "location": "Seattle, WA", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/data-scientist-sr-people-analytics-remote-at-starbucks-3371492693?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=Mz4t5T4See6I0OoDPKBXzw%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Summary And Mission Now Brewing – Senior Data Scientist, People Analytics #tobeapartner From the beginning, Starbucks set out to be a different kind of company.  One that not only celebrated coffee and its rich tradition, but that also brought a feeling of connection. We are known for developing extraordinary leaders who share this passion and are guided by their service to others. As a Senior data scientist, you will support our people analytics efforts at Starbucks, focused on strengthening the Starbucks partner experience. As a member of our team, you will collaborate cross-functionally with data engineers, data scientists, business experts, and external vendors to help Starbucks make better decisions by using data and analytics skills. In this role, you will lead strategic initiatives aimed at optimizing Starbucks retail store operations using data science and simulation, and building Starbucks' next generation labor model system to forecast the number of store partners required to meet customer demands. In this position, you will investigate business problems related to store operations, build data solutions, uncover insights, and explain them to drive better business decisions. You will be confident in communicating with all levels of business partners. As a senior data scientist, you will…  Lead the design and development of scalable data science solutions from the start to the finish by utilizing time series modeling, machine learning, and statistical analysis. Build scalable processes for cleaning, aggregating, and loading data. Understanding business initiatives, challenges, questions, concerns, or ideas, transforming them into successful data science solutions, and monitor data science metrics and KPIs  Mentor data analysts & data scientists on best practices, processes, frameworks, and KPIs Contribute to project planning, and assist the team with estimations, timelines, and prioritization. Assists in developing the analytical roadmap, data, and technology strategy.  We’d Love To Hear From People With Education: BS+ with a concentration in a quantitative discipline - Stats, Math, Comp Sci, Engineering, Econ, Quantitative Social Science or similar discipline. Masters preferred Minimum of 5+ years of industry experience in data and analytics work Strong problem-solving skills with the ability to influence leadership teams at different levels Significant experience working with predictive and statistical modeling, machine learning, and strong expertise in all phases of the modeling pipeline Business experience with data visualization tools and storytelling Experience in experimental design and common statistical analysis techniques Strong SQL, databases, and ETL / ELT skills required including cleaning and managing data. Advanced competency and expertise in Python, R, or some combination Experience with cloud platforms such as Azure, AWS, and GCP Experience working with distributed data processing frameworks such as Spark and Data bricks, and languages such as Java, PySpark, or Scala Experience working with Dev Ops and/or ML Ops, preferred. Retail and eCommerce experience, preferred The pay range for this position may be narrower than that displayed, depending on where the work is performed. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply. Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at applicantaccommodation@starbucks.com. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Management and Strategy/Planning", "industry": "Food and Beverage Services, Manufacturing, and Retail"},
{"programName": "Data Analytics Engineering", "title": "Data Scientist, Data Analytics Engineering", "jobId": "3358644836", "companyName": "Atlassian", "location": "United States", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/data-scientist-data-analytics-engineering-at-atlassian-3358644836?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=KASMkoTSUGgJejctUl8NSA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Working at Atlassian Atlassian can hire people in any country where we have a legal entity. Assuming you have eligible working rights and a sufficient time zone overlap with your team, you can choose to work remotely or return to an office as they reopen (unless it’s necessary for your role to be performed in the office). Interviews and onboarding are conducted virtually, a part of being a distributed-first company. Your future team Do you have experience examining complex data and turning it into useful information and insights? Do you love finding the next big 'aha' insight which changes the way a business thinks about their customers? Would you like to lead change with global impact at the world's hottest SaaS company? Atlassian is looking for a data quality expert to join our Marketing Analytics team as a Data Scientist, Data Analytics Engineering. We're looking for someone with business instincts and analytics mastery, who is passionate about applying these skills to lead smarter data decisions and delight our customers. You'll build scalable marketing analytics data products and pipelines. You'll do this by partnering with analytics and data engineering experts to understand the business and data landscape and build a data foundations roadmap. What you'll do Manage marketing analytics data product programs and pipelines (such as attribution or paid performance pipeline). Build productized data assets that meet customer needs that are scalable enough to grow Oversee data requirement gathering (including metrics and definitions alignment), establishing acceptance criteria, QAing, and testing for new products from start to finish to ensure everything is implemented and validated. Prioritize improvements and complete deep dives that build short-term improvements while partnering with broader data engineering team to define long-term road map Establish documentation for data product assets Partner with marketing analytics and data engineering leadership to achieve \"the best\" data models and products Guide demos sessions and education roll out for new data products and features to ensure adoption and usage Your background 3+ years working with data analysis and engineering An Agile development mindset, appreciating the benefit of constant iteration and improvement. A very high bar for output quality, while balancing \"having something now\" vs. \"perfection in the future\" Expertise in data modeling, (e.g. SQL, Python), knowledge of cloud data environments (e.g. AWS), and experience with data ETLs and UAT processes Strength in one or more visualization tools (Tableau, R-Shiny, etc) An understanding of the SaaS development, business model and metrics Familiarity working with Product Management, Engineering, Design, Customer Research and Data Engineering teams A degree in a quantitative discipline (e.g. statistics, mathematics, physics, econometrics, or computer science) Our Perks & Benefits To support you at work and play, our perks and benefits include ample time off, an annual education budget, paid volunteer days, and so much more. About Atlassian The world’s best teams work better together with Atlassian. From medicine and space travel, to disaster response and pizza deliveries, Atlassian software products help teams all over the planet. At Atlassian, we're motivated by a common goal: to unleash the potential of every team . We believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. To learn more about our culture and hiring process, explore our Candidate Resource Hub .\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3367579323", "companyName": "PICA Manufacturing Solutions", "location": "Derry, NH", "datePosted": "2022-10-25", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-pica-manufacturing-solutions-3367579323?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=kKYNI3%2BRydYT%2BrwiH%2FiSWw%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "PICA Product Development (PPD), an affiliate of PICA Manufacturing Solutions (PMS), is developing a series of battery operated IoT products using newly launched cellular connectivity technologies such as CAT M1. PPD's IoT product design team is a dynamic group of individuals with diverse talents working in a fast-paced, unconstrained and creative environment. We are looking for a Data Analyst to work on our Skyhawk platform. If you bring: The right combination of education and skills Motivation and passion for achieving excellence Commitment to grow professionally We will provide: Interesting projects that will revolutionize industries Opportunities to learn, grow, and build something truly amazing A flexible schedule with the option to work remotely Flexible PTO Responsibilities: Plan, develop and execute data-collecting strategies Organize and transform information into comprehensible structures Identify correlations and patterns and communicate this information in an easy-to-understand format Collaborate with team members to achieve goals and provide status updates on deliverables Stay current with state-of-the-art technologies, tools, and techniques for data analysis and reporting Qualifications: BS Degree in Computer Science or equivalent work experience Demonstrated experience with technologies such as: Typescript/Javascript HTML5 CSS Angular or similar JS frameworks Understanding of RESTful web services Positive attitude Strong written and verbal communication skills Bonus points if you can check the following boxes: Experience with AI/Machine Learning to enhance data analysis and reporting Experience with cloud platforms such as AWS Familiarity with the Internet of Things (IoT) Experience working with cellular technologies Why PICA? The PICA Group offers all its associates very competitive wages and benefits. We also offer a motivational package of incentives that includes both cash and 401K profit sharing incentives that are based both on company and individual performance. This promotes a flexible, enjoyable and collaborative work environment of mutually dependent and supportive associates. Powered by JazzHR qsfkcudVBr\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Data Analytics Engineering", "title": "Software Data Engineer - Analytics", "jobId": "3178547441", "companyName": "Apple", "location": "Cupertino, CA", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/software-data-engineer-analytics-at-apple-3178547441?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=XmOq1aFh4%2B1xsDoUf9k%2B5g%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic.  In this role you will work with various teams to deliver data, dashboards, and insightful performance-optimized analysis to facilitate business decisions. You’ll work with partners to understand their goals and requirements to define application features and strategic roadmaps to meet those needs.   Key Qualifications   -  Self-starter who is dedicated and demonstrates creative and critical thinking abilities -  Experience in developing product features, functional specifications, and development schedules, represent team and technology -  Experience in data modeling and data engineering and analytics experience -  Experience in data management and automation on Spark, Hadoop, and HDFS environments -  Experience handling data in relational databases and developing ETL pipelines -  Competency in Java, Scala, Python or similar object-oriented language -  Confidence with SQL databases and NoSQL databases like Cassandra -  Experience in Tableau or Splunk or ELK Stack or Airflow  -  Ability to independently learn new technologies -  Excellent debugging, critical thinking, and interpersonal skills -  Attention to detail   Description   This Role provides analytics for various internal programs and prototypes to support organization in data informed decisions. This role will require working with multiple large data sets, working knowledge of ETL, visualization tools like Tableau. You will engage directly with key business partners to build positive relationships and understand their business strategies and solution needs. Strong understanding of analytics needs and a proactive approach, focusing on reusable solutions to improve the efficiency and collaborate with multiple multi-functional teams and work on solutions which has larger impact on Apple business   Education & Experience   MS or BS in CS, Engineering, Math, Statistics, or a related field or equivalent practical experience in data engineering.   Additional Requirements   Understanding in big data pipelines using technologies like Kafka, Flume, or Storm Experience with large scale data warehousing, mining or analytic systems Machine learning is a plus……   Role Number: 200387601 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Business Analyst - Data Analytics- Remote", "jobId": "3270139595", "companyName": "McAfee", "location": "San Jose, CA", "datePosted": "2022-11-19", "link": "https://www.linkedin.com/jobs/view/business-analyst-data-analytics-remote-at-mcafee-3270139595?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=2LaiVTfdvnfi6cgbWNz%2FIA%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Title Business Analyst - Data Analytics- Remote Role Overview Do you want to change the world? Come be a part of the transformation as McAfee enters a new age. We are all mission driven, both organizationally and functionally, and our primary passion is for our clients. It's a terrific moment to get started with analytics because they offer the business tremendous leverage for growth. This is a remote position with a U.S. base. We will only take into account applicants who reside in the United States, and we are not currently providing relocation help. About The Role Act as analytics liaison between business and data engineering teams to improve and dashboards, data visualizations, predictive models, and statistical analyses. Work with stakeholders across the organization to identify and establish standard KPIs,build and validate reports and dashboards to monitor and track performance. Work across different business and technical groups to drive agreement on definition of essential KPIs. Be an analytics expert, developing understanding of data about products, consumers and business processes in our data lake and databases. Work with product development teams to provide data capture requirements and ensure the completeness and quality of data sent to the data lake. Oversee the end to end delivery of reports, dashboards, and data products, including requirements gathering, implementation with data engineers and report developers, quality assurance, and driving user acceptance testing and adoption. About You 2-3+ years of analysis experience. Ability to demonstrate flexibility, voicing concerns and proposing alternatives. Able to recognize and interpret business issues/opportunities and recommend solutions through analysis. Excellent SQL skills and preferred knowledge of adobe analytics analysis. You are experienced in developing, implementing, testing, and maintaining methodologies for standardized and repeatable reporting for a variety of audiences. You are interested with large amounts of data. You have experience working with data visualization platforms, Tableau and MicroStrategy. Ability to demonstrate flexibility, voicing concerns and proposing alternatives. Able to recognize and interpret business issues/opportunities and recommend solutions through analysis. Company Overview McAfee is a leader in personal security for consumers. Focused on protecting people, not just devices, McAfee consumer solutions adapt to users’ needs in an always online world, empowering them to live securely through integrated, intuitive solutions that protects their families and communities with the right security at the right moment. Company Benefits And Perks We work hard to embrace diversity and inclusion and encourage everyone at McAfee to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees. Bonus Program Pension and Retirement Plans Medical, Dental and Vision Coverage Paid Time Off Paid Parental Leave Support for Community Involvement We're serious about our commitment to diversity which is why McAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status. For Colorado Residents the starting salary for this position is $61,500.00. McAfee takes into consideration an individual’s skillset and experience in making salary determinations. For further details, please discuss with the Talent Acquisition Partner. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Software Development"},
{"programName": "Data Analytics Engineering", "title": "Senior Engineer - Data Analytics", "jobId": "3178520518", "companyName": "Apple", "location": "Austin, TX", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/senior-engineer-data-analytics-at-apple-3178520518?refId=pwofSFtJNwBwEBDeCvDKxw%3D%3D&trackingId=6ueasEXzMc%2BRvzXwZJFxqw%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this highly visible role in our Data Analytics team, you will help create dashboard development methodologies and closely collaborate with multiple cross-functional teams to collect data/metrics from various chip design flows and develop web based dashboards/visualizations to monitor the health of Apple chips.   Key Qualifications   Capable of independent problem-solving and self-direction with an eye towards creating business value for internal customers Ability to perform well on schedules and co-ordinate with multiple teams across different geographic regions Proficient in any programming language such as Python, Perl, Go etc. Good understanding of linux environment and source control management (Eg. Git, Perforce) Hands-on experience developing dashboards or visualizations on platforms like Splunk, ELK, Tableau, PowerBI etc. Proficiency in Splunk web framework & SPL is highly desired Experience with Splunk as an administrator is a plus   Description   Collect, manage, and present quality metrics data from various Apple chip design flows and projects Engage with cross-functional teams across various sites to design and build scalable/performant reporting & analytics solutions Plan and execute on projects end-to-end, communicating status and milestones in a timely fashion Work with peers to drive and document best-practices in data modeling & dashboard development.   Education & Experience   BS or MS Degree in EE/CE/CS or a technical field   Role Number: 200305694 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Associate, Content Analytics & Operations", "jobId": "3356615002", "companyName": "Netflix", "location": "Los Angeles, CA", "datePosted": "2022-11-16", "link": "https://www.linkedin.com/jobs/view/associate-content-analytics-operations-at-netflix-3356615002?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=%2BwdOEKQv7MaL%2BVDxWm1wsQ%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Netflix is the world's leading streaming entertainment service with 221 million paid memberships in over 190 countries enjoying TV series, documentaries, feature films, and mobile games across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments. As Netflix continues to grow globally, we are looking for the best and brightest to drive analytics that underpin our content strategy and key business decisions. Netflix’s Content Analytics & Operations team is looking for an Associate to join its team in its Hollywood office. The Content Analytics & Operations team is part of the broader Content Strategy & Analytics team. We drive the vision and business strategy that provides Netflix with best-in-class metrics, tools, analysis, insights and reporting to make effective content performance and programming decisions. We partner closely with our Data Science & Engineering teams as well as Content and Content Strategy & Analysis leadership to do so. This role is based in our Hollywood, California office with a hybrid work schedule (Tues-Thurs in-office).  Responsibilities Innovating and developing content performance metrics, frameworks, and insights Analyzing programming investment and performance to develop short- and long-term content planning Guiding Netflix’s content launch strategy and deepening understanding of title audiences Setting the strategy and structure for external data sharing Spearheading special projects for senior Netflix leaders and developing recommendations on key strategic issues Executing market research and competitive trends analysis Streamlining and managing key analytical operations and reporting Partnering closely with Data Science & Engineering across these efforts Embrace and embody our Culture Netflix is fast-growing with a flat organizational structure, which means that employees are often asked to perform tasks with a range of difficulties. The ideal candidate would be prepared to regularly \"roll up their sleeves\" to perform more routine tasks the same day that they are asked to prepare a presentation to the executives of the company Qualifications 1.5-3 years of work experience, ideally in investment banking or management consulting Passion for Content / Entertainment  Experience conducting quantitative analysis (including modeling) and qualitative analysis and can drive to insight and results using data Excellent communication/presentation skills with a track record of presenting complex analyses to executives/senior management clearly and concisely Strong initiative and ability to work independently, thrive in a fast-paced, always-changing environment Highly intellectually curious and has the courage to challenge the status quo and exhibits the highest personal and professional standards of integrity and ethics Excellent proficiency with MS Excel / PowerPoint \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Management and Manufacturing", "industry": "Movies, Videos, and Sound, Technology, Information and Internet, and Entertainment Providers"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3359602983", "companyName": "HHS Technology Group", "location": "Denver, CO", "datePosted": "2022-11-17", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-hhs-technology-group-3359602983?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=ecZZ8V9jWvqXNT1FU7%2Bx2g%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Senior Data AnalyticsEngineer Who we are  HHS Technology Group is a software and solutions company serving the needs of commercial enterprises and government agencies. We create and deliver purpose-built, modular software products, solutions, custom development, and integration services for modernization and operation of systems that support a wide spectrum of business and government needs.  Who we need:  Senior Data Analytics Engineer What we do  HHS Tech Group creates innovative, purpose-built technology products and solutions, resulting in value and positive, quantifiable impact for our clients and the people they serve. Our vision drives the future.  HHS Technology Group is expanding. We create software products relevant to the healthcare insurance domain. Our growth trajectory is fantastic. We are leveraging data science to create healthcare insurance software to identify data trends which would indicate fraud waste and abuse scenarios as well as third party liability, thusly giving the insurance provider an opportunity to recover their funds which may have been paid erroneously. 4-5 years of work experience with ETL Expert-level skills in writing SQL Python and SQL/MongoDBskills are must requirements Experience with Big Data technologies such as Spark Experience with AWS Big Data technologies such as AWS Glue/EMR, S3, AWS Athena Experience with Data warehouses such as Snowflake/Redshift Knowledge on processing of Claims/EMR/EHR/Provider / Member datasets. Experience with  NodeJS, ReactJS, and Go Lang Ability to multi-task, take initiative, assume accountability, work independently and self-manage duties and responsibilities, as well as intuitively having the ability to pivot focus between tasks according to priorities to achieve maximum efficiency. Please find all benefits listed here:  https://hhstechgroup.com/careers/benefits-we-offer/   Fully paid premiums on dental, vision, life insurance, and disability insurance.  Generously sponsored Medical Insurance  Generous 401k matching program (100% match up to 6%)  Open PTO policy  HHS Technology Group creates software products in the healthcare insurance domain. Our software, Discover your Provider (DyP) and Discover your Data (DyD) ensure seamless modernization of monolithic, antiquated systems and leverages data science to give our customers intelligent insight of data trends pertaining to paid insurance claims. HHS Technology Group has become a valued and trusted systems integration partner for several departments within a number of State Governments. HHS Technology Group’s flagship product, Discover your Provider (DyP) is a provider relations/provider enrollment solution. Components of this modular software can be re-purposed or built upon to deliver cloud based technical web services solutions. The intense growth and tremendous financial forecast we are experiencing at HHS Technology Group can largely be attributed to our successes on these initiatives.  EEO Statement  HHS Technology Group is an equal opportunity employer. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Data Analytics Engineering", "title": "Data Science, Product Analytics", "jobId": "3346260792", "companyName": "eBay", "location": "San Jose, CA", "datePosted": "2022-11-26", "link": "https://www.linkedin.com/jobs/view/data-science-product-analytics-at-ebay-3346260792?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=CtiYS1gDJ7uV3J%2BTgHaXvg%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Looking for a company that inspires passion, courage and creativity, where you can be on the team shaping the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you’re interested in joining a purpose driven community that is dedicated to crafting an ambitious and inclusive work environment, join eBay – a company you can be proud to be with. About This Role The Global Payments, Billing & Risk (GPBR) function at eBay works to ensure great experiences when buyers and sellers come together and engage in commerce on the biggest marketplace in the world. This involves comprehensively understanding Payments, Billing & Risks on the platform. Identifying the opportunity areas and helping build scalable solutions to drive great user experience. Analytics is critical for a data driven Risk and Identity function. Core analytics capabilities include the ability to instrument critical metrics, identify the landscape of the entire function, figure out opportunities for improvement, work with Product to craft scalable solutions, and monitor their performance. We build this behavioral intelligence by exploring creative interpretations of existing and new sources of data, using advanced analytical techniques, and overlaying the appropriate strategies to deliver exceptional results.We are multi-disciplinary with a broad spectrum of industry experiences and deep analytical and quantitative expertise. We are currently seeking a high energy, driven, collaborative team member who brings extensive problem-solving skills to further the goal of applying cutting-edge risk analytics, insights and visualization to drive the payments roadmap. The role is data and analytically intensive. Successful candidates should be quick learners, strategic thinkers, operational and execution driven facilitators, problem solvers, and have an entrepreneurial spirit. Skills in problem definition, rigorous analysis, and recommendation development will also be critical as well as demonstration of exceptional interpersonal skills, initiative and integrity. Primary Responsibilities Collaborate with business partners to answer key business questions – challenge their thinking and become a trusted business partner. Help the business prioritize analytical deliverables and manage their expectations Perform exploratory analysis of large data sets Derive tactical and strategic insights to improve business strategies and accelerate channel growth Champion and evolve the experimentation approach for all the new payment product launches Demonstrate strong analytical and statistical skills towards taking complex and unstructured business problems, and providing structured, hypothesis-driven and data-supported practical solutions Have strong empirical and analytical background, with demonstrated ability to combine quantitative and qualitative findings in order to frame the right questions and measurable insights Be a lateral problem solver, who constructively challenges the obvious answer in order to examine the underlying mechanism or phenomenon Be comfortable in developing analytics vision and roadmap for the team, and foster innovation through continuous evolution of analytical frameworks and data solutions Skill-set Requirements Bachelor’s degree in Math, Statistics, Engineering, or other quantitative discipline 3+ years of experience in data analytics, data science or related field with a Bachelor's degree Or 2+ years of experience with a Masters degree Strong technical skills in SQL and R/Python Hypothesis testing and experience with experimentation (A/B testing) Strong applied statistical knowledge Good experience with both descriptive and inferential statistics – ability to build basic prototype models In addition to delivering insights on existing Product & Tech initiatives, you will come up with innovative product growth opportunities based on insights, and create momentum through influence Proactive collaboration and effective communication are critical Additionally, The Following Background And Experience Is Preferred Proven track record of turning insights into product growth opportunities in prior roles with increasing scope and responsibilities Ability to present complex analyses and insights effectively in simple terms Background in ecommerce product experience and Identity/Risk domain is a plus Benefits are an essential part of your total compensation for the work you do every day. Whether you’re single, in a growing family, or nearing retirement, eBay offers a variety of comprehensive and competitive benefit programs to meet your needs. Including maternal & paternal leave, paid sabbatical, and plans to help ensure your financial security today and in the years ahead because we know feeling financially secure during your working years and through retirement is important. Here at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn’t just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work. To learn about eBay’s Diversity & Inclusion click here: https://www.ebayinc.com/company/diversity-inclusion/ eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible. View our accessibility info to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities. For more information see: EEO is the Law Poster and EEO is the Law Poster Supplement. Jobs posted with location as \"Remote - United States (Excludes CO, HI, NM, NYC)\" excludes residents of Colorado, Hawaii, New Mexico and New York City. This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Internet Marketplace Platforms"},
{"programName": "Data Analytics Engineering", "title": "Data Engineer, Business Intelligence and Analytics", "jobId": "3167605698", "companyName": "SOCi, Inc.", "location": "United States", "datePosted": "2022-11-20", "link": "https://www.linkedin.com/jobs/view/data-engineer-business-intelligence-and-analytics-at-soci-inc-3167605698?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=SvQetUvwl4qExo%2BxHHDgNw%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Data Engineer - Business Intelligence and Analytics We’re looking for a Data Engineer - Business Intelligence and Analytics who will support the build out of the data infrastructure to enable analytics across SOCi. This role will work with business users across Sales, Marketing, Engineering, Customer Success, Product, and Finance to scope out their use cases, build out data solutions and suggest ways to optimize. The role will also work to automate various processes using our ETL solutions and scripting as needed to ensure timely delivery of data and reporting. Responsibilities: Develop and maintain the “source of truth” data environment used by everyone at SOCi Design scale databases optimized for business analytics. Build and manage large, real time data pipelines with monitoring and proactive alerting. Extract and maintain 3rd party data using API calls and other connectors and tools (ie..Fivetran) Develop data models that power predictive recommendations, marketing attribution, financial forecasts, and pipeline analysis to support the decision-making within the organization. Collaborate on a regular basis with the following teams at SOCi: Engineering, Customer Success, Sales, Marketing, and Product Work with a team of data engineers and analysts to build a world-class data environment. Requirements: 4+ years of data or software engineering experience, including expertise in SQL and object-oriented programming languages (Python, Java, or C++) Experience in database design, 3NF, denormalization, or star schema. Experience in managing the deployment of new tools and technologies Experience with Big Data technologies (Snowflake, Redshift, Oracle, Hadoop, Kafka) Familiarity with ETL flows/tools (Airflow, DBT, Stitch, Fivetran, HEVO, etc.) Comfortable with massive amounts of semi-structured data Has knowledge of data engineering best practices (data discovery, data documentation, infrastructure development/deployment, and information security) Bachelors or Masters in Engineering, Math, or data science preferred Self-starter mentality and entrepreneurial spirit with a strong drive for excellence and delivery of results Ability to operate in a lean, fast-paced organization, and to create a vision and organization that can scale quickly About Us: SOCi is one of the fastest growing technology companies in the country, ranking in the top tier of Inc 5000’s Fastest Growing Companies in America list for the last 4 years in a row. The builder of an award-winning enterprise SaaS marketing platform, and one of Forbes’ Best Startup Employers, SOCi boasts hundreds of the world’s largest brands as its customers. The SOCi platform specifically solves complicated marketing and workflow problems for national and global multi-location brands that want to scale and optimize their presence across search, social, reviews, listening, ads, bots, and more. As the largest localized marketing platform in the world, SOCi makes the impossible possible by enabling top brands and their locations to strengthen and scale their digital presence across limitless locations. Our accolades include: Recently closed a Series D investment round of $80 million, led by JMI Equity 4x honoree on Inc. 5000 Fastest Growing Companies in America 2x honoree on Financial Times’ Fastest Growing Companies 3x CEO Finalist for Ernst & Young’s Entrepreneur of the Year award Winner of the MarTech Breakthrough Award for Best Overall Social Media Management Platform #1 Rank by Entrepreneur magazine’s Top Marketing Providers for Franchises, three years in a row Front Runner for Gartner award in Reputation Management & Brand Management 2021 Honoree on Forbes America’s Best Startup Employers What's SOCi's culture like? Led by a team of industry experts, SOCi is leading the pack in Localized Marketing for Multi-Location brands. Our passionate team of SOCialites work from home around the globe! This position is remote and thereby needing stable internet connection to be successful in this role. We offer flexible PTO, comprehensive health & benefits packages, 401k and matching (amongst many other perks). Every new team member is equipped with a MacBook laptop, tech accessories & SOCi swag. We are a fast-paced, agile environment where thought leadership and input is encouraged. If you are looking for a place where you can come and make a difference in the way enterprise organizations utilize social technology, then SOCi is for you. SOCi is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Software Development"},
{"programName": "Data Analytics Engineering", "title": "data scientist sr- People Analytics (Remote)", "jobId": "3371492693", "companyName": "Starbucks", "location": "Seattle, WA", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/data-scientist-sr-people-analytics-remote-at-starbucks-3371492693?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=dlN6l7B0AfvspvVWPUhbmA%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Summary And Mission Now Brewing – Senior Data Scientist, People Analytics #tobeapartner From the beginning, Starbucks set out to be a different kind of company.  One that not only celebrated coffee and its rich tradition, but that also brought a feeling of connection. We are known for developing extraordinary leaders who share this passion and are guided by their service to others. As a Senior data scientist, you will support our people analytics efforts at Starbucks, focused on strengthening the Starbucks partner experience. As a member of our team, you will collaborate cross-functionally with data engineers, data scientists, business experts, and external vendors to help Starbucks make better decisions by using data and analytics skills. In this role, you will lead strategic initiatives aimed at optimizing Starbucks retail store operations using data science and simulation, and building Starbucks' next generation labor model system to forecast the number of store partners required to meet customer demands. In this position, you will investigate business problems related to store operations, build data solutions, uncover insights, and explain them to drive better business decisions. You will be confident in communicating with all levels of business partners. As a senior data scientist, you will…  Lead the design and development of scalable data science solutions from the start to the finish by utilizing time series modeling, machine learning, and statistical analysis. Build scalable processes for cleaning, aggregating, and loading data. Understanding business initiatives, challenges, questions, concerns, or ideas, transforming them into successful data science solutions, and monitor data science metrics and KPIs  Mentor data analysts & data scientists on best practices, processes, frameworks, and KPIs Contribute to project planning, and assist the team with estimations, timelines, and prioritization. Assists in developing the analytical roadmap, data, and technology strategy.  We’d Love To Hear From People With Education: BS+ with a concentration in a quantitative discipline - Stats, Math, Comp Sci, Engineering, Econ, Quantitative Social Science or similar discipline. Masters preferred Minimum of 5+ years of industry experience in data and analytics work Strong problem-solving skills with the ability to influence leadership teams at different levels Significant experience working with predictive and statistical modeling, machine learning, and strong expertise in all phases of the modeling pipeline Business experience with data visualization tools and storytelling Experience in experimental design and common statistical analysis techniques Strong SQL, databases, and ETL / ELT skills required including cleaning and managing data. Advanced competency and expertise in Python, R, or some combination Experience with cloud platforms such as Azure, AWS, and GCP Experience working with distributed data processing frameworks such as Spark and Data bricks, and languages such as Java, PySpark, or Scala Experience working with Dev Ops and/or ML Ops, preferred. Retail and eCommerce experience, preferred The pay range for this position may be narrower than that displayed, depending on where the work is performed. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. We are committed to creating a diverse and welcoming workplace that includes partners with diverse backgrounds and experiences. We believe that enables us to better meet our mission and values while serving customers throughout our global communities. People of color, women, LGBTQIA+, veterans and persons with disabilities are encouraged to apply. Qualified applicants with criminal histories will be considered for employment in a manner consistent with all federal state and local ordinances. Starbucks Corporation is committed to offering reasonable accommodations to job applicants with disabilities. If you need assistance or an accommodation due to a disability, please contact us at applicantaccommodation@starbucks.com. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Management and Strategy/Planning", "industry": "Food and Beverage Services, Manufacturing, and Retail"},
{"programName": "Data Analytics Engineering", "title": "Data Scientist, Data Analytics Engineering", "jobId": "3358644836", "companyName": "Atlassian", "location": "United States", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/data-scientist-data-analytics-engineering-at-atlassian-3358644836?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=T0utD3fTDFdeCF3H%2Bu9fNA%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Working at Atlassian Atlassian can hire people in any country where we have a legal entity. Assuming you have eligible working rights and a sufficient time zone overlap with your team, you can choose to work remotely or return to an office as they reopen (unless it’s necessary for your role to be performed in the office). Interviews and onboarding are conducted virtually, a part of being a distributed-first company. Your future team Do you have experience examining complex data and turning it into useful information and insights? Do you love finding the next big 'aha' insight which changes the way a business thinks about their customers? Would you like to lead change with global impact at the world's hottest SaaS company? Atlassian is looking for a data quality expert to join our Marketing Analytics team as a Data Scientist, Data Analytics Engineering. We're looking for someone with business instincts and analytics mastery, who is passionate about applying these skills to lead smarter data decisions and delight our customers. You'll build scalable marketing analytics data products and pipelines. You'll do this by partnering with analytics and data engineering experts to understand the business and data landscape and build a data foundations roadmap. What you'll do Manage marketing analytics data product programs and pipelines (such as attribution or paid performance pipeline). Build productized data assets that meet customer needs that are scalable enough to grow Oversee data requirement gathering (including metrics and definitions alignment), establishing acceptance criteria, QAing, and testing for new products from start to finish to ensure everything is implemented and validated. Prioritize improvements and complete deep dives that build short-term improvements while partnering with broader data engineering team to define long-term road map Establish documentation for data product assets Partner with marketing analytics and data engineering leadership to achieve \"the best\" data models and products Guide demos sessions and education roll out for new data products and features to ensure adoption and usage Your background 3+ years working with data analysis and engineering An Agile development mindset, appreciating the benefit of constant iteration and improvement. A very high bar for output quality, while balancing \"having something now\" vs. \"perfection in the future\" Expertise in data modeling, (e.g. SQL, Python), knowledge of cloud data environments (e.g. AWS), and experience with data ETLs and UAT processes Strength in one or more visualization tools (Tableau, R-Shiny, etc) An understanding of the SaaS development, business model and metrics Familiarity working with Product Management, Engineering, Design, Customer Research and Data Engineering teams A degree in a quantitative discipline (e.g. statistics, mathematics, physics, econometrics, or computer science) Our Perks & Benefits To support you at work and play, our perks and benefits include ample time off, an annual education budget, paid volunteer days, and so much more. About Atlassian The world’s best teams work better together with Atlassian. From medicine and space travel, to disaster response and pizza deliveries, Atlassian software products help teams all over the planet. At Atlassian, we're motivated by a common goal: to unleash the potential of every team . We believe that the unique contributions of all Atlassians create our success. To ensure that our products and culture continue to incorporate everyone's perspectives and experience, we never discriminate based on race, religion, national origin, gender identity or expression, sexual orientation, age, or marital, veteran, or disability status. All your information will be kept confidential according to EEO guidelines. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. To learn more about our culture and hiring process, explore our Candidate Resource Hub .\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "IT Services and IT Consulting"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3367579323", "companyName": "PICA Manufacturing Solutions", "location": "Derry, NH", "datePosted": "2022-10-25", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-pica-manufacturing-solutions-3367579323?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=ARdyIiJ%2FS5f01oe0QMSglg%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "PICA Product Development (PPD), an affiliate of PICA Manufacturing Solutions (PMS), is developing a series of battery operated IoT products using newly launched cellular connectivity technologies such as CAT M1. PPD's IoT product design team is a dynamic group of individuals with diverse talents working in a fast-paced, unconstrained and creative environment. We are looking for a Data Analyst to work on our Skyhawk platform. If you bring: The right combination of education and skills Motivation and passion for achieving excellence Commitment to grow professionally We will provide: Interesting projects that will revolutionize industries Opportunities to learn, grow, and build something truly amazing A flexible schedule with the option to work remotely Flexible PTO Responsibilities: Plan, develop and execute data-collecting strategies Organize and transform information into comprehensible structures Identify correlations and patterns and communicate this information in an easy-to-understand format Collaborate with team members to achieve goals and provide status updates on deliverables Stay current with state-of-the-art technologies, tools, and techniques for data analysis and reporting Qualifications: BS Degree in Computer Science or equivalent work experience Demonstrated experience with technologies such as: Typescript/Javascript HTML5 CSS Angular or similar JS frameworks Understanding of RESTful web services Positive attitude Strong written and verbal communication skills Bonus points if you can check the following boxes: Experience with AI/Machine Learning to enhance data analysis and reporting Experience with cloud platforms such as AWS Familiarity with the Internet of Things (IoT) Experience working with cellular technologies Why PICA? The PICA Group offers all its associates very competitive wages and benefits. We also offer a motivational package of incentives that includes both cash and 401K profit sharing incentives that are based both on company and individual performance. This promotes a flexible, enjoyable and collaborative work environment of mutually dependent and supportive associates. Powered by JazzHR qsfkcudVBr\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Internet Publishing"},
{"programName": "Data Analytics Engineering", "title": "Senior Engineer - Data Analytics", "jobId": "3178520518", "companyName": "Apple", "location": "Austin, TX", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/senior-engineer-data-analytics-at-apple-3178520518?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=1ZXq8eZ5YJZmkWrwrnbOuA%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   Do you love creating elegant solutions to highly complex challenges? Do you intrinsically see the importance in every detail? As part of our Silicon Engineering group, you’ll help design and manufacture our next-generation, high-performance, power-efficient processor, system-on-chip (SoC). You’ll ensure Apple products and services can seamlessly and efficiently handle the tasks that make them beloved by millions. Joining this group means you’ll be responsible for crafting and building the technology that fuels Apple’s devices. Together, you and your team will enable our customers to do all the things they love with their devices. In this highly visible role in our Data Analytics team, you will help create dashboard development methodologies and closely collaborate with multiple cross-functional teams to collect data/metrics from various chip design flows and develop web based dashboards/visualizations to monitor the health of Apple chips.   Key Qualifications   Capable of independent problem-solving and self-direction with an eye towards creating business value for internal customers Ability to perform well on schedules and co-ordinate with multiple teams across different geographic regions Proficient in any programming language such as Python, Perl, Go etc. Good understanding of linux environment and source control management (Eg. Git, Perforce) Hands-on experience developing dashboards or visualizations on platforms like Splunk, ELK, Tableau, PowerBI etc. Proficiency in Splunk web framework & SPL is highly desired Experience with Splunk as an administrator is a plus   Description   Collect, manage, and present quality metrics data from various Apple chip design flows and projects Engage with cross-functional teams across various sites to design and build scalable/performant reporting & analytics solutions Plan and execute on projects end-to-end, communicating status and milestones in a timely fashion Work with peers to drive and document best-practices in data modeling & dashboard development.   Education & Experience   BS or MS Degree in EE/CE/CS or a technical field   Role Number: 200305694 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Principal Analyst, Data Science & Analytics", "jobId": "3311157304", "companyName": "Zillow", "location": "United States", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/principal-analyst-data-science-analytics-at-zillow-3311157304?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=hfUnhP84WyxiyRgDuMXF4Q%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "About The Team The Zillow Analytics organization is passionate about understanding the customer journey on our platforms through deep analysis and measurement. We relentlessly advocate for a seamless and delightful home shopping experience from dream to reality! The team works closely across the organization to discover strategic opportunities in areas spanning the search and discovery process, membership and re-engagement, evaluation and curation of potential homes, and personalization for both the Zillow and Trulia brands. We scale this work by partnering with engineering teams to build and maintain key analytics tools and infrastructure. About The Role Zillow is looking for Principal Analyst to join a growing world-class analytics group dedicated to excellence. In this role you will: Lead analytical efforts across the organization. Define, measure, and report on success metrics for complex projects and pilots. Use data to identify large opportunities for product and operational improvements. Partner with product, marketing, and operations leaders across the organization to deliver impactful solutions to business problems. Partner with customers to understand and clarify requirements to creatively solve complex business problems with analytic solutions. Recruit, hire, and mentor extraordinary analysts and data scientists. In Colorado, Connecticut, Nevada and New York City the standard base pay range for this role is $153,200.00 - $244,800.00 Annually. This base pay range is specific to Colorado, Connecticut, Nevada and New York City and may not be applicable to other locations. In addition to a competitive base salary this position is also eligible for equity awards based on factors such as experience, performance and location. Actual amounts will vary depending on experience, performance and location. Who you are 8-10 years experience in an analytical role. 3-4 years of experience communicating regularly with executive stakeholders. Strong bias for action and impact informed by your data insights. Ability to design and communicate your analytical roadmap to peers and stakeholders. Strong business acumen, communication skills and the ability to work cross-functionally and connect customer problems to business strategy. Expert at applying the “80/20” rule and estimating the impact and relative priority of a potential analysis project. Deep, intuitive understanding of core statistical concepts, such as probability, randomness, correlation and sampling distributions. Expert in SQL, Excel, and either Tableau, Mode, or other visualization software. Scripting and automation experience is preferred. Experience leading self and mentoring junior data analysts and/or data scientists. Get to know us Zillow is reimagining real estate to make it easier to unlock life’s next chapter. As the most-visited real estate website in the United States, Zillow® and its affiliates help movers find and win their home through digital solutions, first class partners, and easier buying, selling, financing and renting experiences. Millions of people visit Zillow Group sites every month to start their home search, and now they can rely on Zillow to help make it easier to move. The work we do is helping people move from dreaming to transacting — and no matter what job you're in, you will play a critical role in making this vision a reality. Our efforts to streamline the real estate transaction are supported by a deep-rooted culture of innovation, our passion to redefine the employee experience, a fundamental commitment to Equity and Belonging, and  world-class benefits . We’re also setting the standard for work experiences of the future, where our employees are supported in doing their best work and living a flexible, well-balanced life. But don’t just take our word for it. Read recent reviews on  Glassdoor  and recent recognition from multiple organizations, including: the 100 Best Companies to Work For in 2022 list, Glassdoor Employees’ Choice Award, honoring the  Best Places to Work  in 2022, Bloomberg Gender-Equality Index 2022, Human Rights Campaign (HRC) Corporate Equity Index and Best Place to Work for LGBTQ Equality 2022, and TIME  100 Most Influential Companies  list. Zillow Group is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. If you have a disability or special need that requires accommodation, please contact us at RecruitingAccessibility@zillowgroup.com. Applicants who receive job offers from Zillow Group will be asked to sign a Proprietary Rights Agreement which includes confidentiality, intellectual property assignment, customer and employee non-solicitation, and non-competition provisions. If you are contacted for a role at Zillow Group and wish to review a copy of the Proprietary Rights Agreement prior to receiving an offer, you may request a copy from your Recruiter. See What Information We Collect About You. ]]>\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Engineering and Science", "industry": "Software Development"},
{"programName": "Data Analytics Engineering", "title": "VP, Data Analytics", "jobId": "3339080809", "companyName": "TechInsights", "location": "Denver, CO", "datePosted": "2022-11-01", "link": "https://www.linkedin.com/jobs/view/vp-data-analytics-at-techinsights-3339080809?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=wpPETg2KPq8tzAoF2VrTqg%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "OUR STORY TechInsights is the world’s most trusted and authoritative source of actionable intelligence on innovation in the semiconductor and microelectronics industry. Our clients include the largest and most successful technology companies who rely on our content platform to make the most informed business and engineering decisions faster and with greater confidence. Our platform is based on continuous analysis of the most innovative devices in the industry using state-of-the-art reverse engineering facilities and expert curation by specialized subject matter experts. As part of our recruitment process, we strongly encourage every applicant to explore our TechInsights Platform by creating a free trial account. TechInsights is headquartered in Ottawa, Canada, with operations in the US (Denver, San Jose), Poland, Japan, Taiwan, South Korea, China, and England. Our customers are some of the largest blue-chip companies in the world. We have successfully integrated four acquisitions in the last 12 months, with the ambition to double our business through acquisition and organic growth over the next 12 to 24 months. THE OPPORTUNITY: Reporting to the CFO (with daily interaction with the CEO and the rest of the C-Suite), the VP of Data and Analytics plays a central role in understanding the business, ensuring data is at the center of everything TechInsights does, identifying problems and facilitating solutions through the application of data analytics. The VP of data and analytics will inherit a team dispersed across various departments (Finance, Sales and Marketing, People, Platform and each of the business units) and coordinate delivery and analysis of day to day data such as tracking marketing effectiveness, sales pipelines, close rates, retention rates, staff utilization, diversity, recruitment effectiveness, price trends, product performance, active users in the platform, types of content viewed, serviceable and total addressable market etc. WHAT YOU WILL DO: The key deliverable will be the establishment and continuous improvement of day to day running and tracking of KPI’s across the entire business, identifying insights and recommendations to drive the company and achieve our ambitious growth plan and to ensure that we deliver on our vision to build the authoritative information platform for the semiconductor industry. Ownership of all data within the company, including quality, cleanliness, all data reporting (for avoidance of doubt, not financial reporting) Ensure that the organization has data at the heart of everything it does and drives every decision, tracking marketing effectiveness, sales pipelines, close rates, retention rates, staff utilization, diversity, recruitment effectiveness, price trends, product performance, active users in the platform, types of content viewed, serviceable and total addressable market etc. Manage a high performing team of analysts across business functions ((Finance, Sales and Marketing, People, Platform and each of the business units) Gather information, normalize data and identify, resolve and to the extent required, fix data quality deficiencies Ownership of reporting dashboards Ownership of Due Diligence and exposure to private equity board and transactions Drives team to ensure clear documentation of data sources and output Defines and industrializing metrics and KPIs Communicates insights to key stakeholders by presenting findings in a clear, concise and initiative way to ensure maximum value  Prepares strategic recommendations for process adjustments and performance improvements Gathers information; understands and analyzes business problems Initiates and participates in the development of data and reporting policies and procedures WHO YOU ARE: The successful candidate will be comfortable in understanding and manipulating varying significant data sets from multiple sources and will also input into and drive the cleanliness of data and reporting, identifying issues through analytical review of output and fixing upstream data issues in systems such as Salesforce, NetSuite, HRIS system, TechInsights Platform. The candidate will also be able to understand the background to reporting requirements, document the process for delivering and analytically review the quality of the output. Post-secondary education in accounting, finance, mathematics, statistics, economics, or related discipline Experience at consulting companies such as Bain, McKinsey, Accenture, E&Y, PwC etc. or within private equity analysing large data sets for trends as part of go to market consulting projects or acquisition due diligence validating Total Addressable Markets and historical performance of metrics like retention rates, drivers of growth etc. Proven skills in data analysis, data models Ability to analyze large data sets and write comprehensive reports Strong verbal and written communication skills Critical thinking abilities, strong analytical skills and inclination for problem solving Persistent attention to detail Ability to maintain confidential information  Strong data analysis capabilities with knowledge of business intelligence tools such as Tableau Advanced data manipulation tools, and Excel skills WHY WORK WITH US: Competitive pay and generous benefits (medical, dental, vision, wellness, RRSP/401K Matching) Flexible work arrangement Flexible vacation policy Annual fitness reimbursement Strong sense of camaraderie, mutual respect and shared goals among colleagues Support for community through charitable alliances Professional and career development opportunities Wellness resources and support from management Salary range: USD $200k - $245k Technology knows no bounds, and neither does TechInsights. Bringing together talented humans from different perspectives, backgrounds and abilities is something we take seriously. We’re committed to building an inclusive environment that welcomes you to be your authentic self and allows us to push past the boundaries together. TechInsights is committed to meeting the needs of people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. As part of any recruitment process, TechInsights collects and processes personal data relating to job applicants. We are committed to being transparent about how we collect and use that data and to meeting our data protection obligations. Our Privacy policy can be referenced here: https://www.techinsights.com/privacy-policy Powered by JazzHR sqqp4PGqWB\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Director", "employmentType": "Full-time", "jobFunction": "Business Development and Sales", "industry": "Internet Publishing"},
{"programName": "Data Analytics Engineering", "title": "Vice President – Data Science & Analytics", "jobId": "3219049068", "companyName": "H&R Block", "location": "United States", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/vice-president-%E2%80%93-data-science-analytics-at-h-r-block-3219049068?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=Eu1AI5%2Btlquhwk76xMmOXg%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "What You'll Do... H&R Block is seeking a Vice President – Data Science & Analytics. Most of the team resides in Kansas City but the company is open to the position working remote. H&R Block, Inc. (NYSE: HRB) provides help and inspires confidence in its clients and communities everywhere through global tax preparation services, financial products, and small business solutions. The company blends digital innovation with human expertise and care as it helps people get the best outcome at tax time and also be better with money using its mobile banking app, Spruce. Through Block Advisors and Wave, the company helps small-business owners thrive with innovative products like Wave Money, a mobile-first, small-business bank account and bookkeeping solution, that manages bookkeeping automatically. We are amidst a transformation journey and focused on the future with a forward-thinking, innovative culture that is led by a leadership team focused on delivering for our customers, communities, associates, and for our shareholders. We are focused on leveraging our robust data and as the VP of Data Science & Analytics, you’ll lead the company’s efforts in building a data-driven culture to deliver strategic initiatives. You’ll leverage a rich data-set to improve customer experiences and drive profitable growth. You’ll evolve our capabilities to move from reporting results to predicting outcomes that enable business transformation. You'll lead a nimble team that uses machine learning and predictive analytics to partner with product, marketing, & operations to drive growth and further efficiencies. You'll be expected to think strategically, effectively communicate and collaborate with other teams, as well as possess the technical skills to deliver sophisticated projects from concept to production. You will: Act as the champion of analytics to build a data-driven culture throughout the entire organization Be a technical leader and mentor for the data science and analytics team, focusing on continuous learning and process enhancement Work with the leadership team in establishing a long-term vision for the company while building out a roadmap of data science development and applications Enhance enterprise reporting capabilities leveraging a BI data visualization platform Conceive, develop, implement, and continually improve machine learning projects Use data insights to challenge the status quo and inform strategic decisions Work with business leaders to determine strategic direction for pricing of core services Partner with IT to assess and implement best-in-class capabilities for data structures, governance processes and analytics tools Communicate insights and business performance with the leadership team and other colleagues Lead a data science team of approximately 50 associates What You'll Bring To The Team... 10+ years of experience managing a team of data scientists Experience in analytics applications including machine learning, R, Python, Adobe Experience with BI data visual platforms Excellent communication and presentation skills Master’s degree in Computer Science, Statistics, Engineering, or a related quantitative field; MBA or PhD preferred About H&R Block... H&R Block’s purpose is simple: To provide help and inspire confidence in our clients and communities everywhere. We’ve been true to that purpose since brothers Henry and Richard Bloch founded our company in 1955. Since then, we’ve grown to have approximately 12,000 offices throughout the United States and around the world. We are a people company first and a tax company second. People who join H&R Block say it feels like being part of something bigger. A place with an amazing and storied history, but with a strong and urgent focus on the future. Maybe it’s how determined, forward thinking and innovative we are, or how accessible our leadership is. We believe it’s all those things, and much more. H&R Block is committed to diversity and inclusion and is proud to be an equal opportunity employer. We consider qualified applicants regardless of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. All qualified applicants are welcomed and encouraged to apply. Sponsored Job #hrbjob \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Research", "industry": "Financial Services and Retail"},
{"programName": "Data Analytics Engineering", "title": "VP, Data Analytics", "jobId": "3343511133", "companyName": "Propio Language Services", "location": "Overland Park, KS", "datePosted": "2022-11-08", "link": "https://www.linkedin.com/jobs/view/vp-data-analytics-at-propio-language-services-3343511133?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=8mIDjLTKvv9yWgSUQwADAw%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "At  Propio Language Services  we are closing the language gap by connecting people anywhere and anytime through innovative technology and solutions. Propio  provides critical interpreting and translation services that improve the quality of life with the communities we engage.Propio believes language changes the map of how people see the world. If you agree, want to make an immediate impact and help us change the world, we want to talk to you. Propio  is hiring a  VP, Data Analytics  and looking for an innovative leader that will leverage the current state of data (and its utilization) to design an analytics platform to continuously inform and forecast the needs of Propio business units as growth continues. What you will be doing Leading ambiguous and undefined problems to resolution in the face of uncertainty.  Lead and hire exceptional talent in data architecture and engineering disciplines. Coaching, develop and mentor engineers, cultivating pragmatic engineering decision-making, and leveraging your technical expertise to constantly raise the bar. Work backwards from intra- and inter-organizational Customers to develop creative and informative solutions to solve data needs via existing and new service offerings Capable of presenting to executive leadership with data integrity and informative dashboards and reports to increase company efficiency Create a Data Analytics roadmap which balances best practices in Data Engineering with tactical and strategic business initiatives. Be an effective collaborator in a cross functional across the Technology and Business Units Other duties as assigned. What you Need to Succeed Bachelor’s Degree in engineering preferably in Computer Science (or related discipline) Experience building and managing local and remote engineering teams (and managing managers)  Proficiency in data modeling, warehousing and ETL/ELT development Experience with multiple scripting (Python, Typescript) and database platforms (MS SQL, Postgres, MySQL, etc.) Knowledge and deliver of securing protected data in transactional and reporting databases. Strong verbal/written communication and inter-personal skills Ability to handle multiple competing priorities in a fast-paced environment Preferred Qualifications Expert in AWS technologies, including Lambda, Kinesis, RDS and Redshift Experience in leveraging audio and video streams as data sources for cleansing, analyzing and reporting. DIVERSITY STATEMENT Diversity creates a healthier atmosphere: Propio is an Equal Employment Opportunity/Affirmative Action employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. All applicants must be able to complete pre-employment onboarding requirements (if selected) which may include any/all of the following: criminal background check, education, and employment verification. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Business Development and Sales", "industry": "Translation and Localization"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3347496049", "companyName": "akdm", "location": "New York City Metropolitan Area", "datePosted": "2022-11-07", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-akdm-3347496049?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=dDdbGI0uSzW60yEA2A89%2BQ%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Who We Are: AKDM is a leader in delivering digital growth strategies guided by data, analytics, and business intelligence. We work with a range of clients — spanning niche players to industry leaders across e-commerce, financial services, travel, entertainment, and consumer packaged goods. Inclusivity for our teams is a priority. From DEI training to volunteering, we are on a journey to connect our business goals with values by promoting a culture of equity and access. We are actively seeking candidates that bring diverse perspectives to our team and work with us to build better, more inclusive approaches to work and collaboration. About the Role: As an Analytics Engineer, you will be on a mission to help develop a single unified view of AKDM’s data and speed up the cycle of insight. With a broad knowledge of the digital marketing analytics space from current industry trends to technical platform expertise, you will provide the opportunity for deeper client experiences and improving AKDM’s organizational growth. You will work with your counterparts across the Media, SEO, S&I, BI, Finance, and Customer Success teams to empower AKDM’s clients with a data-driven culture of measurement. This role would collaborate with data engineers to automate reporting systems and with solution engineers to deploy reusable data structures. The ideal candidate would be highly adaptable to new areas of domain knowledge and would apply thought beyond technical requirements into business use cases and analysis.  The salary range for the Data Analytics Engineer position is between $100,000 and $110,000. The actual annual salary is dependent upon many factors, such as the individual's experience, knowledge, skills, and qualifications.  Responsibilities: Take charge of the OAuth and API work to integrate various third party data sources in various formats. Build the infrastructure for optimal extraction, transformation and loading data from a wide variety of data sources using big data technologies.  You’ll collaborate with agency counterparts to define metrics for web, marketing, app, and operational-related initiatives; you'll work with the data engineer in modeling and maintaining KPIs. You’ll own the development of metrics, data models and the underlying ETL/ELT pipeline that powers the dashboards and reporting designed by our agency counterparts, which in turn supports strategic decision-making by leadership. Work with the data engineer to automate, design, build, deploy, and optimize the data architecture and estimated time to launch pipelines to make accessible for end users that enable self-service consumption. You’ll act as both the technical and business expert to help streamline decision-making between our data engineering team, and core business services, including media, SEO and business intelligence. You’ll identify and debug issues with core metrics, and coordinate with fellow Analytics team members and stakeholders to utilize one source-of-truth. Develop and communicate strong opinions about best practices in Analytics Engineering. Strong drive to organize and document data and best practice in a reproducible manner. Develop batch audits of data ingestion, data pipeline, and data resource systems for availability, maintenance, reusability, performance, scalability, security, standardization, etc. to refine the end-to-end architecture. Competencies: 2+ years experience working in analytical capacity modeling and/or interpreting data (i.e., data analyst, data science, data engineer, consultant). Degree in Computer Science, Math, Statistics, Engineering, Economics, Information Systems, or hands-on job experience with data science or analytics.  Experience using data integration software such as Adverity, Fivetran or Stitch. Experience communicating with third party endpoints for data extraction. Highly skilled at writing and interpreting complex SQL queries. Experience with modern data stacks (Big Query, Microsoft SQL Server, Google Cloud Functions, ETL tools such as Airflow, dbt, etc). Working knowledge of a scripting language for data processing (e.g. Python). Ability to precisely and effectively communicate technical challenges and limitations, and the results of your analyses directly to both technical and non-technical stakeholders. Underlying understanding of databases and data structures Possess an intuition for understanding underlying business needs and a knack for dealing with ambiguity. Nice to Haves: Experience building dashboards with a data visualization tools (e.g. Tableau, Looker) Experience working with marketing (Google Ads, Facebook Ads, etc) platforms and data, or have worked on measuring sales performance indicators. Prior experience in Marketing Focused Roles, Analytics Consulting, or a Growth Stage company Ready to be part of a tight-knit, growing team; ambitious, can work independently as well as collaboratively and possess interpersonal skills What We Provide : 100% Health, Dental, and Vision Coverage: We pay the monthly premium for all employees and cover 70% for spouses, partner, and dependents 3% Non-Elective 401k Match: We contribute to your retirement even if you choose not to Unlimited Vacation. On average, AKDM employees take 20+ days of vacation and we encourage each other to take time off as needed Unlimited Sick Days: We want our team to stay healthy and stay home when they need to Holidays: We observe all major holidays and encourage our employees to celebrate their cultural and ethnic traditions without having to take PTO Paid Parental Leave: We provide 12 weeks paid leave for primary and secondary caregivers plus flexibility in case more time is needed Mentorship Program: Mentees receive one-on-one support from the leadership team to receive practical advice and guidance in developing future career goals Flexible work from home policy What We Value:  At AKDM we believe diversity is essential to crafting digital strategies. We're proud to be an equal opportunity employer committed to diversity and inclusion. We do not discriminate on the basis of race, gender, ethnicity, citizenship, national origin of employees, religion, sexual orientation, age, marital status, disability, veteran status or any other legally protected status. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Mid-Senior level", "employmentType": "Full-time", "jobFunction": "Information Technology, Engineering, and Analyst", "industry": "Advertising Services"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Associate", "jobId": "3369749727", "companyName": "First Help Financial", "location": "Needham, MA", "datePosted": "2022-11-21", "link": "https://www.linkedin.com/jobs/view/data-analytics-associate-at-first-help-financial-3369749727?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=d35JAd0QSD0XHwB8%2F0DRvw%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "First Help Financial  is one of the fastest growing and most diverse companies in the U.S. We provide auto loans to the underserved and care for our customers and partners with exceptional service. Through flexible financing options and tri-lingual support, we offer consumers an easier way to finance their first car. We lend to and support our portfolio which has consistently grown 40% each year over the last five years. Are you a data science professional that enjoys statistical modeling? Here you will find hard-working colleagues that come from over 20 countries. We hold ourselves to the highest standards of professionalism but also enjoy our work. Our culture and benefits are geared towards making you successful in life and comfortable at work. Your Title:  Data Analytics Associate Your Location:  Remote/ Anywhere in the US You Report To:  Senior Manager, Data Analytics Compensation:  $60,000+ plus bonus! About the Opportunity: First Help Financial, voted and certified as a “Great Place to Work” by our workforce for two years in a row, is adding a new partner to our Data Analytics and Strategy department to accommodate our remarkable growth! The Data Analytics role will work closely with the CEO and other C-level execs to play a pivotal role in growing the company. You will see the challenges and opportunities of building a company through technology and data and use internal and external data to influence decision making. As part of a very small team focused exclusively on Strategy & Analytics, you will see everything that it takes to grow a business. Portfolio Analytics  Design and develop analytical infrastructure to monitor portfolio performance including KPI dashboards, reports and other tools.  Derive analytical insights from portfolio data and evaluate risk profile trends.  Develop pricing models to evaluate and price bulk portfolios for purchase  Conduct analysis on impact on portfolio due to changes in the macroeconomic factors and make business recommendations Operations Analytics  Develop metrics to monitor and improve collector effectiveness along several key Servicing dimensions  Formulate actionable tasks to lower delinquency rates, losses and roll-rates  Ideate and innovate superior collection strategies to increase the effectiveness and efficiency of collector activities  Champion operational process improvements to leverage technology & analytical tools as appropriate. Standardize & automate reports generation. Cross-functional  Partner with Servicing Operations team to leverage analytics to develop superior operational processes  Partner with Technology team for evaluation and roll out of cutting-edge innovation in financial technology.  Coordinate with Risk team to refine existing underwriting models and build newer risk models  Support C-level executives with ad hoc analyses to address specific business problems. Provide operational support to Servicing team as required What you bring:  Bachelor’s degree in Finance, Statistics, Mathematics, Engineering or similar is required  2+ years experience as a Data Scientist/Statistical Modeling  Advanced expertise in Microsoft Excel and Microsoft PowerPoint  Strong written communication skills, with an ability to create clear and concise communication  Strong oral communication skills, with experience in presenting to mid-senior management  Basic exposure to translating a business problem into a structured analysis. Experience in analyzing large and complex data sets  Experience in business analytics and data-based decision making  Experience with a data scripting language (Python, SAS, R)  Experience with SQL or relational databases (Candidate will be trained on harnessing big data using SQL queries for analytics) Differentiating Factors:  Masters in a highly quantitative discipline such as Statistics is preferred  2+ years experience in a consulting capacity  Experience with VBA for Excel  Experience with machine learning principals such as AB testing, association analysis, clustering, decision trees, neural networks, principal component analysis, regression, etc. FHF Benefits: Great Perks – We offer generous salaries, competitive health and welfare benefits, paid vacation, 401(k) match, tuition reimbursement, quarterly social outings, monthly lunches, a robust employee recognition, and training development program to enhance your career with us. Culture - We are believers in maintaining a healthy work-life balance. While we work hard and care deeply about our customers and partners, we want you to have room for your family, friends, and yourself. Growth - Company growth provides unprecedented career growth. FHF’s extraordinary year over year growth in revenue and new markets provides opportunity for you to establish and develop your career growth. We engage each employee to build a career plan that benefits everyone, and we have a proven record of investing in you. Diversity and Inclusion: FHF is committed to building a culture that respects and embraces all walks of life, inclusive of all genders, race, culture, age, sexual orientation, and other identities. We will make accommodations when interviewing anyone with special needs. Keywords: Data Science, Data Scientist, Statistical Modeling\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Associate", "employmentType": "Full-time", "jobFunction": "Analyst", "industry": "Technology, Information and Internet"},
{"programName": "Data Analytics Engineering", "title": "Software Data Engineer - Analytics Engineering", "jobId": "3184476269", "companyName": "Apple", "location": "Seattle, WA", "datePosted": "2022-11-13", "link": "https://www.linkedin.com/jobs/view/software-data-engineer-analytics-engineering-at-apple-3184476269?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=V5%2FzXF4h1mjfMi5%2BszkyKw%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology! These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries!  These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services.  Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, forward-thinking, and cross-functional, offering greater exposure to the array of opportunities here.   Key Qualifications   5+ years of programming experience Proven understanding on the following distributed data processing platforms: Spark, Hadoop Solid understanding of HBase, Kafka, Java Map Reduce or Scala Experience developing new algorithms and data structures to process large scale data efficiently Distributed Algorithms to process and mine data, e.g. Map Reduce Algorithm Able to gather multi-functional requirements and translate them into practical engineering tasks Graph, Data classification and clustering algorithms in distributed environment Good debugging, critical thinking, and interpersonal skills Knowledge in engineering machine learning, feature engineering systems is desired Ability to stay focused and prioritize a full workload while achieving extraordinary quality   Description   The Apple Mediate Products Analytics team is responsible for collecting, analyzing, and reporting on customer experience data. From this data we generate insights into how customers interact with our products, and use these insights to drive improvements to user-facing features.   As a member of the Data Engineering team, you will have significant responsibility and influence in shaping its future direction. This role is inherently cross-functional and the ideal candidate will work across disciplines. We are looking for someone with a love for data and ability to iterate quickly on all stages of data pipeline.   This position involves working on a small team to develop large scale data pipelines and analytical solutions using Big Data technologies. Successful candidates will have strong engineering skills and communication, as well as a belief that data driven processes lead to phenomenal products.   Education & Experience   MS or BS degree in Computer Science or a related field Apple is an equal opportunity employer and value diversity at our company. Apple does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.   Role Number: 200403515 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Director of Data & Analytics", "jobId": "3326593193", "companyName": "Lawrence Harvey", "location": "United States", "datePosted": "2022-11-23", "link": "https://www.linkedin.com/jobs/view/director-of-data-analytics-at-lawrence-harvey-3326593193?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=7wk4jb5HrfrMXm6z2QIZnA%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Lawrence Harvey is partnering with a mid-size marketing analytics firm who are building their Data Engineer team and looking for a VP who's looking to take the next step in a more SR role to help them take the next level! In this position, you will lead a small team of Data Engineers to help build out this companies newest data platform to generate insights for various business units. This role reports directly to the CEO Salary: $175-200k + 20% bonus Skills Required: Hands-on data Data Engineering experience Ability to road map and move and be a part of a growing team Track record of mentoring and developing teams of data engineers Ability and willingness to communicate and collaborate with teams across various business units If your a Engineering leader with a passion to grow and develop others, this position is the one for you! Please reach out to me directly via email: j.contreras@lawrenceharvey.com \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Engineering", "industry": "Software Development and Telecommunications"},
{"programName": "Data Analytics Engineering", "title": "VP, Data & Analytics", "jobId": "3333555986", "companyName": "Vuori", "location": "Carlsbad, CA", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/vp-data-analytics-at-vuori-3333555986?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=gSkVz8MBbdvb1fyMLAbeDg%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Title:   VP, Data & Analytics Reports to:   Chief Information Officer (CIO) Brand Overview: Vuori is re-defining what athletic apparel looks like: built to move and sweat in but designed with a casual aesthetic to transition into everyday life. Our high energy, fast paced office environment is reflected in the clothes we make. We aim to inspire others to take on all aspects of their lives with clarity, enthusiasm and purpose….while having a lot of fun along the way. We are proud to be an outlet for opportunity of personal growth and success. Role Overview: Vuori is seeking an experienced Data and Analytics leader to join the organization as Vice President, Data and Analytics. Reporting to the CIO, this role will drive the vision, strategy, and creation of a best-in-class Data and Analytics organization that enables Vuori to unlock insights to drive critical operational and strategic decisions across all aspects of our business. This leader will oversee the company’s data and analytics functions with a focus on enhancing capabilities and democratizing data to enable data-driven decisions across all levels of the organization. As the leader of this team, the VP, Data & Analytics will drive the strategy and direction of the Data and Analytics organization while providing exceptional services and solutions to Vuori’s internal and external business partners. They will have the opportunity to shape and deliver world-class analytical capabilities in support of Vuori’s mission. Immediate focus for this role will be on advancing the Data & Analytics team’s capabilities, confirming long-term architectural direction, developing leading-edge solutions, and creating close partnership with business stakeholders. Responsibilities include but are not limited to: Partner with business stakeholders to develop a cohesive vision and prioritized multi-year roadmap to create advanced data and analytics capabilities Collaborate across business units to deliver new and innovated services and solutions that help Vuori to achieve its mission Partner with business leaders to identify, develop, and drive adoption of actionable insights Partner with key business executives to develop and drive a Data Governance framework that enables a common data language and creates trust in enterprise data Continuously innovate the data and analytics platforms and tools architecture to meet current and future needs Build a trusted and highly capable Data & Analytics organization that may include Data Engineers, Architects, Data Analysts, Data Scientists, and Report Designers Ensure the data and analytics frameworks follow best practices for maintainability, recoverability, and high-performance Implement a right-sized SDLC methodology to effectively and efficiently manage change through a complex business and technical environment Strive for operational excellence in all aspects of the Data & Analytics organization - program, process, team and technology Budget oversight and vendor management as appropriate  Educational/ Position Requirements:  12+ years’ experience in the data warehouse, data lake, business intelligence, and the analytics space 7+ years of leading successful Data and Analytics organizations with significant experience in building highly adopted solutions that positively impact the bottom line 7+ years’ experience in team leadership and management 5+ years developing corporate KPI dashboards and reports that drive organizational insight from data Expertise in leveraging analytics for competitive advantage and business enhancement across the enterprise Able to translate business strategy into Data and Analytics vision, drive creation and execution of multi-year roadmap Expertise in data strategy, data architecture, data engineering, advanced analytics, data science, data mining, and machine learning Expertise in defining and evolving Data and Analytics platforms, tools, and solutions architectures in an enterprise environment Expertise in implementing appropriate Data and Analytics SDLC methodologies for controlled and iterative development of high-quality solutions Experience implementing an enterprise-level Data Governance program by partnering across the business and using best-practices to enforce data consistency across the Data and Analytics platforms, tools, and solutions Highly skilled at assembling, leading, and growing high-performing teams in a fast-paced, business-focused environment Experience communicating (both written and verbally) to diverse audiences, specifically delivering compelling presentations and telling the story with action-oriented implications Proven track record implementing highly functional/automated operational and support processes in 24x7 global business environment Exposure to a variety of Data Integration/ETL tools Experience with a variety of BI and Analytics platforms like Power BI, Tableau, DOMO, Looker, PowerBI, Alteryx, and advanced statistical analysis tools like SAS or SSPS Experience with a variety of cloud-based data warehouse/platform offerings like Snowflake, Redshift, Azure Synapse, S3, etc Experience with Big Data and NoSQL technologies Who you are: A change agent who challenges the status quo. Thought leader who stay on top of current and emerging technology trends to discover new and innovative ways to exploit data for strategic advantage Able to effectively drive business, culture and technology change in a dynamic and complex operating environment Results-oriented, detailed, energetic, and focused with a strong desire to learn and succeed. Takes on new opportunities and tough challenges with a sense of urgency, high energy, and enthusiasm. Builds partnerships and works collaboratively across the organization with others to meet shared objectives. Relies on a mixture of analysis, wisdom, experience, and judgment when making decisions. This role is sourced directly by Vuori, Inc, and all communication from our team @vuoriclothing.com. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Executive", "employmentType": "Full-time", "jobFunction": "Information Technology and Product Management", "industry": "Retail Apparel and Fashion, Retail, and Wellness and Fitness Services"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3322741273", "companyName": "Bose Corporation", "location": "Framingham, MA", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-bose-corporation-3322741273?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=pnYWizj7pIKWquh%2BwF%2FPJQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Bose is about better sound, but better sound is just the beginning. We’re about inventing new technologies that truly benefit people and creating a culture where innovation and teamwork are highly valued. Working at Bose, you’re encouraged to question conventional thinking in the relentless quest to create products and experiences that change people's lives. Data analytics and data science are a crucial part of our mission, fueling the creation of new and innovative products, helping us to bring the right products to the right customers, and allowing us to astonish customers with carefully crafted and personalized experiences. We are looking for a Data Analytics Engineer within our Data and Analytics Center of Excellence. The mission of this team is to develop world-class data science, machine learning, and statistical solutions to extract insights and enable data driven decisions that improve our business and enhance customer experiences. This Data Analytics Engineer role will be critical to help drive analysis, data science, and reporting across many diverse data sets to make sure we deliver impact from our data products and services. This includes working with raw data sets that leads to development of logical and physical data models, data wrangling and design / building of semantic layer that helps to create dashboards and models that drive insights and actions. This work will directly inform and influence multiple division’s strategies. This is a unique opportunity to shape the experiences, technologies, and products that millions of people will use. The ideal candidate has a deep understanding of data modeling, SQL, data warehouses / data lake and data engineering skills. You will often serve as an internal expert about the data, what it means and how it can be used to solve business problems. You can demonstrate that you have experience deeply understanding the data structure and transformations required to develop a semantic layer for data analysts and scientists. We are seeking a highly motivated, detail-oriented engineer who is passionate about data and enabling data-driven decisions. Primary Responsibilities Leverage DBT to mine , analyze, and transform large structured and unstructured datasets, collaborating with analysts, data scientists, and business users to create actionable metrics and datasets that solve business questions.  Provide expertise in query building and data modeling to ensure data is made available in a timely, efficient, and comprehendible means. Help define the strategy and standards for analytical engineering. Help define testing and data quality programs leveraging dbt Cloud Partner with our other teams to ensure documentation, privacy, and best in class coding practices are implemented within Analytical engineering. Act as SME for specific data domains by enabling analytical data sets for ad-hoc analysis  Engage with key stakeholders in the business, product and software teams to clearly understand and scope analytical requests.  Qualifications Extensive background and demonstrated track record in building analytical models in SQL. Strong technical skills, including experience with analytics, query and data visualization tools. Experience with Snowflake, dbt, and Python is preferred. Excellent communication skills, and the ability to explain deep technical results to diverse groups of stakeholders.  A life-long learner who is curious, has a passion for solving hard, ill-defined problems, has comfort taking initiative and who continuously seeks to improve their skills and understanding. Enjoys working in a team environment as well as independently.  Education Bachelor’s or Master’s degree in math, physics, computer science, engineering, business, finance, marketing, economics or related quantitative or computational field  Work Experience 3+ years of related data analytics experience in relevant consulting, finance, data science or market intelligence functions  Previous experience in a consumer electronics environment, particularly in a technical field, is a definite plus  Previous experience with mobile app data is a plus  What's In It For You Be a part of and work with a top notch, multidisciplinary, transparent, and agile team.  Collaborate with people like you who want to solve problems and have fun together.  Work on developing innovative Wellness products that improve people's lives.  Excellent work life balance and a continuous learning environment.  Highly competitive package as well as a comprehensive benefits program.  We strive to help our employees and customers reach their fullest potential.  Compensation for this role for a candidate based in Colorado is expected to be between $101,800 and $130,300 and for a candidate based in NYC to be between $101,800 and $130,300 . Actual pay may be higher or lower depending on geographic locations, skills, experience, and other factors permitted by law. This role is also eligible to receive a bonus, which is not guaranteed and may be based on individual and company performance.  Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing and Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3375106879", "companyName": "TechnologyAdvice", "location": "Nashville, TN", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-technologyadvice-3375106879?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=SaMC9Z3ejlyhG6Dt2027ow%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Hi, we're TechnologyAdvice. At TechnologyAdvice, we pride ourselves on helping B2B tech buyers manage the complexity and risk of the buying process. We are a trusted source of information for tech buyers, delivering advice and facilitating connections between our buyers and the world's leading sellers of business technology. Headquartered in Nashville, Tennessee, we are a remote-first company with more than 20 digital publications and over 500 global team members in the US, UK, Singapore, and Australia. We're proud to have been repeatedly recognized as one of America's fastest growing private companies by Inc., as well as a Tennessee top workplace. We work hard each day and have fun, too, with monthly virtual events, recreational slack channels, and the occasional costumed dance from our CEO. All positions are open to remote work unless otherwise specified in the requirements below. The opportunity We are looking for an  Data  Analytics Engineer  to be a part of our Business Intelligence team! You will work closely with our Data Analysts, Revenue Ops, Dev Ops, and Product teams to build, manage, and optimize the systems and processes that collect, manage, and transform our data into information for our teams to analyze and feed into other systems. What You'll Do Create, maintain, and optimize data pipelines and pipeline architecture Assemble and transform large, complex data into data sets that meet our business needs Create data validation and quality assurance methods Build processes supporting data transformation, data structures, dependencies, and workload management Work with Business Stakeholders and the Business Intelligence team to support data infrastructure needs Identify opportunities and implement strategies to scale and optimize our data operations Who You Are Advanced working knowledge of SQL Experience working with large relational databases Working experience with AWS Redshift preferred and bonus points for Google BigQuery  Working experience with dbt Working experience with ETL tools, Fivetran preferred Experience with scripting languages: Python, Scala, etc.  Experience with Tableau is preferred What We Offer You Our benefits and programs are designed to make your life better for you and your family... Flexible schedule with remote, hybrid and on-site options Comprehensive medical, dental and vision insurance 401K with company matching Flexible paid time off Paid maternity and paternity leave Pet insurance for your furry family members and co-workers  Wellness perks that include the Headspace App and monthly fitness reimbursements Ongoing career development opportunities, mentorship program, bucket list benefit, and more In-office snacks, beverages, catered meals, and even some ping pong Beer on Fridays Work authorization Employer work visa sponsorship and support are not provided for this role. Applicants must be currently authorized to work in the United States at hire and must maintain authorization to work in the United States throughout their employment with our company. EOE statement We believe that our differences make us stronger, and thus foster a diverse and inclusive culture where people feel safe being themselves. TechnologyAdvice is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, age, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected under federal, state or local law. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Technology, Information and Internet"},
{"programName": "Data Analytics Engineering", "title": "Data Analyst – Analytics and Insights - Data Center of Excellence", "jobId": "3325611699", "companyName": "Bose Corporation", "location": "Framingham, MA", "datePosted": null, "link": "https://www.linkedin.com/jobs/view/data-analyst-%E2%80%93-analytics-and-insights-data-center-of-excellence-at-bose-corporation-3325611699?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=D%2FOoZ4XXTy3t%2BH%2B3xpbcJw%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Job Description Do you love working with data? Would you like to use your Data Analytics skills to solve real world problems and improve people’s lives by analyzing App, product, operational and marketing data? Bose produces innovative products and experiences that improve our customer’s lives. This is a unique opportunity to shape the experiences, technologies, and products that millions of people will use. As part of the CoE team, you will evangelize a data-driven culture throughout the organization and enable products grounded in science and powered by AI which improve our customer’s experience. This Data Analyst role will drive analysis and reporting across many diverse data sets to make sure we deliver impact from our data products and services. This includes identifying and categorizing patterns across product usage, creating user profiles, analysis of review data and creating dashboards and reports that display actionable business metrics. This work will directly inform and influence multiple division’s strategies. The ideal candidate has a deep understanding of data analytics and visualizations, coupled with creativity and business acumen needed to develop insight. Because you will often serve as an internal expert about the data, what it means and how it can be used to solve business problems, you can demonstrate that you have experience deeply understanding the data structure and applying rigorous analytical methods to derive actionable recommendations. We are seeking a highly motivated, detail-oriented analyst who can transform raw data into meaningful insights, providing actionable recommendations. This individual will be part of an extended team. Primary Responsibilities Engage with key stakeholders in the business, product, and software teams to clearly understand and scope analytical requests.  Partner with colleagues working with survey data or online review data to integrate these kinds of data into reporting and analysis to solve business questions.  Support one or more product categories with ad hoc analysis of product and app usage data to support business decisions.  Partner with internal data and systems resources to understand the structure and format of data sources and ensure data integrity and availability to support analytical requirements.  Lead data analysis, synthesize results, and develop and present strategic recommendations for the executive leadership and product teams that inspire action.  Will be responsible for data analytics across multiple apps and products  Creates analytical data sets for ad-hoc analysis  Develops data visualizations and reporting to represent KPI’s  Will be an SME for specific data domains  Mine, analyze, and model large structured and unstructured datasets to create actionable business metrics and solve business questions.  Create custom, targeted reports and dashboards that deliver insights into the current product and app usage and customer response to new features/capabilities or marketing experiments.  Identify data quality issues  Owns data sets and data visualizations they create Assist with PowerBI ecosystem development across the Data and Analytics group Qualifications Strong PowerBI coding, visualization, and customization skills. Certifications a plus. Extensive background and demonstrated track record in obtaining and analyzing quantitative data to solve actual business problems.  Strong technical skills, including experience with analytics, query and data visualization tools. SQL and PowerBI experience a must. Programming languages, e.g. Python is strongly desired. Experience with Snowflake a plus. Excellent communication and presentation skills, and the ability to explain analysis and insights to diverse groups of stakeholders.  A life-long learner who is curious, has a passion for solving hard, ill-defined problems, has comfort taking initiative and who continuously seeks to improve their skills and understanding.  Enjoys working in a team environment as well as independently  Ability to work with teams and stakeholders that are geographically displaced. Education Bachelor’s or Master’s degree in math, physics, computer science, engineering, business, finance, marketing, economics or related quantitative or computational field  Work Experience 4+ years of related data analytics experience in relevant consulting, analytics, market intelligence functions or related business experience Previous analytical experience in a consumer electronics environment is a definite plus Previous experience with analyzing app and product data is a plus  What's In It For You Be a part of and work with a top notch, multidisciplinary, transparent, and agile team.  Collaborate with people like you who want to solve problems and have fun together.  Excellent work life balance and a continuous learning environment.  Highly competitive package as well as a comprehensive benefits program.  We strive to help our employees and customers reach their fullest potential. Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing and Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analyst, Process and Analytics", "jobId": "3358596761", "companyName": "Tesla", "location": "Fremont, CA", "datePosted": "2022-10-22", "link": "https://www.linkedin.com/jobs/view/data-analyst-process-and-analytics-at-tesla-3358596761?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=FOxR2xDRaRA5FZepT77FCQ%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "What to Expect  The Material Planning group in Supply Chain is responsible for the reliable and efficient flow of all production materials to Tesla’s factories and Service locations. As Data Analyst in the Process and Analytics team, you will deliver data insights that are critical in order to support increasing production volume and fleet size. You will work with the planning team and stakeholders in other organizations to define business requirements for reporting and formulate applicable data-driven solutions. This requires you to acquire subject matter knowledge about the Material Planning process, systems and KPIs. It is essential that you can think strategically, connecting the dots in the bigger picture, as well as being comfortable in the details of the deliverables. To be a successful candidate for this role you have to be a self-motivated for data analytics and continuously demonstrates an ability to tackle complex problems and implement solutions.  What You’ll Do Define key performance indicators to track process operational performance and apply data mining, analysis and visualization for KPI reporting  Identify, analyze, and interpret trends or patterns in complex data sets  Create reports and data visualizations to guide decision-making across material planning team  Drive problem solving and continuous improvement initiatives to improve supply chain operations processes  Support management with dashboards, KPIs and ad-hoc analyses  Use data to assess business impact and priorities  Independently handle multiple projects at a time meeting objectives and deadlines  Apply out of the box thinking, problem-solving abilities and operational supply chain experience to derive solutions  Gather and define business requirements Identify process gaps and areas for optimization and automation  Own system requirements, and participate in the software development process from design to user acceptance testing    What You’ll Bring Master’s degree in science or engineering or equivalent experience or evidence of exceptional ability  2+ years’ work experience in material planning, supply chain, manufacturing, or business operations  Evidence of exceptional analytical ability  Structured, data-driven and quantitative problem-solving approach  Ability to query from large data set in SQL, analyze and present data  Proven ability to set expectations, manage to deadlines and hold individuals and teams accountable to critical milestones  Ability to drive strategic discussions and convert strategy to action  Collaborative, flexible, open working style and an ability to establish trust and credibility  Excellent communication and leadership skills  Preferences Programming (R, Python)  Experience creating dashboards using Tableau (or similar) visualization tools \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Renewable Energy Semiconductor Manufacturing, Motor Vehicle Manufacturing, and Utilities"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Engineer", "jobId": "3322736929", "companyName": "Bose Corporation", "location": "United States", "datePosted": "2022-12-02", "link": "https://www.linkedin.com/jobs/view/data-analytics-engineer-at-bose-corporation-3322736929?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=IT92VCc3ck9ZtuNQ8C%2BsZA%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Description Bose is about better sound, but better sound is just the beginning. We’re about inventing new technologies that truly benefit people and creating a culture where innovation and teamwork are highly valued. Working at Bose, you’re encouraged to question conventional thinking in the relentless quest to create products and experiences that change people's lives. Data analytics and data science are a crucial part of our mission, fueling the creation of new and innovative products, helping us to bring the right products to the right customers, and allowing us to astonish customers with carefully crafted and personalized experiences. We are looking for a Data Analytics Engineer within our Data and Analytics Center of Excellence. The mission of this team is to develop world-class data science, machine learning, and statistical solutions to extract insights and enable data driven decisions that improve our business and enhance customer experiences. This Data Analytics Engineer role will be critical to help drive analysis, data science, and reporting across many diverse data sets to make sure we deliver impact from our data products and services. This includes working with raw data sets that leads to development of logical and physical data models, data wrangling and design / building of semantic layer that helps to create dashboards and models that drive insights and actions. This work will directly inform and influence multiple division’s strategies. This is a unique opportunity to shape the experiences, technologies, and products that millions of people will use. The ideal candidate has a deep understanding of data modeling, SQL, data warehouses / data lake and data engineering skills. You will often serve as an internal expert about the data, what it means and how it can be used to solve business problems. You can demonstrate that you have experience deeply understanding the data structure and transformations required to develop a semantic layer for data analysts and scientists. We are seeking a highly motivated, detail-oriented engineer who is passionate about data and enabling data-driven decisions. Primary Responsibilities Leverage DBT to mine , analyze, and transform large structured and unstructured datasets, collaborating with analysts, data scientists, and business users to create actionable metrics and datasets that solve business questions.  Provide expertise in query building and data modeling to ensure data is made available in a timely, efficient, and comprehendible means. Help define the strategy and standards for analytical engineering. Help define testing and data quality programs leveraging dbt Cloud Partner with our other teams to ensure documentation, privacy, and best in class coding practices are implemented within Analytical engineering. Act as SME for specific data domains by enabling analytical data sets for ad-hoc analysis  Engage with key stakeholders in the business, product and software teams to clearly understand and scope analytical requests.  Qualifications Extensive background and demonstrated track record in building analytical models in SQL. Strong technical skills, including experience with analytics, query and data visualization tools. Experience with Snowflake, dbt, and Python is preferred. Excellent communication skills, and the ability to explain deep technical results to diverse groups of stakeholders.  A life-long learner who is curious, has a passion for solving hard, ill-defined problems, has comfort taking initiative and who continuously seeks to improve their skills and understanding. Enjoys working in a team environment as well as independently.  Education Bachelor’s or Master’s degree in math, physics, computer science, engineering, business, finance, marketing, economics or related quantitative or computational field  Work Experience 3+ years of related data analytics experience in relevant consulting, finance, data science or market intelligence functions  Previous experience in a consumer electronics environment, particularly in a technical field, is a definite plus  Previous experience with mobile app data is a plus  What's In It For You Be a part of and work with a top notch, multidisciplinary, transparent, and agile team.  Collaborate with people like you who want to solve problems and have fun together.  Work on developing innovative Wellness products that improve people's lives.  Excellent work life balance and a continuous learning environment.  Highly competitive package as well as a comprehensive benefits program.  We strive to help our employees and customers reach their fullest potential.  Compensation for this role for a candidate based in Colorado is expected to be between $101,800 and $130,300 and for a candidate based in NYC to be between $101,800 and $130,300 . Actual pay may be higher or lower depending on geographic locations, skills, experience, and other factors permitted by law. This role is also eligible to receive a bonus, which is not guaranteed and may be based on individual and company performance.  Bose is an equal opportunity employer that is committed to inclusion and diversity. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, genetic information, national origin, age, disability, veteran status, or any other legally protected characteristics. For additional information, please review: (1) the EEO is the Law Poster (http://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pdf); and (2) its Supplements (http://www.dol.gov/ofccp/regs/compliance/posters/ofccpost.htm). Please note, the company's pay transparency is available at http://www.dol.gov/ofccp/pdf/EO13665_PrescribedNondiscriminationPostingLanguage_JRFQA508c.pdf. Bose is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the application or employment process, please send an e-mail to Wellbeing@bose.com and let us know the nature of your request and your contact information.\n       \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Entry level", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Motor Vehicle Manufacturing and Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Data Analytics Software Engineer", "jobId": "3337052662", "companyName": "Apple", "location": "Cupertino, CA", "datePosted": "2022-11-25", "link": "https://www.linkedin.com/jobs/view/data-analytics-software-engineer-at-apple-3337052662?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=SWbhlwgP63WY3oi9H9ZOng%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   The CoreMotion team has created innovative ways for users to improve their health with their devices through motion. When you exercise and move with your devices, it's the work of engineers and scientists on this team. As a member of our dynamic group, you will have the rare and rewarding opportunity to shape upcoming products that will delight and inspire millions of Apple's customers every single day. Join our CoreMotion team and enrich lives by shipping software that motivates fitness goals, improves health, and enhances the way customers interact with our products!   Key Qualifications   Proficient at one or more of the following domain: signal processing, sensor fusion, health analytics, statistics, data mining Interest or experience in implementing and supporting highly scalable systems Interest or experience in analyzing and working with large data sets, and proficient at data visualization Proficient at programming in Python for quantitative analysis on large-scale data Experience working with databases (SQL/NoSQL), comfortable with query languages and designing tables, views, indices, familiarity with AWS services/API such as S3 is a plus Experience building iOS App, and with C++ is a plus Experience in job scheduling, and stream processing knowledge with Spark framework is a plus Preferred applied experience with machine learning, and building models on large datasets Continuous learning and improvement mindset, willing to push yourself outside of your comfort zone   Description   In this role, you will be highly involved in driving design data quality and algorithm performance to develop our next generation of Health and Fitness features. This includes evaluating large user study datasets, design reviews, algorithm testing, bug reporting and triaging. Key responsibilities of this role are: Profile, process and evaluate large structured and unstructured motion datasets Challenge the design and implementation in the most logical way; design and perform analytics for algorithm verification and validation Create ETL to automate monitoring of quality assurance metrics to constantly track feature performance Participate and present in user study review, code review, and data review Communicate with upstream component (e.g. Hardware) and downstream component (e.g. App) to drive end to end user experience   Education & Experience   BS, MS, or PhD in Computer Science / Electrical Engineering / Mechanical Engineering or equivalent   Additional Requirements   Passionate about health and fitness technologies   Role Number: 200439659 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Engineering and Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Software Data Engineer - Analytics", "jobId": "3178547441", "companyName": "Apple", "location": "Cupertino, CA", "datePosted": "2022-11-28", "link": "https://www.linkedin.com/jobs/view/software-data-engineer-analytics-at-apple-3178547441?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=Rvusybcbz%2B8EFFUHnmAEhg%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Summary   Are you a fearless thinker? Do you love the challenge of advancing a widely accepted technology? In the Wireless Software group, you’ll be responsible for bringing groundbreaking wireless connectivity to the world through Wi-Fi, Bluetooth, GPS, and more. You’ll design, develop, and patent the next generation of our state-of-the art connectivity technologies. You’ll collaborate across departments to help craft wireless solutions that elevate the customer experience with Apple products and services. Our goal is to ensure nothing stands in the way of our customers’ connections with their devices. If you join us, you’ll help build world-renowned wireless systems so seamless that they almost feel like magic.  In this role you will work with various teams to deliver data, dashboards, and insightful performance-optimized analysis to facilitate business decisions. You’ll work with partners to understand their goals and requirements to define application features and strategic roadmaps to meet those needs.   Key Qualifications   -  Self-starter who is dedicated and demonstrates creative and critical thinking abilities -  Experience in developing product features, functional specifications, and development schedules, represent team and technology -  Experience in data modeling and data engineering and analytics experience -  Experience in data management and automation on Spark, Hadoop, and HDFS environments -  Experience handling data in relational databases and developing ETL pipelines -  Competency in Java, Scala, Python or similar object-oriented language -  Confidence with SQL databases and NoSQL databases like Cassandra -  Experience in Tableau or Splunk or ELK Stack or Airflow  -  Ability to independently learn new technologies -  Excellent debugging, critical thinking, and interpersonal skills -  Attention to detail   Description   This Role provides analytics for various internal programs and prototypes to support organization in data informed decisions. This role will require working with multiple large data sets, working knowledge of ETL, visualization tools like Tableau. You will engage directly with key business partners to build positive relationships and understand their business strategies and solution needs. Strong understanding of analytics needs and a proactive approach, focusing on reusable solutions to improve the efficiency and collaborate with multiple multi-functional teams and work on solutions which has larger impact on Apple business   Education & Experience   MS or BS in CS, Engineering, Math, Statistics, or a related field or equivalent practical experience in data engineering.   Additional Requirements   Understanding in big data pipelines using technologies like Kafka, Flume, or Storm Experience with large scale data warehousing, mining or analytic systems Machine learning is a plus……   Role Number: 200387601 \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Information Technology", "industry": "Computers and Electronics Manufacturing"},
{"programName": "Data Analytics Engineering", "title": "Business Analyst - Data Analytics- Remote", "jobId": "3270139595", "companyName": "McAfee", "location": "San Jose, CA", "datePosted": "2022-11-19", "link": "https://www.linkedin.com/jobs/view/business-analyst-data-analytics-remote-at-mcafee-3270139595?refId=ZqNDijR%2BvXbuHLqf7Sd8vA%3D%3D&trackingId=RIr3PFWlEAk2Eb9IQAQuzg%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card", "description": "Job Title Business Analyst - Data Analytics- Remote Role Overview Do you want to change the world? Come be a part of the transformation as McAfee enters a new age. We are all mission driven, both organizationally and functionally, and our primary passion is for our clients. It's a terrific moment to get started with analytics because they offer the business tremendous leverage for growth. This is a remote position with a U.S. base. We will only take into account applicants who reside in the United States, and we are not currently providing relocation help. About The Role Act as analytics liaison between business and data engineering teams to improve and dashboards, data visualizations, predictive models, and statistical analyses. Work with stakeholders across the organization to identify and establish standard KPIs,build and validate reports and dashboards to monitor and track performance. Work across different business and technical groups to drive agreement on definition of essential KPIs. Be an analytics expert, developing understanding of data about products, consumers and business processes in our data lake and databases. Work with product development teams to provide data capture requirements and ensure the completeness and quality of data sent to the data lake. Oversee the end to end delivery of reports, dashboards, and data products, including requirements gathering, implementation with data engineers and report developers, quality assurance, and driving user acceptance testing and adoption. About You 2-3+ years of analysis experience. Ability to demonstrate flexibility, voicing concerns and proposing alternatives. Able to recognize and interpret business issues/opportunities and recommend solutions through analysis. Excellent SQL skills and preferred knowledge of adobe analytics analysis. You are experienced in developing, implementing, testing, and maintaining methodologies for standardized and repeatable reporting for a variety of audiences. You are interested with large amounts of data. You have experience working with data visualization platforms, Tableau and MicroStrategy. Ability to demonstrate flexibility, voicing concerns and proposing alternatives. Able to recognize and interpret business issues/opportunities and recommend solutions through analysis. Company Overview McAfee is a leader in personal security for consumers. Focused on protecting people, not just devices, McAfee consumer solutions adapt to users’ needs in an always online world, empowering them to live securely through integrated, intuitive solutions that protects their families and communities with the right security at the right moment. Company Benefits And Perks We work hard to embrace diversity and inclusion and encourage everyone at McAfee to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees. Bonus Program Pension and Retirement Plans Medical, Dental and Vision Coverage Paid Time Off Paid Parental Leave Support for Community Involvement We're serious about our commitment to diversity which is why McAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status. For Colorado Residents the starting salary for this position is $61,500.00. McAfee takes into consideration an individual’s skillset and experience in making salary determinations. For further details, please discuss with the Talent Acquisition Partner. \n \n \n        Show more\n\n         \n \n \n        Show less", "seniorityLevel": "Not Applicable", "employmentType": "Full-time", "jobFunction": "Research, Analyst, and Information Technology", "industry": "Software Development"}
]